[
    {
        "index": 192,
        "label": 1,
        "content": "I have waited tables for the last three years.\n\nDuring my shift last night, a group of four women in their late 20s came in. They were a pleasure to have as customers. They ordered four of our house cocktails to start with and then went over the menu for their entrees. \n\nWhen I was on my way back to their booth with the drinks on a tray, I walked by the back side and overheard one of them talking about how she was 14 weeks along. When I rounded back, they were talking about the same topic and it was clear to me that she was pregnant. I figured her having one drink wasn't a big deal. They ordered their entrees and I went off to handle other tables.\n\nAbout five minutes later, they called me over again and asked for another round. At this point I started getting concerned, but I took the order and cheerfully said I'd be right back. This time, I went to the bartender, and asked him to make one of them a virgin cocktail. He was confused but since he's a good friend of mine, I told him to just trust me. \n\nA few cocktails later (hers strictly virgin) they started getting rowdy, and Mrs. Pregnant Woman was also getting into it. I figured that since she didn't notice, things were OK. The problem came when I took them their check, and they asked to split the bill at the register. When Mrs. Pregnant Woman got to the counter, I saw her cocktails were marked with (virgin). My bartender had edited each in the system for inventory.\n\nIt was too late for me to edit them back, so I just had her pay, hoping that she wouldn't look at the receipt. They all thanked me and left, leaving a generous tip in the process. They were talking in the parking lot for the next short while, presumably waiting for an Uber.\n\nSeveral minutes later Mrs. Pregnant Woman came back and asked what (virgin) on the receipt meant. I fessed up that it meant non-alcoholic. She blank stared me for a few seconds and then asked if she had ordered a non-alcoholic cocktail. I said no, but told her that I assumed she wanted one seeing as she was pregnant. It was a lame lie and I'll admit it, but she looked me in the eye and asked me to return her part of the tip. I did so. Then she talked to my manager. My manager took me into her office and literally shrieked at me until hoarse. \n\nI stood my ground and told her that I'm not going to be responsible for FAS. She told me that she was taking me off the calendar until she decided what to do with me. She also informed me that I could get the restaurant in serious trouble for discrimination, and upon examination of my state's laws, she is correct. \n\nBut when I talked to my mother and father about it tonight, they told me that they understood my position. The entire staff at the restaurant is against me and I think that I'm going to call in and tell my manager that I quit, but I still feel in the right here. I would like some perspective on this and if I'm the asshole here."
    },
    {
        "index": 627,
        "label": 1,
        "content": "So I (f26) have a boyfriend (m24) and recently he got into a dispute with the neighbour's kids. They accidentally kicked their football into our yard and they came into the garden to get it back. Tbh, I didnt care but my boyfriend started screaming at these like 11 year ds about how they are poorly raised and their parents should be ashamed. I. Was. Fucking. Mortified. I sent the kids some chocolates and sweets and apologised profusely for his behaviour. \n\nI was seeing red flags and told him this behaviour was NOT normal. He kind of brushed me off and I told him if he pulled anything like that again he was gone. \n\nThe next week the ball came into our garden and I was about to throw it back to the kids when my boyfriend stormed outside and took the ball inside. I told the kids that I would bring it back in a minute. He went into the bathroom and emerged like 10 minutes later wearing gloves and a football covered in shit. HIS OWN SHIT. WHAT THE FUCK.\n\nI asked him if he was out of his fucking mind but he stormed past me and threw it over the fence screaming \"TAKE THAT YOU BITCHES\". I screamed and girl I mean screamed at him about how he was a fucking douche and I wanted him out of my house and he is a disgusting fucking monster and that they were just kids. I screamed and screamed and eventually he left.\n\nI deleted all his games off of his ps4 and gave it to the kids as an apology. I was so embarrassed.\n\nMy ex-bf's mom messaged me asking what happened and I responded with\n\n\"What happened? WHAT HAPPENED? You are a pathetic excuse of a woman who raised a fucking sociopath who covered a football in his own shit and threw it at some kids and he needs to be a in a facility because something is wrong with him and god knows how I hadn't seen any red flags about the fucking monster you raised during the 7 months we dated\".\n\nI know I am in the right for what I did to my bf but am I in the wrong for snapping at the mother for something she had no direct involvement in?"
    },
    {
        "index": 836,
        "label": 1,
        "content": " Throwaway for obvious reasons.\n\nMy girlfriend and I have been together for over 2 years. She has always been very neat, tidy, and very polished. She cares about her appearance, and I appreciate that.\n\nSo this situation makes no sense to me.\n\nWe were at a very fancy event with a few of my friends (social distancing rules, every one wore masks etc.) My girlfriend was wearing a beautiful white dress, which I recently bought for her. The dress was very expensive.  We were all having a good time.\n\nHowever, at one point, she excused herself to go the bathroom, and then I didn't see her again until she sent me a text from the car asking if we could go home.\n\nObviously I'm slightly annoyed because I didn't want to leave so soon. When I reached the car and asked why she wanted to go home, she told me that she got her period unexpectedly. I asked why she didn't bring extra tampons or pads (or use those tracking apps) she tried to defend herself by saying that she did everything she could, and that she had a period stain, and didn't want to stay because of the stain. \n\nShe asked me to lie to my friends, and tell them that she was feeling  \"unwell\" so that she could go home. She had a man's jacket (a mutual friend of ours) covering her legs (and the nasty stain) and pleaded with me to take her home so she could shower and unwind.\n\nI took her home and lied to my friends. When she was getting out of the car, the stain was very noticeable, it was very big and essentially ruined an expensive dress which I bought. She also made me purposefully lie because she wasn't prepared enough, and made me miss an event with my friends. Needless to say, I was extremely pissed. \n\nShe said I was not being considerate and went to go lie down because she had a \"headache\" (she wanted to lie down after she took a shower)\n\nShe woke up and I haven't spoken to her properly until she apologizes, and gives back the friends jacket. I don't think I'm an AH, but when I told my friend (the same friend who gave her a jacket) he told me that I was the AH, and my GF kind of agreed.\n\nAITA?\n\nEDIT: I guess I'm the AH. I logged out of this account about an hour after posting because the response was terrible, and then came back to a TON of responses calling me the AH.\n\nAfter my girlfriend came home from returning the jacket, she apologized for ruining the dress and I apologized for being a dumbas and not understanding the whole 'period' thing. She forgave me, then we went out for ice cream and rewatched her favorite movie. That's the end of the story."
    },
    {
        "index": 862,
        "label": 1,
        "content": "My ex husband and I share custody of our 10 year old daughter and 12 year old son. We have a 2-2-3 schedule which usually looks like I have the kids Friday after school and then he gets them Monday after school. I get them back Wednesday after school and then he gets them Friday after school and then the week flip flops. We've done this since our divorce 5 years ago and it works well. I'm a nurse in the OR so I schedule my shifts for the days during the week when they are with their dad and my one call weekend every 6 weeks is a weekend they are with their dad. \n\nRecently, the kids said they want to try splitting up on the weekends, so instead of both of them being with one us during the weekend, one will go with dad and one will be with me. My son said he would make sure he was with me on call weekends because he can stay by himself if I have to get called in or can hang out at the hospital until I'm done. My ex is on board with this because he says it will allow us to spend one on one time with the kids and will allow the kids a break from each other (they squabble occasionally and annoy one another). While they have a point- sometimes it is hard to not feel like you are disappointing one by trying to accommodate the other, I do not want to give up my free weekends. It took me a few months to get used to not having my kids all the time after the divorce but now my weekends without them are filled with activities or travel. My ex agreed if there was a weekend trip I wanted to take he would be fine having both the kids that weekend but I honestly don't want to have to take his schedule into consideration when planning my trips, and sometimes they are spontaneous trips. \n\nI was talking to my family about this at breakfast this morning and they are all kind of appalled by me not wanting to do this. My sister pointed out that if I was still married, then I wouldn't have all the child free time I have now and many mothers don't get a break from their kids like I do. My mom said she can't believe I'd deny my children quality time with their parents for selfish reasons like not wanting to give up my weekends. My SIL seemed to understand where I was coming from but said that she would still do it and just incorporate the child into whatever I was doing and pointed out my daughter would love to go on the NYC shopping trip I had planned for December and my son would happily join me for my Saturday morning spin classes. I considered that but my SIL loves taking her kids everywhere so I don't know that she is aware of how nice it is to just be an adult without the responsibility of a child wherever you go. They were really making me feel like an asshole though. AITA?"
    },
    {
        "index": 628,
        "label": 1,
        "content": "My friends and I went sightseeing, aware that the weather forecast was warning of heavy rain.\n\nWe’re from England, where the correct response to rain is to not acknowledge it, but things are a little different in Japan. It is impossible to walk outside without getting fully soaked. I warned my friends of this and stopped at a shop to buy an umbrella. They were reluctant to get one; either underestimating the rain or thinking they could get one later, if it actually rained.\n\nI warned them multiple times that if it rains, I would not let them borrow my umbrella.\n\nOne friend had a raincoat so was mostly fine but the other did not. I reminded them that I would not share a few more times while we were walking. \n\nRoughly an hour later, it started raining. Hard. It was unlikely to stop raining any time soon and we had a train to catch so we walked in the rain for half an hour to the train station. I stood by my word and refused to let them use my umbrella (which could easily fit 2 people under it). When we arrived, the friend without the raincoat was completely soaked, and the other was far from dry. Neither were particularly happy.\n\nAITA for standing by my word and not saving my friend from the rain?"
    },
    {
        "index": 785,
        "label": 1,
        "content": "My MIL has made a small \"family quilt\" for all of her kids and their spouses (5 couples including us). The quilt is really cute, has the couple's names, their kids' names, and their favorite hobbies and things all done in stitching and cute little cloth pictures. I was really looking forward to getting ours because I admit I'm a bit of a hipster and I love home-made kitschy stuff like that for our home.\n\nShe recently finished her latest one for my husband's brother and I thought we were getting ours soon since my husband is the youngest. I asked my SIL (she got hers first) and she very awkwardly informed me that no such quilt will be coming our way. I was a bit upset and asked my husband to investigate. Turns out MIL has no intention of making a quilt for us because there's not enough to put on all the squares or whatever, basically meaning since we don't have kids we don't deserve a quilt because she can't be bothered.\n\nI message her directly about it because I'm just that kind of person. I like hearing it straight from the other guy. MIL says her fingers hurt after the first 4 quilts and she's taking a break. I ask her if it has anything to do with the fact that we have no kids (which she expressed negativity against in the past) and she says no even though I know it's a lie. I push her more and ask her when she thinks the quilt will be done after her little \"break\" and she kind of loses her temper and says there's no quilt and there never will be a quilt.\n\nI ask why and she says she's only interest in making quilts with her grandkids and things on them and we don't have enough hobbies and kids' hobbies to fill up a whole quilt. I tell her we have 2 beautiful dogs whom we love and could be put on there and she says \"I'm not making a whole quilt for a couple of goddamn dogs\" verbatim. I hang up and tell my husband and he's 100% on my side.\n\nBut now I got a really mean voice message from my SIL telling me that I crossed the line and am acting like a huge B\\*tch for no reason. I'm shocked because I have a great relationship with my SIL and she always defended me from other family bullshit. My husband wants no part in this now. AITA for what I said to my MIL?"
    },
    {
        "index": 73,
        "label": 1,
        "content": "I have been living with my new wife and stepdaughter for about 6 months now. She’s 19, almost 20, and I have three sons aged 18, 16 and 15. She’s a really good kid and she’s a good influence on my sons, I really enjoy having her around. My wife and her daughter moved into my house and sold theirs. My stepdaughters father isn’t present in her life, nor is my sons’ mother. All four children share a bathroom.\n\nMy sons have never lived for a long period of time with a woman, nor have any of them had long term girlfriends. They had short visitation periods when they were younger but never longer than an hour, so living with two women has been unusual for them. \n\nMy eldest son, 18, came to me last week and told me that his stepsister disposes of her used sanitary products in the trash can they share, but doesn’t use toilet roll or sandwich bags to disguise what they are, and it makes him uncomfortable which I think is reasonable. My sons are teenage boys and don’t want to see their stepsisters period products on full display.\n\nA few nights ago I went into the kitchen to grab a snack and she was there doing some work for university. My wife had mentioned that she knew she was on her period so I took it as an opportunity to have a word with her. I told her my sons were uncomfortable and asked her if she’d mind putting her used products in diaper bags or flushing them down the toilet. \n\nShe laughed and told me it was rich coming from a man who “sheds like a gorilla” and has produced “three skid marking sons” which I thought was just an unnecessary attack. I’ve been nothing but nice to the girl and it’s hardly a comparison. My sons shouldn’t be subjected to her unhygienic products if it makes them uncomfortable. She went on to lecture me about how tampons can’t be flushed and that it’s bad for the environment if she uses diaper bags for every one which I think is just an excuse. I called her a scruff and told her that this was my house and that what I say goes. \n\nI later asked my wife if she could have a word with her and she told me I was being ridiculous and that her daughter has had her period for ten years and knows what she’s doing. When I told her it was making my sons uncomfortable she said my sons needed to get a grip and turned over and went to sleep. \n\nThis is a genuine issue to me and she didn’t care enough to have a discussion about it. I asked my stepdaughter again in the morning and she did the same as her mother, completely dismissed it. Both of them have told me to stop being so silly but I don’t see how I’m being unreasonable when it makes my sons uncomfortable. AITA?\n\nUPDATE — Not even two hours after I posted this, my wife and stepdaughter gathered my sons and I and gave us a full intensive “periods for pricks” course, Powerpoint and all. It was a hoot, they made an interactive quiz and everything. My sons and I learned a lot and apologised to my stepdaughter. Thankyou for your input"
    },
    {
        "index": 828,
        "label": 1,
        "content": "So I (43M) don’t think I’m in the wrong here, but my mother is very angry at me, and my best friend said I was a horrible person for saying what I did and I’d be lucky if my girlfriend didn’t put me out with the garbage, since I decided I wanted to act like trash.\n\nMy girlfriend (34F) is a preschool teacher and for some reason I can’t explain she dresses like Ms. Frizzle. Like a dress with the pattern of whatever they are studying. She makes a lot of them herself, now including matching masks. The kids love it, and the parents seem to think it’s great. I don’t like the amount of attention she gets honestly. I’d prefer if she came home and changed before running any errands.\n\nOn Friday, she helped my mom with something after work and she was still in her weird dress. I have told her before I don’t like when she dresses that way, but she tells me I don’t have to like it, but I have no right to tell her how to dress. I was upset she went out like that with my mother, and told her that my mom said she was embarrassed and to ask that she please not dress like that again if they’re going out. I was not expecting her to call my mom and apologize. When my mom asked what she meant, she told her what I said. My mom was furious, explained she doesn’t have a problem with how my girlfriend dresses and thinks it’s great she spends extra time doing things to engage her students. My mom then yelled at me for lying to my girlfriend and trying to throw her under the bus because I was being an insecure jerk.\n\nMy girlfriend and I got into a huge fight. I said she should be embarrassed to be seen in public like that. She said the only thing she was embarrassed by was me. She hasn’t spoken to me or done anything for me since. My friend said I was horrible and called me trash. I shouldn’t have lied, but I think my girlfriend should take what I think about her clothes into consideration and I’m not sorry for expecting her dress more appropriately in public. Am I really such an asshole here?\n\nEDIT: I’m sure you all will be pleased to know we broke up tonight. She said I’m to controlling and narrow minded so she broke up with me.  "
    },
    {
        "index": 692,
        "label": 1,
        "content": "Let me preface this by saying that I (24m) and my gf (32f) who we'll call Liv, have been seeing each other for close to a year now. I've been living in a shared house with 8 blokes in a small 2x2m room that barely accommodates a single bed. This is the sole reason why she doesn't sleep at mine. I'm saving a lot on rent living here even though the living conditions are poor.\n\nNow, I've been staying at my gfs house 4 nights a week for the past few months. Her beds bigger for starters and I cant cook at home because it's always congested, so Liv and I cook a meal twice a week at hers. She has a roommate who we'll call (Bianca) that she's known for quite a few years and they get along fine. I've tried my best to get to know Bianca but it's not reciprocated and I can feel the awkward tension between us a mile away. She's never asked a question about what I do for work, or anything of the like, and typically responds with one word answers.\n\nLiv told me that Bianca feels very uncomfortable living with me. I hate being the cause of her discomfort. Whenever I'm at Livs house, I don't use the living room and go straight to Livs room whenever i arrive (usually late after work). Besides cooking with Liv, I'm usually mindful of my time spent in the bathroom.\n\nHere's where Liv and I may have screwed up. We were taking a shower together and took a bit longer than usual (20-30mins). All of a sudden Bianca comes out of the room and slams the front door shut and sends Liv an angry text about taking too long and that she needed to use the bathroom and that she's selfish etc. \nWe both put ourselves in her situation and said we would've knocked on the bathroom door to ask us to hurry up if we were busting, but she's a bit more timid than we are.\n\nTheir relationships gone down the gutters since I came along and I can't help but feel responsible. \n\nOn an end note, Liv and I want to move in together within a few more months after her lease finishes, but for now we're stuck in this predicament.\n\nMy mates telling me I'm an asshole for staying over 4 days a week rent free and I should respect the roommates boundaries and not see her as frequently. But I see it as the next step before moving in together, that I'm only there at night and it's normal for couples to see each other more frequently before they move in. So AITA?"
    },
    {
        "index": 801,
        "label": 1,
        "content": "I know how the title sounds, hear me out. My \\[26M\\] gf \\[24F\\] takes forever in the bathroom. Upwards of 1 hour, sometimes closer to 2. When I playfully ribbed her about this, she'd get irritated but nothing major. 3 months ago I was playfully teasing her and she flipped out. She said she won't do anything anymore, and true to her word she hasn't shaved, waxed, or put on makeup since then, and wears her hair looking like bedhead. I told her that I got her point and would appreciate it if she resumed doing things that I also do to stay presentable. Her head hair improved a bit (although not even close to how it was before) but she still has hair on her legs and underarms, semi-unibrow etc. Now she's saying I have to pay her to resume taking care of herself, which I find crazy as I'm not her sugar daddy. Why should I pay for her to upkeep herself like she's my sugar baby?\n\nI understand that it's her body, her choice etc., but if there are any guys out there who think they would be ok if their gf had long underarm hair then you're a better man than me. I haven't pushed her to do anything, nor am I enforcing any ultimatums. If, as she says, I've been conditioned to want her to look a certain way... well, that sucks, but it's not my fault. If we broke up, she'd pay for all of this beauty stuff herself, so why should I pay? Anyone who says I'm TA, are you going to then start paying for all your girlfriends' beauty regimens, or else be fine with 100% body hair and no makeup or hair care ever? Be honest with yourselves.\n\n**Gf's side:** He keeps being a dick about how long I would take in the bathroom, so as he said, I quit things he didn't even realize I was doing. No makeup, no shaving/waxing, no brows, no waxing those moustache hairs, I have curly frizzy hair so I stopped using product or straightening/curling with an iron, no mani/pedi, no touching up or redoing my highlights. Do I look like a beast? Sure. Am I a comfy, smug beast? Hell yes.\n\nHe rightfully pointed out that he takes care of himself for me (by shaving his beard and cutting his hair), so I obligingly waxed my upper lip and got a haircut. I'm continuing to do this whole thing because 1) it's so much less effort for me, 2) it's way cheaper, and 3) now that I stopped, I feel like... why do I ever have to do all this shit. It's unfair. And if I have to do it because both of us have been conditioned to see me doing these things as the basic standards for a woman, then he should pay half the costs. I conservatively spend at least $1k a year on brows, shaving supplies, hair products, highlights, haircuts, and makeup. Conservatively. He should have to pay me at least half if he wants me to do it, and extra for painful things like bikini waxes if he wants me to do them again. Otherwise it's not fair.\n\n**Both:** We love each other a lot and aren't actually fighting. We recognized that we're having a difference in opinion, and since neither has been able to sway the other we came to the court of public opinion.\n\n**EDIT (from bf):** alright, I'm the asshole. You know, it wasn't even the people saying I *was* the asshole that convinced me so much as the people saying I wasn't. No way in hell do I want to hold the same opinion as some of you, so if you think I'm not TA then I definitely am. My girlfriend not wanting to *remove body hair* is not the same as me walking around without showering, \"in stained shirts and greasy hair\". Jesus. The amount of sexist pigs that personally reached out to assure me that I'm not TA and the Reddit commenters are comprised of libtards, cucks, feminazis, etc... man.\n\nI think it's reasonable to say that I'm allowed to no longer be attracted to her physically after this, and in that case I would either pay up or we break up. However, luckily, I am still very much into her. I would *highly prefer* the lack of body hair, but it's far from a dealbreaker and I think those who pointed out that I should be trying to unlearn these standards are correct. As I said before, this was never a fight. And for all of you calling my gf a fugly whatever and telling me I can do much better, she's always hot as fuck, have fun in your mom's basement tonight.\n\n**EDIT 2 (from gf):** Thank you, Reddit, for knocking some sense into this mans. He let me shave his legs. He said he feels like a dolphin. I've decided his genuine contrition and heartfelt apologizing is enough for me and will resume shaving my pits for him, and doing my brows and hair (I didn't spend years subscribed to r/curly only to let my hair turn into a shitshow now)"
    },
    {
        "index": 242,
        "label": 1,
        "content": "I know this sounds bad, but hear me out. im using a throwaway cuz my wife uses reddit, so please don't upvote this. I just want honest feedback.\n\nMy wife (29f) and I (27m) do well financially, so we decided to have our fourth child. Every single pregnancy we've been through my wife has been a complete nightmare. Some things I can deal with, like waking up to the sound of her puking her guts out every morning, but when she starts demanding I go to the store every day to get her snacks or set up her foot bath thingy because her feet are swollen, I get a little impatient. I work way longer hours than her in a much more physically demanding profession (I'm a plumber, she's an engineer) so I think we're putting an equal amount of effort into this baby. \n\nAnd it's not like I don't help around the house, either. She does all the cooking and dishes, but I do laundry, take out garbage, and mow the lawn (we pay someone to do the floors and bathrooms weekly). My MIL comes over to help with the kids because she says I'm useless (ive been meaning to make a justnomil post about her), and while I appreciate the help I'm sick of her crap. Just because I want one hour of video games to myself a day instead of cleaning up messes in the kitchen doesn't mean I'm \"useless\". \n\nThis all came to head yesterday when my wife screamed at me from the kitchen to get off my ass and entertain our twins so she could focus on her meatloaf. I made a dumb joke about how this is the third meatloaf we'll be eating this week, and she. lost. her. shit. She told me how I have no sympathy for the fact that she's pregnant, I should be taking on more of her chores since I can't breastfeed, but then I reminded her that I still work a lot more hours than her, so I think we're basically both pregnant.\n\nShe got really quiet, and has only spoken to me regarding the kids since. I don't think I'm wrong but I'll apologize to her if it makes her happy. AITA here?\n\nEdit: my wife does get breaks, guys. I set up the annoying foot bath thing every night while she does dishes and then she relaxes with it while watching YouTube every night while I put the kids to bed. She also won't eat my cooking because she grew up in southeast Asia and doesn't like American food. It's not my fault she's picky.\n\n\nEdit 2: it's a Korean BBQ meatloaf she makes since some people pointed out meatloaf is typically American. Anyway, my wife found this post and now she wants us to do couples counseling. Thanks for the feedback, guys."
    },
    {
        "index": 67,
        "label": 1,
        "content": "My wife is pregnant with our daughter. Initially we were really happy and excited about it. But then, she starts acting like a nut job. She gets angry and irritated for small things, insults me when she doesn't like the food I make, starts acting insecure and accuses me of losing attraction for her.\n\nFor example, she wanted to eat chicken sandwiches for dinner last week. Well, I made chicken sandwiches. So she eats all the sandwiches, leaves me nothing and told me that they tasted like shit. I wasn't pissed because she left me nothing. But if she didn't like them, why did she have to eat everything? When I asked her this she told me that she was hungry. Ok fine. She does this every time. Eats everything I make and calls it shit. I don't argue with her because I work for more than 80 hours a week and I really want to have some peace when I'm home.\n\nSo, yesterday, a random girl starts at flirting with me after the gym and asked me if I wanted to meet up with her for some drinks. I rejected her and told her that I was married. And when I got home, my wife started to hug me and apologise. When I asked her what happened, she told me that her best friend suggested a test for my loyalty. So they asked a mutual friend to flirt with me and asked me out. And I passed. Yay!!. I'm really pissed. I'm done with her antics. WIBTA if I ask her to move out?\n\nEdit: I don't live in the USA. Please don't discuss legalities based on the laws there."
    },
    {
        "index": 789,
        "label": 1,
        "content": "I (M26) am a second generation French immigrant to the US. I speak French and most of my family lives in France, so I try to make a trip back to France once or twice a year.\n\nI have been dating an American girl (F24) for two years now. My girlfriend does not speak French at all. The actual events in question happened this winter.\n\nI usually go to France around Christmas time. The most recent Christmas, my girlfriend wanted to come with me. I said sure as she had never been to France before and we'd been dating almost two years so it seemed reasonable. \n\nMy family comes from the South West, but I also have family in Paris so we stopped in Paris first. My gf wanted to eat at a fancy French restaurant while we were there, something with Michelin stars. Expensive, but not really a problem since I make pretty good money.\n\nWe made a reservation for a good restaurant, not the best but still good. We had to make it months in advance because it's a restaurant that's high in demand. As a very upscale restaurant, there was also a dress code and things like that.\n\nWe showed up and everything was fine at first. They took our coats, we sat down, the restaurant was beautiful, etc. The waiter then gave us our menu. I had to do all the communication as my gf doesn't speak French.\n\nI was showing my gf something on my menu and she noticed that mine had prices and hers didn't. I had completely forgotten about this tradition because it's just not common at all in the US.\n\nShe asked me why mine had prices but not hers. I explained to her that it was just a tradition in many upscale French restaurants. She called it sexist and said it was ridiculous. I told her that it's just the way it is in these kinds of places, and that we shouldn't have come here if she was upset by this.\n\nShe wanted me to ask for a menu with prices for her. I refused because we already had the prices and I didn't want to make a scene. She demanded that I confront a waiter about it or she would walk out. I called her bluff and she ended up staying, but didn't talk to me for the whole meal, which was delicious by the way.\n\nWe've been back home for several months but she keeps bringing it up. I'm honestly considering ending the relationship over this because she will not stop talking about. She keeps accusing me of being sexist (I'm not) and has been making ridiculous comparisons.\n\nAITA?"
    },
    {
        "index": 420,
        "label": 1,
        "content": "Title says it all. My friend is one of those girls who always has a boyfriend, and that boyfriend becomes a central part of her identity. Last night we were having dinner and she said she needed a new hobby because she didn’t realize gaming could be so expensive. She dropped $2500 on a gaming rig because the guy she is dating now is into gaming, when before this she didn’t even have Candy Crush on her phone.\n\nSo I told her that she should find her own hobbies and interests instead of getting into whatever her current boyfriend is into. I reminded her that she enrolled in BJJ class when she dated a BJJ blackbelt (but she never stepped into a gym again after they broke up), she bought tons of baking tools and supplies when she dated a pastry chef (all banished to some faraway corner of her kitchen cabinet as I write this), she even wanted to buy a cobra when she was seeing a guy who collected them (Thank God the guy told her that she absolutely shouldn’t do it).\n\nAfter dinner one of our other friends told me I shouldn’t have said that to her and she clearly looked hurt, but I think that there was nothing wrong with what I said because I just pointed out facts and I think she needed to hear that to realize how dependent her personality is on her boyfriends and how ridiculous she is acting by copying their interests.\n\nAITA?\n\nEdit: Yep, I'm reading the replies, all 3K of them, it's all very interesting. Not gonna reply to any because reddit people can be weird, I know if I reply to a YTA with anything other than \"I'm sorry you're right\" people will say \"Accept your judgment!\" and if I reply \"Thanks\" to an NTA I will be told I'm just looking for validation.\n\nShout out to @Durvillea who made the effort to DM me the same comment she made here, to quote:\n\nLooks like you are one of those girls who are always fat + ugly inside out that you have to be jealous with your rich + pretty friend who always gets attention from guys and has enough money foe different new hobbies. Stop being bitter and leave her alone. You don’t need to also be mean to stay single af as you already are. Lol \n\nGirl thanks for your attention glad to know you're so interested in my life you have to try to talk to me through multiple channels."
    },
    {
        "index": 419,
        "label": 1,
        "content": "Title says it all, sole provider for family, all credit cards maxed, negative bank balance, upcoming missed payments until my next check, basically destitute for the foreseeable future.  My wife and I usually decorate on Black Friday, but this year I don't want to.  The thought of putting up our fake tree knowing I'll have nothing to put under it fills me with such a mix of shame, anger, and pain.  I would prefer to just let December pass and cut out as many things as I can until I can get my finances under control.  Plus, my daughter is 2. She won't know, care, or even remember one missed Christmas.  So, AITA?  I'm already a failure as a husband and father, so what say you here?\n\nTHIS HAS SPUN OUT OF CONTROL!  I never thought my sad man pity party would get this kind of response.  I was expecting to be called an asshole, validate my self loathing, and claw my way out of debt by working harder.  I did not expect the absolute torrent of love and support that I in no way deserve or can accept.\n\nINFO (And I am so sorry for not making this crystal clear in the original post): Our mortgage and utilities are paid.  There is food in our fridge and my next paycheck(s) is secure, even though it, too, will all go to bills with none left over for gifts.  I pretended not to notice that we weren't keeping up our pre-child lifestyle without credit cards and I got in over my head and now have to dig myself out of a relatively deep hole meaning I won't have money for gifts and meals out and holiday gatherings and whatnot for a good bit of time to come.  But, I have a great job and an outstanding family support system who all live close by and know what debt feels like and will understand if we can't chip in this year with anything but our presence, but it just felt shameful to have the advantages I have and still manage to fuck it up as bad as I did without asking for help. \n\nAs for all the people begging me to accept help, here is why I can't:  I make a good salary.  There is no chance of me or my family going hungry.  We have food and will have money for food budgeted into my paychecks, which are secure as my job is secure. I have an extremely well funded 401k from 18 years of office work and life insurance to safeguard my family.  Thank you all who were offering food.  Thank you all who offered to buy my 2 year old's amazon wish list.  She's 2 and does not have one.  My wife and I had already decided that she has too many toys and so we had only things like books and a learning tablet in mind for her.  She'll be ok if we can't buy her \"stuff\".  She already has \"stuff\".  Her close in age cousins live on our street and we exchange toys and clothes all the time and both our houses are cluttered with \"stuff\".  This was not about garnering pity or soliciting charity.  It was my insecurity equating gifts with love that warped Christmas for me.  It almost ruined Christmas for me.  Regardless of the vote here, I truly am THE asshole for that.  So please, turn your charity to your communities, your neighbors.  Not some middle class jagoff who spent himself into debt trying to prove how much he loved a family that only needed him to be a happy and healthy presence at home.  You all have humbled me beyond words, beyond charity.  You have given me both the perspective and the courage to seek professional help, both financial and psychological, and hopefully it's not too late for this stupid old man to become a better father and husband.  Yes Virginia, there is a Santa Claus.  His spirit is truly embodied in all of you beautiful and selfless redditors.  Never lose the light.  Love and cheer to all.  But as you can see, I deserve neither your charity nor your goodness, and I'm going to go disappear back into anonymity now if possible and work on me.\n\nUpdate for those concerned:  I have not ever, even for a second, considered hurting myself.  Not once.  I'm showing my age here, but Goonies never say die.\n\nUpdate for INFO, and I hope this answers all the questions people had, as there were many, and so I'm just going to write a bio that answers them all:  I live in the Mid-Atlantic United States.  When we got pregnant (after 6 years of trying and failing and treatments and tears) we found out that it would cost us $50 a month for my wife to work her current job and put our daughter in full time daycare, as day care costs upwards of $1600 a month for even local co-ops, to say nothing of the $2100+ that most daycare companies were asking.  The solution was for her to \"retire\" and take up the even harder job of full time mother.  I work 8-5 at a day job and I pick up shifts DJing at a local bar at night and DJ private events/weddings/etc... when I can book them.  My daughter was about to turn 2, and be able to start 3 day a week \"preschool\" for far less than the cost of 5 day a week daycare, meaning my wife could work again, at least part time.  I was in the referral process to find a surgeon to do my vasectomy when we found out that despite using birth control, my wife was pregnant again. We're due in February, a little boy this time.  Utter shock, disbelief, some truly unhealthy thoughts, and finally acceptance that I was going to have to continue to be the full time provider, as there was no way we could put 2 kids in full time care, so once again, my sainted wife will have to spend at least another 2 years as a full time mom.  My wife and I are old people(42M, 40F) who tried to have kids earlier in life, but couldn't despite multiple treatments, and only succeeded when we stopped trying so hard and resigned ourselves to the thoughts of a comfortable dual income no kids lifestyle full of travel and memories, Bringing one life into this world at 40 after everything we went through was a laugh, only for life to turn around and \"bless\" me with a second child.  My wife is overjoyed, and I am happy but terrified of how I will afford this.  She applied for part time seasonal work to help with our bills, but the job she was hired for has given her exactly 2 shifts in 2 weeks, and taken one of those shifts away at the last minute due to overstaffing.  She has a meeting with them today to find out if it's worth her time to stay employed there, dependent on if they can actually give her at the least 20 hours a week which she requested upon applying.  We have had joint finances since we were engaged.  We don't hide things from each other, we're both well aware of our money issues and have been working on ways to improve our financial situation. (Thank you all for the links and sites, I am bookmarking them all!).  We have and will keep communication open.  It was our promise made to each other 13 years ago to never shoulder our burdens alone.\n\nLastly (hopefully, I know this is long) I am humbled by your offers of charity, dear strangers.  Truly and deeply humbled.  I cannot accept them, be it out of foolish pride or some other moral driver, but know that your kind words and even kinder offers have softened my resolve to cancel Christmas this year.  I just spent 2 days with co-workers volunteering at 2 local food banks preparing meals, clothes, and groceries for the community, so if you're one of the many wonderful strangers who offered help, please give that help to your local charity.  I have a roof over my head, and food in my belly, and I could not ask for more, not when I have so much already.  \n\nI still dread the thought of lugging that old fake tree out of the laundry room, but my feelings have to come 3rd, here and always.  My wife and daughter need the love and joy that that old tree will bring, and I need to give them everything I can, even if it's the just the spirit of the season. They deserve to feel the warmth of a festive home, and we already own the damn thing, so it's literally the least I can do.  My presents will be the 1 million pictures my wife will take of our daughter pulling all the ornaments she can reach off the tree and showing them to her with that beautiful smile she has.  Our families are close by, and our parents will no doubt do their best to spoil our daughter and I know it will be more than enough.\n\n\nUPDATE!  Wife and I downloaded a budget app and are working with a family member who does financial planning. I, personally, spoke with someone (a professional) early this morning and in just the initial phone call she helped me realize that I was equating being able to give gifts with showing love to my family.  Not being able to afford baubles isn't going to mean I love them less, and I will need to accept that and I will continue to work with her as long as my insurance will allow.  Thanks to close friends with growing kids, we have an embarrassment of clothes and toys to sort through, and wrapping some of these items for my little girl to tear into is more than good enough for my wife and I.  My wife and I have plenty of clothes  Thank you to all who have offered to purchase things for us.  My heart bursts from the selfless and wonderful offers.  But, I meant what I said when I asked you to please point your humongous hearts to your local charities. I have more than enough \"things\" and taking things from strangers to compensate for my poor spending habits feels wrong.  It will be a tough few months, but I have a good job with opportunities to grow and am going to work with professionals to learn some much needed budget control, and work with a therapist to learn to accept help from family and friends when the new baby arrives and to be less hard on myself.  I am also going to spend more time with my local food bank, I signed up to help build meal kits this week to be distributed for Christmas in my community.  I'm planning on \"giving\" generously this season, just not in the consumerist sense.  I think that's a \"new tradition\" that my family can and will preserve for years to come.  Even y'all who called me a stupid cunt.  Thank you, too, for keeping me grounded.\n\nTo those of you who have asked how could I have tried for 6 years to have a kid and \"not bothered to budget for it once it came\" are greatly underestimating how much fertility treatments cost even with insurance, and how well and truly fucked American Healthcare really is.  We are taking steps to ensure that this kid will be our last, and I actually brought up abortion but my wife would not even consider it.  Thankful for that now."
    },
    {
        "index": 824,
        "label": 1,
        "content": "My wife went into labor around 6 pm on Sunday. We were expecting twins.\n\nIt quickly turns into a very painful process she kept cutting off the blood pressure to my hand when she squeezed and nearly sprayed my shirt with vomit.\n\nAround 3 am my dad calls. I work for my dad’s company and we had a presentation for clients Monday morning that I had to get ready for.\n\nMy dad heard my wife was in labor but told me he needed me on this presentation. He said there was nothing I could do to help my wife and delivery and seeing the baby come out was overrated and people don’t prepare your for the gore.\n\nHe said he needed me to rest up and make myself presentable for the presentation.\n\nMy wife’s labor was progressing very slowly and we were all certain she would need forceps or other assistance to deliver the babies. \n\nI realized that I couldn’t help her here, and my dad was counting on me, so I told her I needed to leave.\n\nShe started screaming at me so loudly that a few nurses rushed over to our room.\n\nI ended up doing the presentation with the clients and things went well.\n\nI leave the office and see a text on my phone that said my wife delivered an hour ago at around 10:30 am and they had to use forceps. \n\nI would have missed the meeting had I stayed and my dad has given me everything he could possibly give me in life, so I didn’t want to let him down. \n\nAITA? I had responsibilities I had to take care of and while my wife is still screaming at me saying that she was alone when they “ destroyed her body”, I’m the only one who works and her mom herself said that she was emotional and overreacting. \n\nMy wife even went as far to say that her family would disown her if she was the first of them to divorce but that she doesn’t consider me her husband right now."
    },
    {
        "index": 494,
        "label": 1,
        "content": "My wife and I divorced when my daughter was 6 years old, and my wife had custody of my daughter for the most part since I was too busy working 50 hours a week, she quickly moved on to be with another man 7 years younger than her. I knew from many stories I've heard that my daughter would probably end up being closer to him than me, since not only was our time together very limited but he was a stay at home dad, which means they had plenty of time to bond together which makes me feel sick to this day. This may sound immature but I made her promise to never ever call her stepdad(dad), that I was her only father and to not betray me. But I have no control over what she or they do in their home. Fast forward to now my prediction came through and she's obviously closer to her step dad than me. She has gotten engaged about a year ago and now that the wedding is approaching near(1 month or so)  she's now out of the blue told me that she wants both me and her stepdad to walk her down the aisle after promising me I would be the one to do it. Even though I know they're very close, I don't believe he has any right to walk my blood daugther down the aisle. I am her only father, it isn't fair that he got to be with my daugther more than me, her bio dad, and now he wants to take this moment from me too. I got a bit angry and told her I absolutely will not share an honor that is meant for me the actual father of the bride with some guy I barely know. She told me he's done a lot for her growing up and that I'm being petty over something that happened years ago. I told her I wasn't going to argue about it and if she wants her stepdad to walk her she can, but I won't be there to see it. \n\nI was told by a friend of mine who uses this site quite often that many people have gone through something similar to this with their kids or parents, so I wanted to see other people's perspective, on if it's wrong for me to want to be the only one to walk my only daughter down the aisle."
    },
    {
        "index": 312,
        "label": 1,
        "content": "So my girlfriend (her 27 me 28) wants to go to this fancy new restaurant in the city that she’s heard good things about. We get there and it seems like one of those hipster places but whatever, I’m hungry. \n\nI look at the menu and this place is crazy expensive - like every dish is more than $15-$20 and half the ingredients I’ve never heard of. I order the bison steak ($26) and my girlfriend orders some weird pasta, noki I think ($18). Very important, these were listed as ENTREES on the menu. Mind you with drinks plus tip this is going to come out to over $60 which is already ridiculous for dinner for two people.\n\nSo anyway we order as we are starving. My steak arrives and I am shocked, it’s like 6 small pieces of sliced steak with some weird sauce on the side and a small handful of salad. I joke to the waiter “where’s the rest of my steak?” and he explains they serve smaller portions at this restaurant because they focus on getting the highest quality ingredients. I don’t care if this bison was blessed by the pope himself it’s absurd to charge that much for such a small bit of steak, it’s highway robbery. When I go to restaurants I expect an entree to fill me up and be enough for leftovers.\n\nI’m complaining to my girlfriend and she’s getting annoyed with me. Similar situation with her pasta it was like maybe 12 pieces of noki dressed up with some frou frou bullshit. Granted the food was pretty good but I can not get over how tiny these portions are. I’m a big guy and I like to eat, what can I say. \n\nWhen the waiter comes back I inform him we will not be paying for our meal, and that they are falsely advertising entrees that barely qualify as a light snack. My girlfriend is begging me to stop but that’s where we’re different, I don’t let businesses push me around and rip me off. \n\nA manager comes and apologizes but asks us to leave. I don’t end up paying as they realized I called them out on their bullshit. My girlfriend is silent the entire time on the way back. Im still hungry so I drive through McDonald’s and get a burger, and when I did that she asked to be dropped off at her place. It’s now the next day and I’m starting to think I didn’t handle the situation as well as I could have (I could have probably just asked for a discount). My girlfriend hasn’t responded to my texts so now I’m starting to think I’m an asshole.\n\nAm I the asshole?"
    },
    {
        "index": 204,
        "label": 1,
        "content": "My daughter (14yo) posted a picture of a family get together on social media. A boy from school recognized her aunt from an adult film and messaged my daughter about it. I believe he sent a video to her as well. Before this, she had no idea her aunt was in the industry. It appears that boy spread this around the school and my daughter is being teased for it. I notified the school and they are looking into it and will plan to educate the students about sexism online.\n\n&amp;#x200B;\n\nMy husband and I are respectful and non-judgmental of my SIL’s profession and have tried to teach these values to our children. My daughter is understandably upset and I feel for her, but she is directing all her anger and blame towards her aunt. She unfriended my SIL from social media and removed all traces of her from her profiles. She refuses to join us for weekly dinners at my SIL house and when they come over, she ignores them and just sits in her room playing minecraft. I tried talking to her about tolerance, shame, and sexism, but it she is dismissive of all of it.\n\n&amp;#x200B;\n\nMy SIL is hurt from all of this. Not only did she have her privacy invaded, but she lost a good relationship with her niece. Last weekend, I went upstairs to my daughters room to try and talk to her and get her to join us downstairs. My daughter refused and referred my SIL as “a vapid slut” and her husband “a pathetic cuck” along with other slurs I don’t want to repeat.\n\n&amp;#x200B;\n\nI grounded her for three months and took away her internet. My husband definitely thinks that she should be punished for using that language, but that’s too much. He also admitted he struggled accepting his sister’s career path at first. He thinks she just needs space and will come around eventually because her aunt is family.\n\n&amp;#x200B;\n\nEDIT: Seems like my husband is right and I went too far with the punishment. I just never imagined those hurtful words coming from her mouth. I’m going to scale it back to two or three weeks or something like that. Will decide with the husband later. We’re definitely concerned for our daughter about what’s happening at school and we’re looking into therapy.\n\nFor clarification, as for my SIL’s privacy, she didn’t consent to have her real name revealed to the world or have her films and her personal information be passed around by 14yo boys."
    },
    {
        "index": 948,
        "label": 1,
        "content": "I live in a pretty small town, so if you don't know somebody directly, you're likely to know a person who knows them, and this is pretty much biting me in the ass right now.\n\nMy husband and I are looking to upgrade homes given we're planning on expanding our family, so we've been looking at a few open houses recently. About a week ago we were at an open house when our daughter (4) wandered off and picked up this mask type thing laying out on a table. Super bright, very loud, apparently VERY fragile and pretty much right out in the open. When I saw her touching it I told her to put it down but it was too late and somehow it had gotten cracked down the middle. Now, I'm not sure if it was already broken and they had left it out as some sort of trap (because who leaves something bright like that lying around during an open house, with children walking around?), or if she did anything, but I felt extremely embarrassed and grabbed my daughter and told my husband it was time to leave.\n\nA so called friend of mine who knows the house owner saw me there and apparently told her she saw me rushing out of her house on the same day she returned to find the mask broken. Now she's hitting me up on the phone demanding I pay her back for breaking \"art\" and naming an absolutely ludicrous price (think four figures). I'm absolutely not going to pay her that, but a few people I know think I'm in the wrong here. I personally think if you're having an open house that children will be visiting you don't leave expensive breakables out in the open. I also do not believe for a second that thing was worth thousands of dollars, and if it was, I think there's a very good chance she broke it herself then left it lying around to pin it on someone else and guilt some money out of them. Whose the asshole here?"
    },
    {
        "index": 50,
        "label": 1,
        "content": "My 20 year old daughter and her fiancé are currently staying with us. I love my daughter but she is very difficult and I can’t stand her fiancé. I gave them a deadline to move out because I can’t take this anymore. \n\nThey got into a massive fight the other day while my wife was out. I guess a pair of my wife’s underwear got in with their laundry and she thought he was cheating. I think the fact she immediately jumped to cheating shows how bad their relationship is.\n\nShe was waving the underwear around and I recognized them because they had a floral print but I just let this ridiculous fight go on. My wife came home after about thirty minutes and said they were hers. My wife asked if I didn’t realize they were hers and I accidentally laughed.\n\nMy daughter burst into tears and won’t talk to me. Her fiancé said we’re fucked and left the house but my wife thought it was funny."
    },
    {
        "index": 484,
        "label": 1,
        "content": "My brother died. He was an incredible, funny guy, I miss him like I lost one of my limbs. Maybe it’s stupid, but I want people to remember the person he was. My dad and aunts have been involved in planning his funeral and they have been planning a very Catholic funeral service. He wasn’t Catholic and wouldn’t like the very expensive casket, the flowers, the church with a lot of people he didn’t know there. He’d think it’s way too fancy, way too much. \n\nHe and I had morbid discussions a lot (side effect of me being a goth teenager, I guess). He told me he wanted to be cremated and his ashes thrown into a ceiling fan while “It’s Raining Men” played in the background...obviously not an option....Also, together we made up a funny funeral playlist, including songs like “Highway to Hell” and “Another One Bites the Dust.” \n\nTo remember him, I want to bring a speaker and play “Another One Bites the Dust” at his wake. I would explain it to the people at the wake and say that I wanted to preserve the person he was. Maybe I could give a speech, or tell the story and explain how he saw death with humor, not sadness. There will be a lot of extended, older family members there who weren’t very familiar with him and are Catholic, so I’ve been thinking maybe not. But I really want to preserve his memory as he was, not what people think he should have been. I think my cousins and sister would get a kick out of it. \n\nWIBTA?\n\nEdit: I didn’t really expect this response, but thank you. My brother would have been absolutely thrilled by all of your comments. I swear, I almost sense his hand in it. I don’t know if anyone will see this update, but here goes, \n\nThis morning, I talked to my dad about the wake. I suggested, as some of you did, that maybe I could give a eulogy and talk about my brother, and then play a instrumental cover of the song. I found a violin one that I really liked. My dad listened to the cover and looked at the list that my brother and I made. He actually smiled and laughed, and said that it seemed like a great idea. I hadn’t really been thinking about my Dad as much as I should have, I thought of him as opposition, I guess he cared way less about the Catholic stuff than I thought. \n\nI also reached out to some of my brother’ s friends. Some of them had already been planning a party in his honor and they were happy to listen to some of my ideas. We are going to play all the songs on the list, plus a few others that apparently he told his friends about and not me, and we’re going to start working on logistics for scattering (not human!) ashes from a ceiling fan.\n\nThanks again."
    },
    {
        "index": 49,
        "label": 1,
        "content": "I'm the VP of Sales at a software company and one of our sales development reps parents passed away at the beginning of April, sadly they were involved in a car crash and both lost their lives. Now the employee in question in very young 22 year old guy and has been with us for about 10 months now. He's a great employee and we were thinking about promotions in the next \\~6 months for him. His job is a high paying one for a new grad, about \\~90k with commission and base so we expect a lot from this position. Because of the accident we let him take a 1 month paid leave of absence from work and he's returned a few weeks ago and his performance is severely lacking. He's super unmotivated, not cold calling, out reaching to prospects for the last 2-3 weeks enough since he's come back. Our whole mgmt team has noticed this and we decided to let him go because we feel like he'd need months and months to be able to produce again and we can't just wait that long.\n\nWe called him into a meeting on Friday afternoon and gave him the bad news, he was very calm and rude about it. Told us to go fuck ourselves and got up and went to his desk grabbed his few things and left. I thought this was very very unprofessional and extremely rude.\n\nI told my boyfriend about all of this and he said myself and my mgmt team are a bunch of asses and pricks with no hearts.\n\nAITA?\n\n&amp;#x200B;\n\n\\*\\*Update\\*\\*\\*\n\nHoly fuck this blew up, I know this was shitty of me now. And I reached out to him to see how he's holding up. He's staying at his gf's place and she's supporting him a lot right now. I offered to get my head hunter friend in touch with him when he's ready and he accepted."
    },
    {
        "index": 318,
        "label": 1,
        "content": "Saw another post that reminded me of this situation.\n\nA few years ago, my close childhood friend gave birth to triplets. Her husband is a light black man. Of the three, two were the same skin tone as her husband, and the third was much darker. The skin tones made me a little suspicious that her husband might not be the father.\n\nI pulled her aside privately and asked her seriously if her husband was the father. She didn’t even listen or answer rationally, she just freaked out at me and acted super insulted and kicked me out. I reached out to her husband and told him about her reaction and told him he should get a paternity test and he called me an asshole and blocked me. Neither has spoken to me since.\n\nI’ve always thought that they dramatically over reacted and were probably hiding something because of their responses, but they’re still married and sometimes I feel bad about what happened. I just felt a lot of empathy for her husband because I would be devastated if I wasn’t confident that I was the father of my future children. Was I an asshole for asking privately?\n\nEdit- okay I get it I’m an asshole. I want to make it clear that I didn’t think the triplets had different fathers. I’m not an idiot. I thought it was possible, given the skin tone of the third triplet, that all three were fathered by a darker man and the first two were a bit lighter because my friend was very fair"
    },
    {
        "index": 214,
        "label": 1,
        "content": "My younger sister and I were very close when young but no so much now. I was born in fairly well to do Hindu family. I fell in love and married a Muslim man and had to convert to his religion. My family was pretty pissed off that I converted but we've kept in touch.\n\nRecently my sister announced that she was in love with a guy she'd met while trekking and they had plans to marry. My mom invited me for a 'girl's day', just me, her and my sister at my parent's home for a fun day.\n\nMy sister began to talk about her fiance, how they hated each other at first but then fell in love etc etc. I was happy for her.\n\nIt all began when I asked what religion he was. Imagine my surprise when she said that he was Hindu AND THE SAME COMMUNITY AS OUR PARENTS. This would mean that it would make my father absolutely over the moon.\n\nI asked her if she was sure she loved him, because it seemed unbelievable that she would meet someone from the same small community as our parents' and fall in love. She got angry and told me that she was absolutely sure she was in love with him. \nI suggested that maybe she thought she was in love because it was easy and there was no challenges involved.\n\nI explained to her that if she was truly in love, she wouldn't choose someone so obviously a match. It was as though our parents chose him from a catalogue. \n\nShe told me that it didn't matter, she loved him and thats it, and I was being rude. I told her that I wasn't, I was just looking out for her and didn't want her to bear the brunt of societal expectations on who to marry.  I then asked her if she was marrying him to appease our parents.\n \nAt this point my sister blew up on me and began fuming that she was not a kid, she didn't need to appease anyone etc etc. At this point my mom told me(not her) to get out of the house.\n\n\nLater my sister told me never to contact her again, nor ever see her face or come to her wedding. She called me 'toxic'.\n\nI was just looking out for her."
    },
    {
        "index": 772,
        "label": 1,
        "content": "Longtime lurker here. Hoping some of you guys can weigh in on what has become a really frustrating situation with a close friend and his partner.\n\nSo my wife (29F) and I (29M) have been hosting dinner parties a few times a year for as long as we’ve lived in our current city. We like to go all out and cook elaborate multi-course meals, so we limit our invitations to just a few close friends, since cooking such a complex dinner is an all-day affair and the food costs add up quickly. We have about four to six people we invite to these events, depending on their availability, and it’s become a great tradition in our social circle. \n\nOur friend James started dating his girlfriend Sarah about a year and a half ago, and when we first extended her an invitation, we were informed that Sarah was vegan. I thanked James for letting us know and said she was more than welcome to bring her own food so she would have something to eat. He agreed, and the two of them have been attending our parties regularly for the past year. Everything was fine, until now.\n\nDuring our most recent dinner this past week, we noticed that Sarah was very quiet and looked like she was about to cry. My wife asked her what was wrong, but she told us not to worry about it and kept dodging the question, so we didn’t push the issue. \n\nHowever, after the meal, James took us aside privately and told us that Sarah felt hurt because we never provided any dishes she could eat at our dinners and it seemed like we were deliberately excluding her. He added that he thought we were being rude and inconsiderate by not accommodating her, which really pissed me off, and we got into a huge argument over it. \n\nMy wife feels terrible that Sarah was so upset and apologized to her and James profusely, but I don’t agree that we did anything wrong. I like Sarah very much as a person and I don’t have anything against her dietary choices, but I don’t believe it’s fair to expect us to change our entire menu or make an entire separate meal for one person, especially when so much time and effort goes into creating these dinners. For the record, nobody else has any dietary restrictions. AITA?"
    },
    {
        "index": 765,
        "label": 1,
        "content": "Edit: didnt expect this to be a reason to be called a \"child molestator cultist\" but I suppose that's reddit for you?\n\nI am getting married in a few months. We have a few atheist friends who have a general dislike for religion so I thought it would be for the best to only invite them to the party. My future wife and both of our families are Roman Catholic. Catholic ceremonies are *long*. I'm talking 1 hour of pure mass and additional half an hour of the actual \"getting married\" part. If you are not a believer, it is boring af. Hell, Im Catholic and I know I'll be bored for 80% of it. I thought I'll spare them the trouble.\n\nAnyway, one of my friends brought it up, saying I forgot to put the time and the church where the ceremony will take place on the invitation. So I said that she doesnt have to come to the religious part and just come for the wild party part. She got confused, I explained and she got annoyed to say the least. Said she isnt heartless and would sit through the 2/3 to see me get married in the 1/3. I tried to explain again &amp; fix things but I felt guilty the whole time. \n\nWas it an asshole move?\n\n\nEdit: ah, I suppose I am TA. Just for clarification though: \n- we did explain things and they are coming to church. No hard feelings between us. \n\n- those who I decided to \"spare\" expressed anti-religious-events stances in the past (not going to Christenings, First Communions &amp; Confirmations) so I thought it translated to wedding ceremonies\n\n- i also thought it would be considerate to not force them to come because of the sense of \"they invited me so i have to\" and ended up going wrong about it :/"
    },
    {
        "index": 278,
        "label": 1,
        "content": "So how to begin with this...I realize that on paper I am totally the asshole but when you dig deeper into my motivations I'm hoping its more of a grey area that anything else and maybe even I did the right thing. \n\nWhen I was a teenager my dad bought me a classic 1972 Ford Bronco. It was my true passion and I don't recall a memory from high school that somehow doesn't involve that truck. Plus my dad and I would spend hours and hours working on it together and we went through that especially father/son rough patch when I was teenager it was always that Bronco that brought us back together. I made a huge mistake and sold the truck when I turned 19 and my dad died of a heart attack two months later so while not logical, I've always felt a karmic connection between the two events. \n\nWe had a baby in early February. she is our first and the light of my life. My wife is doing well but she's back at work and she's realized that she hates all the day cares we've tried and really wants to be a stay at home mom and plus she's still very hormonal from delivery, lack of sleep and breastfeeding so she's having a rough time and is angry a lot. I guess I need to say this. \n\nTwo weeks ago I was driving through our town's warehouse district and saw a Bronco that was pretty beat up but resembled mine. I stopped just for nostalgias sake and the owner came out and let me take a look inside. My dad and I had glued a wheat penny under the dash as sort of security measure so I just sort of checked and goddamned if it wasn't MY BRONCO! \n\nI asked him if he'd ever consider selling it, he said actually someone was on I-25 as we spoke from Colorado to buy it for $21000. I freaked out and asked him if I could buy it right then and there for $23000. He said if I could come up with the cash, yes. I had been procrastinating setting up a 529 so I had $12000 in savings that my wife's parents had given us, I maxed out my credit card to Venmo and my mom bought down a check for $4000 and I fucking drove away in my old car. It was like a dream come true. Like a literal dream come true. It needs a lot of work I can't afford right now but it's mine. Like in my driveway mine. Again. I can't even describe what a joy this is. \n\nMy wife and her parents are furious with me. They feel I was deceptive, that a \"real\" man would have sacrificed anything and everything so my wife could go stay at home with his kids and that's setting aside that they gave us the money for a college fund. My point is my daughter is only 6 months old, we have 18 years to set up a college fund of her. But this Bronco means everything to me and if I wouldn't have acted it would have been gone forever. Now it can be that same connection between me and my kids. To me it's the literal meaning of happiness.\n\nLike I said on paper--asshole...whole story--grey area. How do you guys see it?\n\nEdit: had no idea this would go so one way. I guess I messed up. I talked with my mom and she is basically going to buy the bronco from me in order to refill the college fund and pay off the credit card. The $4k will be a gift and she’s going to give me whatever I need to restore it. She’s always been awesome to me and she’s rather the money be spent now than wait for me and my sisters inheritance. Sorry to get everyone so mad at me, I was thinking with my emotions and acted badly\n\nedit2: are the “mommy bailed you out” comments really necessary ? I found a solution and it’s coming from me and my sisters inheritance so it’s not like I’m not paying for it on my own eventually.\n\nEdit 3: my inbox is so buried I have no idea what those icons are that are where gold used to be. Does anyone know what those are ?\n\nEdit4: I’m getting a 403 error whenever I try to respond, not sure what that means but I’m still reading because honestly I’m afraid to go home even with the great news I know my wife is going to be upset for one reason or another\n\nEdit5: does anyone know what 403 error means? I messaged the moderators but they must be busy /u/SnausageFest since you’re a mod, do you know? I can’t respond to any posts and get the “status 403” whenever I try. Thanks!\n\nEdit in the morning: I couldn’t figure out why I was getting so many private’s  but I guess this must be locked now. I didn’t tell my wife that my mom bailed me out and lied and Said I found a buyer for the bronco. I’ll figure out how to cross that bridge when I get there but my wife was so relieved that I “had come to your senses” I don’t want to disappoint her. It’s going to take all my lying skills to pull this one off over the next few years."
    },
    {
        "index": 430,
        "label": 1,
        "content": "I lost my late-girlfriend on 9/11 when TWC towers collapsed (she was on the 67th floor). I had no calls or texts from her, all I hope is that her last moments were painless and fearless. This year I suffered a near-death accident. After it, I did a lot of looking back on my life...and having lost family and friends in tragic ways I decided to stop taking things for granted and began cherishing the people I am close with. \n\nSo for this year, I posted a tribute for my late-girlfriend onto my FB. It was just 4 pictures (1 of her, 2 of us holding hands/hugging, and 1 of us in her office when she first got hired). I wasn't too over-romantic, but said \"I'll always miss you, and you will always be a big part of who I am. I hope you are proud of me.\"\n\nA few hours later though my wife texted me and was furious. She asked if I  loved her or if I wanted to get a divorce. She told me it was slap her in face to post my ex onto my FB. Of course I love my wife more than anything, and my intentions were not to harm her in anyway, so I felt guilty and took down the post. Was I out of line here? I genuinely didn't mean to hurt my wife, I just wanted people to know what a great person my late-GF was."
    },
    {
        "index": 918,
        "label": 1,
        "content": "My son has been seeing this lovely girl for about 4 months.  They are both 16.  Her parents have a litany of issues (super controlling, narcissistic mom and alcoholic dad.)  Generally, because she lives much closer to the school, my son goes over there occasionally after school, and I pick him up in the evening.  I will also drive him there sometimes on weekends and pick him up when he's ready.\n\nThe mom has all sorts of odd rules for my son when he's there, which is fine.  It's her house.  Most of the rules seem to be based around her daughter's chastity.  He is allowed in her room, but not on the bed.  Then, weeks later, he is allowed on the bed, but not under the covers .WTF?  And she will check on them quite regularly, making sure they are being 'proper'.  (not under the covers, the door open etc.)  They also want him out before a certain time (which changes depending on ... ? )  Sometimes it's 7:30, sometimes it's 9:30.  Whatever.\n\nRegardless, she usually doesn't come to our house, because her parents are so controlling.   Well, today she came over for the first time.   The night before, her mom called and wanted to talk to me.  I am a correctional officer and was working that night, so I wasn't home to take the call.  My son offers to let her to talk to my husband, who was home, but she only wanted to talk to me.   Later on, her dad calls, and he talks to my husband.   I don't have the details of the conversation, but basically, he wanted to make sure that there would be at least one parent home at all times and that we would keep an eye on them at all times.  My husband agreed.\n\nThing is, we don't really care.  I was sexually active at a younger age than them.  My son and I have had lots of talks about consent and not being sexually pushy with people and respect and birth control, etc.  He is a lovely boy, and I believe he would never push her to do anything she wasn't comfortable with.  They have been sexually active with each other already.  (teens will find a way!)  Anyway, not only did I not check on them constantly, I told him that as long as she was willing, I would give them as much privacy as they wanted, providing they were using protection.  My husband and I actually had to go out for a couple of hours, and I asked a good friend who lives just down the street if she would 'cover' for me, if this girl's parents called or showed up and pretend to be my cousin.  (parents did not have our exact address yet, so we would have had a warning about them showing up.)  Good friend laughed and agreed.   Turns out it wasn't needed.   Dad eventually came and picked her up.\n\nI absolutely stand by my opinion that MY son can have privacy and agency over his own body at this age, but I am kind of wondering if I should have made that choice for someone else's child.  I kind of feel guilty, but I think her parents are WAY over the top control freaks.\n\nAITA?"
    },
    {
        "index": 249,
        "label": 1,
        "content": "About three years ago my dad was injured in a really bad hit and run car accident. He broke just about every bone in his body, and left him paralysed from the waist down. Our relationship has always been really good, but I hate seeing him in pain and admittedly try to avoid seeing him because it just makes me uncomfortable. \n\nIn November I’m getting married. I’ve been with my fiancé for 4 years and he and my dad get on really well. Naturally the discussion of who was going to give me away came up in the family group chat, and I kept silent after I realised my dad would be in a wheelchair. We always talked about him giving me away and having a dance at my wedding and I don’t want to be reminded of what could’ve been at my wedding. I messaged my mom privately and told her I want my uncle to walk me down the aisle as we’re incredibly close. \n\nShe naturally asked why and I told her that my dad being in a wheelchair would add complications to the wedding. The walkway would have to be widened to accommodate his wheelchair and he wouldn’t be able to hold my arm or give me a proper hug. She was outraged, called me an ableist POS and removed me from the group chat. My aunt has since called me telling me my dad is absolutely devastated. AITA?\n\nUpdate - I appreciate all the people who have messaged me offering me support, your kind words have meant a lot to me whilst rifling through a bunch of messages telling me to do horrible things to myself. Regardless of what you think of me, telling me these things isn’t okay. I’m going to call my dad tomorrow\n\nUpdate 2 - can people please stop messaging me such horrendous stuff? think about what you’re saying. You may not agree with me or my life but you’re just as bad as I apparently am if you’re going round saying stuff like that to strangers on the internet\n\nUPDATE - Not that I owe it to anyone but I thought I’d give you all an update. My boyfriend and I have decided to part ways and ive apologised to my dad"
    },
    {
        "index": 43,
        "label": 1,
        "content": "\nThrowaway because husband told me I was TA and want to know before I get home and argue. On phone format is bad.\n\nI was in a higher end department store today (rhymes with loomingtales) and happened to end up next to two teenage aged girls while shopping. One of the girls had picked out a pair of VERY expensive boots and they were both fawning over them. Second girl must have looked at price tag and asks boots girl if she’s really gonna spend that much on boots. Girl with boots says something along the lines of “it’s fine I have my dads credit card I’m not paying ” which instantly caught my attention because THATS NOT HER CARD. I’ve told my son multiple times he’s never allowed to use my card so I’m interested to see how this girl thinks she’s going to get away with fraud but had split up from the girls at this point because they had found something else.\n\nWe end up at the same register (me behind) and I see her total hit well over four digits. The girl is about to swipe her card when I decide that I can’t let her get away with something like this and someone has to parent this kid if no one else will. I tell cashier that isn’t her card but her father’s and I’m not sure she has permission. Girl and friend turn and glare at me giving me possibly the dirtiest look I’ve ever seen. I swear this girl was going to throw a tantrum right there, I don’t think she was ever told no.\n\nGirl tells cashier her father gave her the card to shop with because it’s the stores credit card and it gives him the points. Now that I’ve pointed out it wasn’t hers cashier tells her she can’t use that card. Girl tries to show ID to prove they have the same last name ( yeah that will help) and I tell her it’s still fraud. Girl says it’s not fraud because she has permission and tells me to mind my own business. I tell her that it is my business that she’s doing something illegal she needs to pay with her own card or I call the cops. Girl is pissed now and people are glaring at me. She uses her own card and leaves crying. Cashier looks mad at me and I tell my husband when I get home only for him to agree I was in the wrong. \n\nSo Reddit, ATIA?"
    },
    {
        "index": 936,
        "label": 1,
        "content": "(Throwaway because some of my family use Reddit.)\n\nHi, all. I (F30) have been dealing with chronic medical issues all my life. I married my (33) husband, L, a few years ago and had my daughter A (5) soon after.\n\nWhen I was pregnant with A, I was warned that it would be difficult due to my issues and that she would likely have some passed on from me. I accepted this, and I expected it. She was delivered and was a beautiful baby girl who didn't have my issues at the time.\n\nHowever, as she got older, it became more apparent that she inherited my medical problems. One of which has an optional surgery that could negate it entirely. It's possible to live with it instead of choosing to operate, but the surgery will eliminate it.\n\nI have some trauma with hospitals in general. I've had to be in and out of them my entire life, and it's left some deep wounds. It's awful to spend your formative years stuck in a sterile room with an IV and in pain. I've spent some time in therapy for it, but I still hate them.\n\nThe surgery that would remove the problem is covered by insurance, so money isn't a problem. However, it has a long recovery period, and I don't want my daughter to have to suffer through that.\n\nI've told L that I don't want her to have to go through the lengthy process of recovery. He disagrees and has asked my family members to \"knock some sense\" into me. (His words, not mine.) It's become a big point of contention between us, and I refuse to budge.\n\nSo, AITA?\n\nEdit: For those who want to know, she has radioulnar synostosis in both arms. She'd have to spend weeks in casts with both arms.\n\nEdit 2: You are right. I was letting my own fear cloud my judgement. Thank you. Although, a bit rude to say that I should get sterilized, no?\n\nEdit 3: While I understand that I was undoubtedly TA here, it's disgusting how many people have written horrible comments, sent messages, and just been total jerks. You do not know me. I don't know you. This is ONE moment in my and your life, and I sincerely don't understand why you have to be so nasty about it.\n\nNo, I will not sterilize myself. I will not kill myself, give up my child, or divorce my husband. I will not categorize myself as an abusive narcissistic sadist who hates my child and wants her to suffer like I have. I don't appreciate being psychoanalyzed by armchair psychiatrist Redditors. \n\nTo those who have respectfully put down their points, sent me kind messages, or just been supportive. I appreciate you all."
    },
    {
        "index": 269,
        "label": 1,
        "content": "Not a clickbait title, that's actually what happened. I got called an asshole for it, so now I have come here out of curiosity for you fine people to help settle the disagreement.\n\nI met a girl online and we clicked, and have gone on a couple dates. Two nights ago was our third date and I was treating her to dinner at a local burger place in the city. Nothing fancy, I just wanted some good conversation over a tasty meal. This girl is a knockout, has the rare quality of being a great listener, and isn't obsessed with herself. She's funny, charming, and smart. We had had several great dates and I was getting close to asking her to be my girlfriend. She is also the one who called me an asshole before the night was done (not her exact words, but we'll get there.)\n\nOur waitress for dinner was great. Actually enthusiastic and friendly, on point with the refills, and just top notch service all around. At one point in the evening she did spill a partially-full glass of water on our table, but it wasn't really her fault because she had gotten bumped into, and she was very quick to apologize and wipe the table dry with a smile on her face, so if anything that was a point in her column.\n\nAt the end of the meal, she brought the check and I told her I would like to speak with her manager. She asked if there was something wrong, and I calmly repeated that I would like to speak with her manager and could she please go get him. She leaves and reappears with the manager a few moments later, and I proceed to tell him that we had gotten *excellent* service that night, and that (her name) was one of their best. He thanked me for the feedback and she also looked very happy at the compliment and thanked me.\n\nThe only one not happy was my date. She said, \"If that was supposed to impress me, it didn't.\" and said that I was full of myself. She didn't say much else as we gathered our things to leave and there was no kiss at the door that night. I texted her saying I was sorry for whatever I did wrong and that I'd like to see her again soon, so far no response.\n\nSo pardon my french, but what the fuck?"
    },
    {
        "index": 550,
        "label": 1,
        "content": "I work at an office where I’m allowed to have a beard and long hair, but my manager is stringent on the “no jeans policy.” She frequently ensures that no one is wearing jeans and is wearing professional attire. \n\nProblem is, for the past few months that I’ve been here, the women of the office have always worn jeans. Tight, dark, professional looking jeans, but jeans nonetheless. That is, until a few days ago. \n\nI love wearing jeans, and have always felt I could make them professional too. I was complaining about it to a friend and coworker when my manager walked into the staff room. She said something basically confirming her stance on jeans. \n\nI said “Well, the girls get to wear jeans.”\n\n“No they don’t.”\n\nThen, my coworker, Amanda walked in wearing jeans. I pointed that out. My manager confronted Amanda, telling her that she wasn’t allowed to wear jeans. \n\nIn the moment, Amanda appeared playfully mad at me. But I went over her house last weekend, and she brought up the incident twice, again sort of playfully, but I think she may actually be mad. I apologized, saying I didn’t want to ruin jeans for women but to prove that someone can look professional in jeans. \n\nAITA?\n\nEDIT/ UPDATE: Wow, did not expect all of the responses, though I can’t say I’m surprised about the polarization. At work today, it wasn’t bad. Only one other girl spoke to me, and she too was more playfully mad than anything. I do feel bad that I ruined jeans for the women, though perhaps one day I will work in a place where jeans will be permitted for all. Thank you for all of your input and the silvers!"
    },
    {
        "index": 553,
        "label": 1,
        "content": "Update [here](https://www.reddit.com/r/AmItheAsshole/comments/b7vz7m/update_aita_for_very_rarelyalmost_never_wanting/)\n\n   I've been with my wonderful girlfriend for a few years now, and we usually get along great, aside from this current issue. You can skip to the TL;DR if the exposition is too long.\n\nShe's a self-proclaimed \"foodie\", which I honestly think is just selling herself short - she's a food genius. She can taste and smell a dish and then turn around and recreate it, or even make it better than the original. \n\nIf you taste something and wonder, 'what's that super subtle flavor?' she'll tell you, 'it's anchovy paste/sumac/lavender/some other obscure spice that you would never think of.' When someone is cooking something and they go, 'it's missing something,' she can tell you *exactly* what it needs.\n\n(It doesn't stop there, she knew I had *touched* a diesel truck at work one morning as soon as I walked into the house *that night* because she could somehow smell it on me. It's either really cool or really creepy, depending on the day.)\n\nThat's not it, either. She *heard about a lost family recipe* and the next week, BAM, I'm eating my grandmother's homemade sausage again for the first time in fifteen years. \n\nIt's gotten to the point where I don't see any point in going out to eat, pretty much ever, except maybe her birthday. Even the most exotic ingredients aren't out of her reach, either, and, even though it's not about cost, I've saved up more being with her than I ever had in any other relationship. The only places we really go for date night is ramen - she can't figure out how to make the noodles, but she still tries so it's just a matter of time - and sushi.\n\nOur anniversary was recently, and I had noticed that our local fish counter was selling sushi grade fish, along with the rolling mats and nori, so I suggested that we have homemade sushi for our anniversary dinner before going out and she upset and said, \"I'm not learning how to make sushi because then I'll *never* get a real date ever again.\" We ended up going out instead.\n\nIt kinda took me by surprise that she got so mad, though. She's *lightly* mentioned wanting to go out occasionally to places like Olive Garden \"because she likes the red sauce\" or other places because she likes the food, and now that I'm thinking about it, she's gotten kinda gloomy because I've asked her to cook on date nights instead of going out more often.\n\nShe also brought up that food she cooks tastes better to me because she's tasting and smelling it while it cooks so her senses are dulled by the time it's served, but she has the most acute sense of smell/taste I've ever seen so I kinda think it's just an excuse.\n\nI just don't think it's worth it to go out and pay restaurant food prices when we can stay home for home food prices and have food that's just as excellent.\n\nTL;DR: So, Reddit, am I the asshole for not wanting to pay a restaurant to cook my meals because I practically have a private chef of my very own?\n\nEdit: it's not about the financial aspect of staying home vs going out, I just thought that it was worth mentioning because it's been more of a saving than expected.\n\nEdit 2: I'm taking her out tonight to grovel, guys. I'm also going to politely ask that, if she finds this off of Twitter, please don't smother me in my sleep for being such a dick\n\nEdit3: no, twitter, I don't buy her flowers, thanks for rubbing it in. I buy her herbs and succulents. What flowers do I buy a woman who likes to preserve them afterward?\n\nAlso, yes, I wash the dishes\n\n#Final Edit:\n\nOkay guys. This will probably be my last edit. This post exploded unexpectedly and I've tried to respond to as many comments as I can, but there's just too many of you. If you've asked me a direct question and I haven't answered, I'm sorry. My inbox is a mess.\n\nI really took everything you guys gave said to heart, and I can honestly say that I've been an ass, and it's really hurt my relationship with my girlfriend. It's honestly a surprise that she's still my girlfriend after everything.\n\nSo her mom picked up the girls and I took her out to a really nice tapas restaurant. She was very excited and seemed to enjoy herself, and I apologized for being stupid. After, we took a walk and everything seemed perfect, so I asked her to marry me.\n\nShe said no. She did it kindly, but she still said no. She said that it wasn't a no forever, but she didn't want to commit to a one sided relationship and also said she doesn't think that it's fair that our relationship happens on 'my schedule' or 'my terms'. \n\nI'm pretty heartbroken. I thought everything was pretty okay between us, but she thinks we should go to pre-marital (pre-engagement?) counseling and the division of labor needs to change over a serious sit down conversation.\n\nSo, Reddit, you were all right. I'm the asshole who almost lost the love of my life, and most of you were right - it wasn't over restaurants.\n\n"
    },
    {
        "index": 578,
        "label": 1,
        "content": "This happened last year but since it still gets brought up during arguments every now and then and I just discovered this Subreddit I decided to check what you guys think.\n\nMe and my wife have two children (15F &amp; 11M). My wife is a stay at home mom since the birth of our second child. I (46M) work full time and earn a six figure salary. My job is highly stressful, requires me to travel a lot and mostly sleep in hotels. I only get to come home to my family on every second weekend, on average. Despite working a lot, I am glad to do it so that my family can live a comfortable life.\n\nLast year, I decided to buy my wife a Roomba for Christmas. My wife tends to be the one who vacuums the house so I presumed that she would like this present as it would free her of this chore.\n\nAs she unpacked the present, she was heavily offended and did not hesitate to show it, which made the whole situation quite uncomfortable as my parents and other members of the family were also present. She argued that 'this should not be a present directed at her but at the whole family, as it is the entire family’s responsibility to clean up the house'.\n\nSince I work and am the sole source of income in the family and she is a stay at home mother, I think it is apparent that she should take on responsibilities such as taking care of the kids and maintaining the house. The gift was intended to somewhat relieve her of this burden. I, personally, would have loved to have received a Christmas gift that would have somehow made it possible for me to spend less time working. As cheesy as it sounds, I think that time is one of the most precious gifts and that Roomba would have definitely bought some time for her - time that she could use to do whatever she pleased instead of vacuuming. \n\nUnfortunately, one year later, this still often gets brought up during arguments, often coupled with her crying.\n\nSo, AITA in this situation?\n\nEDIT: I should also add that I would have never gifted my wife a vacuum cleaner or anything along these lines. I saw the Roomba as a robot that would fully take over this task which is why I thought it was a good idea.\n\nEDIT #2: I asked her numerous times before Christmas last year what she would have liked to receive and she repeatedly told me that she does not want anything. I was left to guess and chose the most practical gift that I was certain she could be able to make use of."
    },
    {
        "index": 932,
        "label": 1,
        "content": "My husband and I never thought that we could get pregnant, so we got plenty of therapy after a few failed treatments and moved to fostering with the intent to adopt. We've had a few fosters, but this concerns our current foster, a 9 year old who's been with us for two years. He's a spirited boy, but not a bad kid. Just takes a lot of time, money, and mental energy. \n\nThe child's case plan has now moved to adoption, and we were identified as an adoptive resource. We were taking the first steps towards adoption when we found out that I was pregnant. It was mind-blowing as this is my first pregnancy, and I am now over 40. I had thought I had finally hit menopause, but was in fact 12 weeks pregnant. \n\nUnfortunately, after thinking we could do both, we did the hard math, and with our work and our finances, the only way we could raise our foster son is if we terminate this pregnancy. We can't financially have both children. I can't emotionally bring myself to terminate what is realistically our only chance at a biological child, who I am already bonding with. My husband wouldn't think of it either. We have to refuse the adoption. \n\nUnfortunately still, our foster son knows of preparations for an adoption through his therapist and social worker, so now we're taking him away from a stable home and what may be his only chance of adoption as he is older, all for reasons that aren't his fault. Am I the asshole for putting a still unborn child above him?\n\nEdit: \n\nBaby:\nBaby has passed prenatal testing with flying colors.\n\nFinances:\n\nWe currently live in a 2 bedroom condo. We are required to give foster son his own room, which is not possible with a baby by social services standards. Us moving into the living room doesn't pass either. Social services is giving us until January to find a larger place, but we would have to stay in the county. We can't afford 3 bedroom places in the county, as it's a costly area.\n\nWe don't qualify for assistance with both of us working, and if one of us quits, we wouldn't be able to afford our current place even with the assistance we could get. Both of us working would make it difficult to swing appointments for two children as well. It's a catch 22 basically."
    },
    {
        "index": 118,
        "label": 1,
        "content": "What I thought would be a total non issue has ballooned into a huge problem and I'm up at 7:05 AM dealing with it. I figured while I wait for a text, I could post here to see if what I did was really that bad. \n\nI'm a big fat ass, there's no way around it. I love to eat which probably borders on addiction but I figure since I'm only hurting myself it's probably better to just live my life. I have some great friends although there is no doubt I'm the \"harmless, funny token fat guy\" of the otherwise pretty good looking group. I guess that sets the stage enough. \n\nLast night my friend hosted UFC and I was invited. He got a 6 foot party sub. I also brought homemade wings that are sort of my specialty. Well of course people flocked to the food and I had basically one serving of the sandwich but people devoured my wings and I didn't get to have a single one. Which is totally fine that's why I brought them but maybe an hour later I was starving. I kept eyeing the sandwich and I'd say there was about 3 feet of it left. I waited an hour, then another half hour and no one had touched it (but they were still munching on chips, pretzels and what not). So I was like screw it...I took about half of what was left and ate it. Then the last half sat for another 10-15 minutes and no one said anything so ate the rest. \n\nWell to be sure as I was swallowing the last bite the host's girlfriend asked where the sandwich was. Like I was the guilty party pretty much everyone pointed at me. I guess they'd noticed me eating the sandwich. She was furious and said that I was an incredible pig and that I had been super selfish to eat 3 feet of a sandwich. I felt so bad I tried to explain to her that I really did wait over an hour and thought people had lost interest. I also tried to explain how everyone had ate my wings and she said something along the lines of \"you brought them to share Alan, if someone had eaten over half by themselves that's not fucking sharing is it?\" \n\nI offered to order pizza or even go get subways and she said that it was a pathetic offer because the party sub had been from a local shop owned by her friends. I said I was sorry but the night was so tense from then on out. \n\nI woke up this morning to several texts from my twin sisters (the host's girlfriend's best friends) saying that I had to get my shit under control and that everyone is really mad at me and that I embarrassed myself last night. I tried to explain to them what my mindset had been and they haven't responded. \n\nWas I the asshole for eating that much of the sandwich last night?\n\nEdit: I guess I’ve been banned from responding but my inbox has 1200 notification so I can’t find out why.\n\nTo answer what seems to be the most common misconception, this wasn’t a subway party sub so definitely not 4x the size of a regular sub. This is a local place so it’s about 1.5 times the width of a regular sub. Its still a ton of food don’t get me wrong but I can down 5 subway footlongs in an afternoon easily; this is probably about equivalent to that, not 12 like some people are saying."
    },
    {
        "index": 594,
        "label": 1,
        "content": "In January of 2019, my husband was diagnosed with a brain tumour. It was in a completely inoperable part of the brain, and was told me had six months to live. He stuck it out and died in October, three months longer than he was expected to. He was always positive, and decided a few weeks after his diagnosis that he would write letters for our daughters for significant events in their lives. My husband was my soulmate, and the past few months have been difficult knowing I’ve lost him \n\nWe have two daughters, Mia who is 21 and Imogen (Immy) who is 19. All three of us have become a lot closer since their dads death, and we’ve all really struggled. My husband and I were together since we were children, got married when we were 18 and we were approaching our 20th wedding anniversary when he passed. \n\nIn February of this year, Mia got married to a boy she’s been with for about 6 years. I absolutely love her husband and he’s been incredibly supportive during all of our grief. My husband wrote a letter for Mia to open on her wedding day. It’s worth noting that my daughters were unaware of these letters, it was my job to give them to our daughters. \n\nHer wedding day comes around and I just can’t bring myself to give her the letter. I read it and just wanted to keep it to myself. I had his handwriting and his words and it felt like he was there, and I couldn’t bare the thought of giving that up yet. I was fully intending on giving her all the other letters as the events happened. \n\nLast week Mia and her husband bought their first home together. They’d been living at our home since they got married, and so had a lot of stuff to pack and move to their new house. Mia asked me where her important documents were, passport, birth certificate etc, so I told her they were in my top drawer of my dresser in my bedroom. The only letter that was in there was the one I was meant to give her on her wedding day, the rest were hidden away. \n\nShe immediately recognised his handwriting and of course it was addressed to her, so she read it and broke down. She came and found me and started screaming at me asking how I could be so selfish. I didn’t really know what to say apart from the fact that I wanted to keep it and she could take a picture of it. Both my daughters called me an asshole and are convinced I’m keeping them from a load of their dads stuff. AITA?\n\nEDIT - have your opinions, that’s why I posted this. But do not come into my PMs and tell me I should’ve been the one to die instead. You’re worse than I am if that’s what gets you off. Sending me death threats isn’t okay either"
    },
    {
        "index": 379,
        "label": 1,
        "content": "I had a party at my house last night. I have an antique slot machine from the 1940s that is in absolutely spotless and working condition in my living room. My step grandma was a show girl she she got it while dating a count room guy prior to meeting my grandpa.\n\nOver the years people have played it and maybe won a few quarters here and there. Maybe a max of $50 at a time. As far as I know the jackpot was never hit on it so however it works there was probably about $700 in the jackpot reserve that had built up over the years. I’d never bothered to have it cleaned out since it just seemed like a fun novelty. \n\nWell a friend’s friend hit the jackpot last night. I was fucking floored when he legit thought he could keep my ~$700. His case was hed been playing with his own money and I would have kept his quarters. My argument  was I’d be happy to give him his quarters back if he’d asked but I’m not a casino and while I’m not destitute, I can’t afford to give someone $700. Argument caused the party to wind down and one of my best guy friends basically told the guy he’d be in real shit if he tried to leave with the money but the guy left threatening to come back with the cops and sue me in small claims court. I have no idea if that was realistic but no cops came back. \n\nSo was I the asshole for nor letting him keep the money?\n\nEdit: sorry guys I can't answer such witticisms as \"why are you so shity?\" because I've been banned.\n\nEdit2: wow since I’m a “baby gangster” who has been running an “illegal gaming operation” (both things that have been said) I might as well just go whole hog and start running guns and pimping underage Andean alpacas to people who would pay for the privilege. I’m really that bad? I just thought I had a cool thing my step grandma got by banging a dude from the count room.\n\nEdit3: gotta address this one directly:\n\n&gt;If this was really last night, give it a week or a month and see how many friends, especially mutual friends, are no longer talking to you. Forget our votes, listen to those. Also forget small claims, you need to worry more about hearing from your state's gambling commission.\n\nIf the moderators allow me to update, I will ABSOLUTELY update and tell you how many friends I’ve lost. Almost everyone  (including the friend that brought the “winner” thought he was being a total asshole for the way he was down on his hands and knees scooping up quarters off the floor to put in his pockets. And he was lying about much he put into the machine too (he said $75–who the fuck walks around, nuch less even get $75 in quarters—when going to a party at a strangers house). In addition, I will gladly, gladly call our state gaming commission (AZ) and ask what trouble I might be in. I will also update on that when I can. People CAN’T be this dramatic in real life...I’m a ducking instagram influencer for my job, the phoniest, most vapid, saddest job a person can have right now and I’m still blown away by some of these comments. Call me YTA all you like, but don’t be stupid and claim to have knowledge you don’t  in the process.\n\nEdit4: well I was banned for joking around, other people have bad posts calling me a cunt up for over an hour.  Makes INFO hard but I’ll try to explain my thinking on the money in the machine and why I can’t “afford” to give it to him. \n\nSay you have a change jar, has $100 in it. Your good friend asks to borrow $25, for parking, you'd say yes right? Another friend says wow, that’s cool I have $1.25 in my pocket, can I donate to your change jar? You’d say yes. Now let’s say a guy you’ve never met says “hey I just put .80 into your change jar, now I’m taking the whole thing.” You would say no. It’s how I’ve always seen the slot machine as huge change jar for all my close friends to use. I’ve given people quarters to play, I’ve taken a quarter here and there from people who wanted to see it work. I’ve taken in maybe $100 over five years. Maybe. That’s a nickel a day. that’s not a freaking illegal gambling operation.\n\n\nEdit5: a good question:\n\n&gt;INFO Did he explicitly ask if he was allowed to play it, and keep what he wins? If no then he played it without permission, you aren't running a casino.\n\nNo he did not, the first time I ever saw or spoke to him was when he was on his hands and knees picking quarters up off the floor slamming them his pockets.  I don't mind if people play it, I even give people quarters to play it (since no one has change anymore) but he did not ask.\n\nEdit6: another good question\n\n&gt;Also, need more info. You stated that other guests have won small jackpots in the past (max $50). Did you let them keep it? If so, why are you making a double-standard here?\n\n\nI would have let him keep $50-100 (he certainly got away with some in his pockets) but he was such an asshole right away that he didn't give me the chance to come to any sort of deal. Most everyone at the party just wanted him gone. I do feel bad and maybe my guilt over the apparent double standard is why I'm asking here. But I do feel as though had he been even slightly cool and not threaten cops or lawsuits I wouldn't have been backed into a corner.\n\nEdit7: \n\n&gt;INFO\nWe need to know where the money came from. Did the money in the machine come from YOU putting it in or playing the machine\n\nSo this is all guess work based on what my grandma said the jackpot could hold (there's a window that shows the coins in rhe jackpot, the space behind is about the size of a big shoe box). She said it gets full at $800. It was more than half when she and my grandpa gave it to me, I always guessed $500. In five years it's now 7/8ths full. I play it from to time to time so I'd say $100 of that is mine and $100 is friends. I think the jackpot and normal pay outs come from different boxes so last night was the last night I've ever seen that window empty. I know nothing of the machine or how it works or how to change settings so I may be so wrong and a slot machine \"nerd\" could correct me if I'm way off base.\n\nEdit8: this is the best yta take so far and I can't let it get buried.\n\n&gt; I really hope you get into some serious legal trouble and then you’ll wish all you lost was several hundred and not thousands including jail time.\n\nEdit9 (at 5:45am, gotta work): you guys are really cracking me up. I love the comments that say \"your edits make you YTA! Alone. Where did the money come from btw?\"  I truly can accept the YTA votes but so freaking many of them have basic facts wrong.\n\n1. I wasn't profiting off this machine. I've literally never opened it up and taken a single coin out.\n\n2. I can't afford to give a random dude $700. I don't need it now, but I have savings account I don't need it now either but I might some day. And now I've found out that some of the quarters that my grandma had from the 50s or 60s might actually be silver. So good thing I hung onto them right ? (I can't wait for the \"you're a stupid thot\" rationalizations to come from this one). \n\n3. I never cleaned it out because honestly I like the way it looked with the coins in the window. This thing is enourmous and built with casino security in mind so it was in fact, a great piggy bank. \n\n4. Some nice NTAs have suggested I have a bowl of quarters a for people to play. I actually in effect did that because 80% the time people who wanted to play didn't have change (I got it five years ago) so I always had quarters around, maybe just not right by the machine. \n\n5. As an example, Over the years it's mostly friends kids who want to play. I had a very precocious 9 year old once come over with his $20 of money truly expecting to get the jackpot. He was heartbroken when he didn't win (I might have given it to him since he was so cute) but I gave him a $20 silver certificate my step grandma had given me (acquired ny dubious means no doubt) and that kid was thrilled. so I always, always give people money back if they ask. I never intended to profit off the machine. No one has ever made a big deal of it before (save the 9 year old).\n\nEdit10: this dude wins the comments, for all time:\n\n&gt;I bet u look like jared fogle or some shit\n\n😂😂😂😂😂😂😂😂😂😂😂\n\n\nEdit 11: sooooo the plot thickens, thank you to some very helpful people who own slot machines who DM'ed who were also able to suggest experts in my area, I was able to call a local person who works on antique slot machines. My slot machine is highly customized but it's based around a pretty well known model from that era (don't want to say exactly because only a few of them exist anymore) and he said I could tell right away if the machine was broken or had been tampered with. In my very, very, very amateur job of checking it over it does appear that this little piece is either broken or misplaced. So it looks like this piece of shit \"guest\" actually broke my machine to steal my money. There wasn't a jackpot at all. I don't have confirmation of this until the repair guy is able to come later this week but it looks like that's what happened. The guy said there's an outside chance that if that piece was broken or tampered with that it was an accident but he wouldn't bet on it.  I still don't care if I'm YTA till the cows come home, posting here has probably allowed me to get to the bottom of this. And fuck that guy.\n\n\nEdit 12: well the amazing and level headed moderators of this sub just ever so politely informed me that I will not be allowed to update this post. So the short story is the \"winner\" almost certainly was hitting the machine and caused the jackpot to spill out. So had I been a real casino I would have enacted the \"malfunction voids all pays and plays\" clause. So yeah, I was totally in the right. Fuck this sub. Fuck the moderators. And fuck those of you on your stupid high horse. Most of you however were cool."
    },
    {
        "index": 721,
        "label": 1,
        "content": "I’m visiting my girlfriend’s family for the first time and they’re kind of rich.\n\nThey have a maid who comes and tidies up for a bit every day. \n\nMy family isn’t broke, but we’ve never had people working for us, and it made me super uncomfortable. Like, who am I to have someone serving me and cleaning around me while I sit there? I can’t imagine if my mom were witnessing that. She’d flip. \n\nSo I got up and started to help her tidy up. She thanked me for the help and told me I really didn’t have to worry about it, but I told her it was no trouble (it really wasn’t, we were just sitting watching TV.) \n\nLater that night my girlfriend’s parents asked me not to help the maid clean because it was a boundary thing and her work was her work and guests are guests. I told them it made me really uncomfortable to have someone clean around me and they just said not to worry because she’s paid well and has been with them a long time. \n\nThe next day it happened again and it made me so uncomfortable I said “hey let’s go outside” to my girlfriend but she was busy on her laptop. So eventually I couldn’t help it, I had to jump up and help her out. \n\nHer parents walked in and looked pissed and my girlfriend finally clued in and ushered me outside. \n\nI’m still so confused by the situation. I’m not sure if I was in the wrong for helping her clean or if I’m in the wrong now for not helping her. \n\nMy instinct is to help, but when I do people get pissed, so, if you understand the dynamic better than me, please clear this up. \n\nAm I the asshole for helping her clean?"
    },
    {
        "index": 95,
        "label": 1,
        "content": "Yesterday I was supposed to spend the night at my friends house with some of my classmates and we were playing truth or dare. There really is no reason for us to choose truth since we already know a lot about each other so we mostly went just with dares. It was pretty fun and we had some weird challenges.\n\nI was staying next to my friends brother and when it was my turn a classmate challenged me to kiss him. His sister immediately told my friend to change the dare and so she did. To be clear, her brother did not say anything when he heard the dare and just laughed so he definitely looked like he was ok with it right? Well WRONG because after I kissed him he told me wtf I am doing and looked like he was really grossed out by it. I was honestly a bit offended and asked him why he is so grossed by me kissing him, I am actually a pretty ok looking girl and even if I wasn’t, there was no reason for him to act like this. He ended up leaving the game and my friend told me that what I did was wrong on so many levels and to get out of her house. My other classmates didn’t say anything so I think they were on my side but didn’t want to participate in this argument (I will ask them when they go back home). Anyways I did end up leaving. Do you guys think I was the asshole here?\n\nPlease do NOT comment yet, read this:\n\nOk I don’t know how to explain this without being misunderstood but could you guys do me a small favor? I used a throwaway account for privacy reasons but the thing is, if this post blows up, there is a high chance for my friend to still see this. Could you please instead of commenting, DM me if your judgement is ‘YTA’? I promise if I get a lot of YTA dms I am going to ACCEPT the judgement as per rule 3 but it’s just weird if my friend sees this and sees ‘YTA’ comments especially after our last argument, you guys get what I mean right? Thank you.\n\nEDIT: Oh cmon guys. This post if 1 in rising now. Can't you please do as I asked you? Would you be ok posting on this subreddit just to get comments full of YTA and your friends see them and laugh at you?\n\nEDIT: Hey mods! Please check your inbox as I sent you a message. It's urgent.\n\nEDIT: Ok the mods responded about automod and they basically told me to suck it up and deal with it wth? Guys please just do as I asked you. I accept my judgement"
    },
    {
        "index": 111,
        "label": 1,
        "content": "Let me just preface this by saying this: **I HAVE ABSOLUTELY NO PROBLEM WITH INTERRACIAL RELATIONSHIPS.** Now that the air is clear, let me continue. \n\nMy daughter (Anna) has recently started to date an African American man (Jamal). While I'm not exactly what you would refer to as \"liberal\", he's a nice young man and as long as my daughter is happy, I'm happy. The problem is Anna is rather naive about the community she lives in. While her friends are quite content to see a relationship like hers, more than a few tongues are wagging in the community and a few people have privately expressed their concern to me. As I said, I have no problem with mixed relationships and I've set them straight, but I am painfully aware of how these matters are viewed by certain segments of the population.\n\nMy parents are planning to come and stay with us for a week and Anna expressed a desire to introduce Jamal to them now that things were getting more serious between them. I told her on no uncertain terms that this wasn't going to happen. I may have no problem with Jamal, but they *absolutely will*, and even when the relationship ends they won't forget it. They might even go as far as to cut her off entirely. Anna was extremely upset by this and implied I was a racist and more concerned with what my parents think than how she feels.\n\nAs I said, I know my parents. They simply aren't okay with mixed relationships and if Anna were to bring Jamal over even as a friend, they would be furious both at her *and* me.\n\nAnna is currently staying with Jamal and doesn't want to speak with me right now. My wife stands by me given she knows very well how my parents are (they had a problem with her for months over the *length of the skirt* she wore when I introduced her to them, for christs sake), but a close friend I confided in told me that I have behaved like an ass and that I needed to focus more on my daughter than pleasing my parents.\n\nNo advice needed, but I have to know. Have I been an ass?"
    },
    {
        "index": 923,
        "label": 1,
        "content": "My daughter has recently turned 16 and, for a couple of months now, has been constantly asking for a lock to be put on her door.  She says it’s to keep her brother out - who barges into her room every now and then to bother her - but I’m not sure if the benefit is worth having the lock in place.\n\nI don’t like the secrecy of her locking herself in her room and I’m worried she’s trying to hide something from me or that she’ll take the opportunity to lock me out. I admit that I’ve forgotten to knock sometimes but other than that I see no reason as to why she’d need a lock. \n\nThe way I see it, it’s my house and I am simply unwilling to have any locks put in anywhere. She’s young, and doesn’t really know what’s she’s asking for.\n\nSo, WIBTA if i don’t let her get the lock installed?"
    },
    {
        "index": 109,
        "label": 1,
        "content": "I have 2 children, a 9 year old son and a 6 year old daughter. My son had a Minecraft world where he built quite an impressive castle on an island, which he was very proud to show to me.\n\nSince school was canceled, he has had issues with waking up on time. He is supposed to wake up at 7 each morning, but for the past month he has been sleeping in until about 9 or 10. I always set an alarm for him, but he sleeps right through it. I don't wake him up because waking himself up is a skill that he needs to learn. I told him about 2 weeks ago that there are going to be consequences for him if he continues to sleep in every morning. At first, he understood and was waking up on time every morning. But for the past week or so, he has fallen back into old habits. I told him yesterday that this is his final warning. Today, he slept in until 11.\n\nSo I followed through with my warning, and went on the computer and deleted his favorite Minecraft world. I also took away computer privileges for the next month. When I told him, he started screaming and crying. He told me that he spent a whole year working on that world, and he's very distraught that he's never going to see it again. He has been crying and sobbing throughout the day, and has refused to eat any of his meals."
    },
    {
        "index": 279,
        "label": 1,
        "content": "I’m 40M, my wife is 39F, son in 15. \n\nYesterday when it was dinner time I called him to come downstairs few times. He didn’t answer me so I assumed that he didn’t hear me. I went upstairs and knocked on his door, he said he’d come downstairs in few minutes. After 15 minutes he still didn’t come downstairs so I walked in his room. I knocked first. He was obviously crying. I asked him what was wrong but he didn’t answer me so I didn’t push him more. \n\n I went downstairs and told my wife about it. She went upstairs to talk to him and stayed there for half an hour. She came back and brought him food upstairs. When I asked her what was wrong she said that it wasn’t anything important and told me to drop it. I got kind of upset because I want to know what was wrong and I’m his parent as well. \n\nI haven’t been fully ignoring them but I’ve been acting kinda distant since yesterday. My wife got mad at said that I was acting extremely immature."
    },
    {
        "index": 566,
        "label": 1,
        "content": "This is my throwaway account. \n\nMy (37F) babysitter (16F) has been babysitting for me for about 2 months. She’s a very sweet and quiet girl and is good with the kids (4F and 8M), we’ve only had small problems here and there but nothing major at all. When she first started babysitting for me I had asked her if there were any drinks or snacks that she’d like me to keep at the house as she’s here from 9-7 every day Monday through Saturday. She mentioned that she really liked seltzer water and I had bought them for the first month, but honestly I forgot after a while and never kept any in the fridge. A few days ago I bought hard seltzer’s for me and my husband, and didn’t think anything of it. \nA little bit after 2 pm she messaged me that she wasn’t feeling well and thought that she may have to go home, if it was possible if I could get off from work earlier. I asked her to try and hold out until the end of the day. Not too long after she called me crying, saying that something was wrong and she had to go home. \nShe was drunk clearly, she drank the hard seltzer’s. I told her to leave and she walked home. \nShe messaged me the next day and said that she now knew that hard seltzer’s were alcohol, and she hadn’t know, she never drank before as both of her parents were alcoholics and she has diagnosed PTSD regarding alcohol, she never planned on drinking in general. I told her not to come back as she put my children in danger. She called me crying and saying that she didn’t know, and that she cared deeply about my children and would never ever drink with them, or at all, and that she needs the money to pay for her drivers permit (she comes from a not so well off family). I told her to find a real job and that it wasn’t my fault she got drunk. \nMy husband says I’m being very rude and that she did try to reach out when she wasn’t feeling well. My kids are upset to see her go. \nSo reddit, AITA?\n\nEdit: okay guys, I’m the asshole. I see it now. Thank you. I’ll hire her again.\n\nEdit #2: I will pay her $1500 a week from now on. And pay for her permit and test. As well as her license test."
    },
    {
        "index": 588,
        "label": 1,
        "content": "So right now both of my kids (16 year old son and 9 year old daughter) and my ex are extremely mad at me because I won't give up my appointed time with them. My son wont even talk to me and my daughter is crying all the time. \n\n&amp;#x200B;\n\nA little backstory. Me and my ex divorced shortly after my daughter was born. I blame him for it and he blames me. I won't go into detail here. We ended up with a 50/50 custody agreement switching every other week. While this was 8 years ago we're still not on good terms. We rarely ever talk to each other outside of the kids and i'm perfectly fine with that. One thing we have agreed on since the beginning though is that we don't plan things on days that aren't ours. And unless it's extremely important we don't \"switch\" days or weeks. In the 8 years since we've been divorced I have never asked him to have the kids on a day that isn't mine and I've never given him one of my days even if he begged. \n\n&amp;#x200B;\n\nWell, last week my ex contacted me and told me the \"good\" news. His parents are hosting a week long family reunion in the summer at Disneyland and he want's to take the kids. Well, the problem is that it's on one of my weeks. He asked me to let the kids stay with him that week or to switch a week with me and I shot him down. It's my week with them and I get to spend it with them. I told him if it's so important to him to reschedule but he claims his parents can't do that and this is the only week that the whole family can go and he told me that I need to \"think of them\". I told him \"tough luck\" and hung up on him.\n\n&amp;#x200B;\n\nWell, this last Sunday when my ex dropped the kids off with me my son refused to talk to me at all and my daughter wouldn't even look at me. When I asked my ex what was wrong he refused to talk to me, only saying \"ask them\" in a snarky tone before leaving. When I asked my daughter what was wrong she burst into tears and said that i was \"not letting daddy take them to Disneyland\". Asking my son (who still refuses to talk to me) it turns out that my ex told them I was not letting them go to Disneyland with him. He's trying to paint me as the bad guy. I sat both of them down last night to talk to them and explain it's my week with them but they refused to listen to me. My daughter just cried and my son told me i'm only doing this to get back at my ex.\n\n&amp;#x200B;\n\nI'm not though. I think its unfair for him to do this when his parents scheduled it during my time with them. I demanded an apology from my ex and him to set things straight but he refuses, and his last text to me being \"can't tell them the truth cause they already know it\". \n\n&amp;#x200B;\n\nI'm so pissed right now. Am i the asshole because my ex scheduled something during MY time with MY kids? How is it my fault that i'm only using my right to spend time with them? "
    },
    {
        "index": 517,
        "label": 1,
        "content": "This might be a bit long but thanks for reading. \n\nI’ve been a single mom to two kids since they were 6 and 4 - their dad passed away. Around that time, my son was formally diagnosed as autistic. He’s not very verbal and prone to physical outbursts when he has a meltdown. He’s been in therapies of every kind for his entire life and it’s helped somewhat.\n\nTheir dad had a life insurance policy which allowed me to stay home as my son’s main caregiver while working freelance, but money was tight and finding anyone capable of watching him has always been a challenge. \n\nMy daughter was graduating from college last year. A week before the ceremony, she had an awards ceremony for academic achievement. I was obviously incredibly proud of her. She asked me to come to it and I said I would. \n\nHer college is two hours from here. I hired a trained sitter who specializes in autism the day of the ceremony. Right as I was about to leave, my son had a meltdown and was lashing out at the sitter. I couldn’t leave, and he wasn’t calm for hours. I’d left my daughter a voicemail saying I wasn’t going to be able to make it. \n\nShe called back that night absolutely livid. She called me a shitty mother, said I had two kids but only cared about one, that I’d missed every game and performance she’d had as a child and it clearly wasn’t going to change as adults and that she was just done. She said she knows he can’t help it, but her brother is incapable of showing empathy and it made it hard to be around him without resenting him. She hung up and that was it. I’ve barely spoken with her since. She didn’t send tickets for the graduation we were supposed to go to the next week. She hasn’t shown up for holidays and I’ve heard she’s engaged but didn’t call to tell me. She’s cut us out, and in the one of three times we’ve spoken since she said it’s easier for her to not have us around than be disappointed and that being alone at events is nothing new for her, she just doesn’t have to bother getting her hopes up I might come now. \n\nAITA - I’ve offered family counselling and all other manner of things. I know I wasn’t a perfect mom growing up - I didn’t make it to her things, but not for lack of caring. I’m heartbroken but I don’t think me not showing up in an emergency should have lost me my daughter forever."
    },
    {
        "index": 699,
        "label": 1,
        "content": "Upfront, my boyfriend has an awesome penis. Its not huge or anything, about seven inches (we measured) and fairly girthy- but it is really, really- even comically small when its flaccid (like 2 inches). In the privacy our relationship, I playfully make fun of it all the time and he doesn't mind because he knows that he pleases me in bed. However, he has complained in the past about how much he hates \"locker room moments\" when other dudes see it and assume he is hung like a grape even though he is not. \n\nSo the other night we were having dinner with friends and played a game where we pull word cues out of a hat. One of the cues was something like, \"things that are short\" and I write down, \"my boyfriend's penis\". They were all read aloud and when its revealed that I wrote that particular answer the room explodes in laughter. My boyfriend tries to brush it off \"oh you got me! Ha ha\" and laughs with everyone else, then one of my boyfriend's male friends (who he goes to the gym with) slaps him on the back and tells him \"oh we've all seen it, we still love you, bro!\" more laughter.\n\nAfter we get back to his place, my boyfriend tells me that it bothers him that his friends think of him as the small guy because all they had seen is his flaccid penis in the locker room. He said that they've made fun of him in the past and he has had to brush it off for years because he feels that denying it would make a bigger deal out of it than it is and has to silently take it. He said that by making that joke, all I have done was reinforce the perception and that it will just fuel the teasing. He wasn't mad, just disappointed. He said that he would never make fun of me if I had something unappealing about my body because he would never want to give me a negative impression about myself, that he would tell me I was beautiful no matter what. \n\nI felt really, really bad when he said that. I have apologized and things are fine now but I think that maybe he is blowing this out of proportion? Am I the asshole or should he maybe not take this so seriously? "
    },
    {
        "index": 953,
        "label": 1,
        "content": "My wife [25F] and I [27M] have been married six months now. I have a good job in sales, and have managed to save enough to get together a deposit for a house. It is true that my parents have helped me out quite a bit too financially. \n\nMy wife has not been employed very consistently. She has worked as a model, but hasn’t saved much at all. \n\nI bought the house, and the estate agent handed over the keys to me. My wife wasn’t there at the hand-over. I was obviously super excited to show her the house, and for us to start our lives together. \n\nWe drove up to the house yesterday. I said to her while we sat in the car outside: ‘is it OK if I go in alone first, just so I can have a moment alone in my first home?’ I felt that it was a Significant Moment in my life, and I wanted to experience it alone, even just for 30 seconds. \n\nMy wife was upset about this and has been off with me ever since. We have moved some of our stuff in but she’s clearly pissed. I think she’s being selfish. My brother says I am being ridiculous.\n\n\nEdit: Thanks for the comments guys. I wasn’t expecting that much of a response. I do see that all the replies are leaning towards me being the asshole. I have decided to apologise to my wife properly. I think I was quite caught up in the emotional intensity of the milestone. Thanks."
    },
    {
        "index": 617,
        "label": 1,
        "content": "My lovely girlfriend and I have been together for 8 months. She slept over at my place last night, and in the morning she woke me up saying she had went out and brought back a couple of lattes and pastries from a coffee shop around the corner from my apartment for breakfast.\n\nMy issue with this is that my apartment has a two factor entry, first my student ID to scan in and then my key to get back into the apartment (it auto locks).\n\nI asked her how she was able to get back into the apartment and she said that she grabbed my keychain (which has my ID on it in a wallet type thing) before heading out to buy us breakfast so she would be able to get back in. I told her that I didn’t appreciate her violating my privacy like that, and she got upset, saying that she was just trying to do something nice for me. We started to fight about it and I ended up asking her to leave.\n\nSince then, she hasn’t answered any of my texts or calls. When I told my roommate about this he said that I was the asshole because she did something thoughtful for me and I yelled at her about it. I think she was violating my privacy by stealing my keys. AITA?\n\nEdit: I thought it was weird that she took my keys without asking, they could have gotten stolen or something while she was out, I get that she was being nice but why couldn’t she have asked??\n\nEdit 2: and no she still hasn’t responded to me\n\nEdit: I’m at work now obsessing but I know that I screwed up. I had a bad experience with privacy in my last relationship and i guess I’m projecting or something. And no, my girlfriend hasn’t responded to any of my voicemails or texts besides sending back money I tried to send her for the breakfast last night but she might not be awake yet, it’s early in my time zone\n\nFinal edit because people keep messaging me: long story short, she texted me and we met for coffee earlier this afternoon. I brought her flowers and apologized for being insane. We had a long talk about my privacy issues from my last relationship.  She chose not to break up with me, she will be getting lots of dates and back rubs in the future.\n\nAlso, I am already in therapy but thanks for suggesting it"
    },
    {
        "index": 812,
        "label": 1,
        "content": "I am honestly heartbroken right now.\n\nI (24F) am a breast cancer survivor. I have had my left breast removed and there's just a scar there now. \n\nWhen I go out I wear a silicon padding on my left breast otherwise it looks very odd and makes me self conscious. \n\nMy boyfriend (23M) and I have been in a long distance relationship for the past 3 years. We had met a couple of times but we just enjoyed each other's company. He knows i am a cancer survivor but doesn't know about my breast.\n\nI decided to move in with him about a month ago and we tried to have sex. \n\nI said tried because the moment he laid eyes on my breast his face went white and he refused to touch me further. He said I had cheated him and that I should have told him earlier about my breast.\n\nI told him that I didn't think it was important since he said he loves all of me and that he thought I was beautiful. I am honestly so conflicted right now and I feel like a horrible person.\n\nAITA for not telling my boyfriend that I don't have breast?\n\nEdit: Had a talk with him. He says he can't be with me anymore, he didn't know I was lacking a breast because I looked fine in my pictures. Thank you for your help everyone\n\n\nEdit: To those who think this post is fake, would you like to see my scar? Please be more sensitive before making claims"
    },
    {
        "index": 261,
        "label": 1,
        "content": "So my situation is a little difficult so I thought I would confide in the good professional people of reddit. Couple days ago me and my brother we’re hanging out late night doing regular guy things drinking, watching sports, etc. We haven’t seen each other in maybe 5-6 years so naturally we started talking about life and what’s been going on the past few years. Towards the end of our conversation we started to get to the “secrets” I mentioned something along the lines that I smoked weed for the first time and did various other substances (This was hard for me to tell because my whole life I was pretty much anti-drugs and such.) We both laughed about it saying “Just don’t let mom find out” The joke died out after a little bit and then he just blurted out “I cheated on my wife...” At first it didn’t register until I saw his face and he was dead serious. I for one hate cheaters, but I try to do my best not to judge anyone for their actions. He begins explaining this was something that happened about 4 years ago when his wife was always busy with work. She would travel a lot and be away for weeks at a time. He told me they were going through a tough time back then lots of arguing, not communicating, and that he felt really lonely. During this same time my brother met a girl at his local gym, started off as friends, slowly kept bonding and you guessed they did the sex. He told me this occasion only happened once and pretty much cut her off after that night because he started to feel guilty for a short while. Few months later his relationship turned for the better for him and his wife. Pretty much after his wife’s travels slowed down his whole relationship has been great. They’ve both gotten promotions, bought a house, more family vacations. (They have a kid) \nHe told me life has been good to him now and he’s just thankful things have finally worked out. \n\nAs stated before I hate cheaters and I’ve always felt that the person being cheated on always has the right know. I know for sure this would probably destroy their marriage and there would be a fight for the kid. My heart tells me I have to tell her because it’s the right thing to do, especially because I’ve known my brother to cheat one other time on an ex-girlfriend couple years before his current wife. My brain tells me it’s none of my business and I should keep my mouth shut. I don’t want to see their kid go throughout that kind pain either. On one hand I betray my brother if I say something on the other hand I betray our close family friend because I know this secret and I don’t say anything. I wish he never told me, ignorance is truly bliss. So there it is, WIBTA if I said something?\n\nTLDR: Brother Cheated on his wife years ago because he was depressed, now everything is better and he told me about it, but now I feel obligated to tell his wife because she’s a close friend. WIBTA?\n\nEdit: I’m referring SIL as close family friend because my family and her family have known each since elementary school days and thus are Very close lol. I thought this iteration would make the relationship sound stronger than just SIL, but it looks like I was wrong.\n\nSecond Edit: Wow this is on the front page, I never intended nor expected this blow up as it did! I’m sorry I can’t reply to everyone, but there will be some kind of update."
    },
    {
        "index": 660,
        "label": 1,
        "content": "Hello. My girlfriend, myself, my parents, and my brother and his wife all went on vacation in another country a week ago. My brother and I were the ones who did most of the planning of the itinerary although we did ask everyone else for input. For background, I make around $150,000k as an IT consultant, my girlfriend is a teacher making $45,000k. My parents are pretty affluent as well as my brother and sister in law.\n\nMy girlfriend knew this trip was coming up and took on a second job waitressing on the weekends for several months to get ready for it. We have always split things 50/50 in the 2 years we have been together. There were a few times on the vacation when she did not go on outings with us- wine tasting/scuba diving/etc. She also would only eat 2 meals a day, simply stating that she was on a budget. My family does favor more high-end (\\*expensive\\*) places. My parents thought it was very strange that she only eats 2 meals a day although normally she eats 3. \n\nWhen we got home I asked her why she skipped out on several of the outings and only ate 2 meals a day- I mentioned how I heard her stomach growling one night and said I was concerned about her having an eating disorder. She got teary eyed and said that 3 meals a day wasn't fiscally feasible for her and neither were the outings that she chose not to go on (she went on 3 of 6 outings). She said she was not expecting everything to cost so much and she was overwhelmed. \n\nShe also said she doesn't know if this is going to work long term if she is expected to go on vacations like that with people who make so much more than her. I feel bad that I did not pick up on her discomfort sooner. But we did agree to split everything 50/50 and I don't know why she agreed to come if the cost was an issue."
    },
    {
        "index": 605,
        "label": 1,
        "content": "My daughter (14) had anxiety problems ever since she was little but it was not severe. 3 months ago, my daughter changed drastically. She stopped eating, talking to us or her friends and her marks dropped. We were really concerned and her teachers strongly suggested we take her to therapy which we did and she was diagnosed with severe depression and social anxiety which was expected.\n\nThe therapy sessions look like they helped her well, in the first month she already began making progress and started talking to us and her friends again and is eating whatever her mother is cooking. We were really happy to see this and every day she would get better and better. The thing is, her marks did not. They are terrible and she ended up barely passing the year. This is what infuriated me and made me cancel her therapy sessions. I know to some it might sound terrible, but paying $120 per session and seeing no progress in her marks makes me feel like I am seriously wasting my money (now that she returned back to normal). Not only that but since she really enjoys going to therapy I think telling her that she needs to get higher marks to continue her therapy sessions will motivate her to study harder and thus score better marks.\n\nMy wife disagrees with my logic and we had a massive argument because of it which ended up with her saying that she is going to pay from ‘her money’ which hurt me since I see my and her money as ours. My daughter is also really upset on me and was begging me to keep her therapy sessions but I think I am going to stick to this plan. AITA here?\n\nEDIT: I deeply apologize for my ignorant replies and for hurting so many people. Please know that I had no intention in offending anyone and it was so upsetting to see how mental illness has affected many of you. I hope you guys can overcome this one day. I have talked to my wife and her therapy sessions will continue."
    },
    {
        "index": 180,
        "label": 1,
        "content": "I’m 26 and clean from heroin for 3 years. \n\nI was also a piece of shit and used to deal for a while. \n\nI managed to get with a beautiful girl named Marcy when I first started getting into the thick of things. She knew who I was but she said she loved me. \n\nI will regret this for the rest of my life, but I was the person who shot up Marcy for the first time. After that, there was no stopping her. She stuck around with me, probably because I was her dealer more than anything, but then I got clean and never saw her again for a long time. \n\nA year ago she reached out to me on Facebook and told me that she had been clean for a few months and she said that she didn’t hate me for what happened and she hoped I was still clean. \n\nLast week I got a call from my sister who told me that she saw on Facebook that Marcy had OD’d and there was a funeral service this upcoming Thursday.\n\nI immediately just burst into tears because I hoped that this would never happen and I feel so much guilt over it. \n\nI want to go to the funeral service for her but I’m afraid that my presence would be unwanted. At the most I would just slip in the back, pay my respects and leave. I need to do this for myself. \n\nAITA for wanting to go?"
    },
    {
        "index": 404,
        "label": 1,
        "content": "Last week, I was using my sister Ashley’s phone because mine was dead and I needed to call a friend to confirm plans. Dialing my friend’s number, I saw a tinder notification of some dude messaging her. Immediately, I asked why she’s on tinder (she’s 17) and she grabbed her phone back and said “none of your business” \n\nI decided that I wanted to have a little fun with this. I wanted to give her the benefit of the doubt (maybe she’s just swiping for fun?) so I didn’t want to go straight to ratting her to our parents. To test if she was just using for fun, I decided I was going to make a tinder profile (of someone else) and message her and see if she responds. I asked a good friend from back in college (who happens to be a male model) Kevin if he’d mind if I used his pictures and explained the situation. He thought it would be hilarious and told me to go for it. \n\nI created the account, set my age to 22, set my swipe radius to a mile, and quickly found my sister’s account. Her age was set to 19 (lie, she’s still in **high school**) so I was definitely more suspicious of her now. I superliked and less than an hour later, she matched AND messaged me. \n\nI decided to set up a date to a fancy restaurant downtown for Sunday afternoon and told her we could “head to my place afterwards”. She was completely receptive and said she’d meet me there. She told our parents she was hanging out with one of her track friends and spending the night at her place. \n\nAfter she left, I told our parents EVERYTHING and showed them all of the messages. They were pissed, and I suggested we all go to the restaurant. My dad and I just went instead and saw her sitting at a table alone all dolled up waiting for “Jim”. My dad went up to her and said “Jim’s not coming” and she screamed and asked what we were doing there. I told her that there was no Jim and that it was fucking stupid of her to be trying to meet grown men on tinder at her age. My dad harped on to that and lectured her on lying and meeting strange men on the Internet, and being so willing to go back to a *stranger’s* place. We were a bit loud so people were starting to look at us and my sister eventually bursted into tears and ran out. \n\nI told my friends in a groupchat the situation and they all agreed it was hysterical, except 2 of my female friends who said I was a “fucking dick” and “cruel” to her. My other friends defended me and said she needed to be taught a lesson. Wondering who’s right and if I went too far?\n\nEDIT: Yes, when I asked if she wants to go to my place afterwards, it was heavily implied that she would’ve had sex with Jim. That’s why I went the extent that I did.\n\nAlright after reading all these judgments, I came to the conclusion that I’m TA. But I’m TA she needed. If anything, she knows not to be a complete moron when finding people to hook-up with on tinder. \n\nAnd to the people who said she’ll never speak to me again, we just finished playing fifa for the last hour so ¯\\\\\\_(ツ)_/¯"
    },
    {
        "index": 875,
        "label": 1,
        "content": "Throwaway account.  We were at a local restaurant last Saturday evening. This is a locally owned establishment, not a chain. There was a 30-45 minute wait for tables.  There was another family waiting in the wait area, and the \"mom\" went to the bar and came back with three drinks. A beer for \"dad\" and a margarita for her and one of the young women. There was another young woman there who looked of college age, and had on a college sorority t-shirt, but no drink was brought for her.\n\nBut as I watched I noticed that the mom was sharing her margarita with the 4th girl, who I assumed was under 21 as she had no drink of her own. In fact, I'd guess the 4th girl consumed MOST of the mom's margarita. I mentioned this to my husband and he said so what, forget it. Full disclosure that I'm a non drinker myself and certainly don't approve of underage drinking, not to mention that this behavior might put the restaurant at risk. So I mentioned it to the hostess. A short time later a manager (I assume) came and asked to see the girls' ID's. The girl with her own drink produced one. The second girl who had been drinking from Mom's drink did not.  I did not hear the exchange, but the family left thereafter. I assume they were asked to do so. \n\nMy husband said that it was a crappy thing for me to do. I feel like I was protecting the restaurant. Was I the Asshole?"
    },
    {
        "index": 457,
        "label": 1,
        "content": "I'm a 31 year old single guy who lives alone in an apartment complex. I've lived there for 6 years. My neighbor across the hall, a woman around my age or a little younger (I actually don't know her first name but I'll call her Katie) lives across the hall from me diagonally and has for about 2 years. We exchange hellos but aren't friendly, which is how it is with most of my neighbors.\n\nSo I don't know how to cook, and due to losing one of my part time gigs, I don't have as much money for takeout anymore. I'm getting really sick of eating cheap fast food or box mac and cheese. I'm gaining weight and I never feel great.\n\nThis is where Katie comes in. I can always smell her cooking in the hall and it always smells amazing (I know it isn't the other person at our end of our hall cause it's a single old man). I've even complimented it a few times. So I got the idea that I'd offer to give her some money each week to cook a little extra and bring it over to me (or I can pick it up from her!) at night. She's cooking anyway and then I'd have varied presumably delicious food.\n\nI asked her the next time I saw her and she looked surprised and said she couldn't because she was too busy (which didn't make sense cause she cooks almost every day but okay). The next time I saw her a few days later, I asked her if she was sure and upped the amount I was offering, and she said she was sure and that it was rude to ask me, and that she isn't a housekeeper for hire and I should get a housekeeper if that's what I want. She also called me 'a stranger' even though we have talked in the halls before.\n\nOverall she made me feel like a big jerk and really embarrassed for even asking her, and a little mad because she was acting like I was being creepy (I wasn't, trust me, she isn't my type). I think asking her to split cooking wasn't completely outlandish, since she cooks every day anyway and it wouldn't be hard to make a little more.\n\nSo, AITA?\n\nEDIT: People keep assuming I'm sexist because I didn't think it was the old man who lives on our hall cooking. It's not an assumption for me. He and I have lived across from each other for 6 years. The cooking smells didn't start til she moved in, and I've talked to her about how good her cooking smells before.\n\nEDIT: Okay. It is abundantly clear that I was the asshole and asking her was inappropriate and, as much as I hate to admit it, creepy. My instinct is to apologize to her but since my instinct was to ask her in the first place, I'll do the opposite and stay out of her hair. Thanks."
    },
    {
        "index": 467,
        "label": 1,
        "content": "Just for context, I am 6'2 and my wife is 4'11. She is insecure about her height and while I try my best to tell her that she is stupendously beautiful the way she is, she got bullied about it pretty bad and it's just an aspect she doesn't like about herself.\n\nWith this in mind, we recently went to one of my favorite places to eat. Now, this restaurant has a really large counter and my wife is petite, so the cashier couldn't really see her. \nWe ordered our food, and were heading out when the cashier held out a giant piece of candy and said 'for your lovely daughter' to me.\n\nI honestly couldn't help but burst out laughing to the point that I had tears in my eyes and I had to compose myself before driving back home. \n\nMy wife was obviously pretty pissed. AITA?"
    },
    {
        "index": 818,
        "label": 1,
        "content": "Lots and lots of ugly background here but I'll try not to wander. My wife I have been separated for 2 years, ink to paper on an ugly and contentious divorce in May. I have primary custody of our two kids (daughter 17 and son 14) and live in the home which we've owned for 20 years. \n\nOn Monday I came home to find my son and two of his friends up on the roof to our little sun deck. I asked him what he was doing and if he was being safe. They said they were playing army and since I've coached the other two kids in mountain biking for almost 6 years now, I knew their parents wouldn't mind either. So I told him to put the ladder away when he was done and to keep his phone on in case I needed him to come down. I was actually most perturbed because he didn't put the ladder away. So they did this every day this week until Thursday when my daughter came home from her CIT job and in her every so sweet and acerbic tone asked me if I was really so stupid to think my son and friends were playing Army and let me know that the real reason is that our 22 year old neighbor was in her back yard topless and Aiden had set up a perch on the sun deck to get a better view. I climbed up thinking that she was just trying to get him in trouble but sure enough, the deck had  perfect view of the chaise lounge where I assume the girl had usually sat. I told my son to knock it off and he said he would. \n\nThis morning I got an angry knock on the door and it was my ex wife and the neighbor (they have been friends for many years) apparently the neighbor called my wife sometime mid week and they had agreed they would \"confront\" me and my son Saturday morning. We sat down and it went from a calm \"this is something we're concerned about\" to accusations of me being an irresponsible absentee parent and my son leading an \"adolescent sex ring\" in a matter of seconds. I tried to remain calm and explain that they are just acting like 14 year old boys and I've gotten them to stop. My wife asked if I planned on punishing him, I said that I don't feel like he did anything punishment worthy and rather this was a learning experience about respecting peoples privacy. My neighbor said that if he were her son he'd be in intensive psycho therapy and medicated. I told her that was really overkill. My wife told me not to talk to her friend like that and I asked them to leave before it got any more nuts. My wife has texted me that I am being incredibly irresponsible and if I don't do \"something\" she's going to her lawyer to revisit the custody arrangement. In all of that she called me an asshole several times and said it was more miserable being divorced from me than it was to be married to me. yay weekend! \n\nI guess that's about it...but am I the asshole for how I'm handling the issue with my son?"
    },
    {
        "index": 756,
        "label": 1,
        "content": "I want to start off by saying I love my girlfriend and I’m scared that if I give her this rule or expectation it will make her feel unwelcome at my home. We have been dating for awhile now and she’s always been courteous in asking to eat or use my stuff, she doesn’t eat much so I always gave her the okay. After she had spent a week at my place I told her she doesn’t have to ask me to eat my food on day 3 since she would always ask before she ate, she doesn’t eat much since she’s smaller but I didn’t take into account that a handful of granola, a bowl of yogurt, and a banana every day would stack up after awhile. She left my place after the stay and now every time she comes and stays for a period of time she eats my food. I feel bad for wanting her to start buying her own groceries to keep at my place since she consistently takes me out for food, buys me clothes, contributes to groceries when we cook, and keeps my weed supply full. I can’t comfortably afford to be feeding one and a half me’s so often though since she’s here at minimum 2 days a week. She has brought up in the past the fact that she feels I don’t take her out enough but we have a quiet understanding that she makes more than me since she works 5-6 days a week and I work 3 (not by my choice). I feel like she contributes a lot monetarily to the relationship and in terms makes her feel like she contributes more emotionally in the relationship because she’s always making sure I’m taken care of and comfortable. I don’t know if I should just suck it up because she’s not taking much from me and if I’d be wrong or an asshole to expect someone who gives so much to give me more. WIBTA?\n\nEdit: wow. I think making this post was one of the single most worst decisions of my life. My gf uses reddit and by sheer coincidence found this post, thought “haha this reminds me of me and JoyceManner!”, saw my username, made the connection, and broke up with me. All within 20 minutes of making this post! She thought there was underlying issues in our relationship and me being a cheap asshole was the last straw that broke the camel’s back.\n\nEdit2: to answer some repeated questions: I made this as a throwaway account. The account name is based off a pretty popular band (Joyce Manor) I like so, I didn’t think she would realize it was me. I’m 26 and she’s 20. Her name is not Joyce. I don’t think she’ll come on here to give her side of the story.\n\nTl;dr: I am the asshole."
    }
]