[{"title": "AITA after cutting my sister off after she was having suicidal ideations?", "content": "[removed]", "verdict": null, "score": 1.0, "created": 1632119309.0, "author_fullname": "Valuable_Security_98", "url": "https://www.reddit.com/r/AmItheAsshole/comments/prp4p9/aita_after_cutting_my_sister_off_after_she_was/"}, {"title": "AITA for pranking a girl and likely getting her suspended?", "content": "There’s a girl (17F) in my class who’s very uptight and annoying. She’s a teacher’s pet and a lover of rules, and no one likes her in our class. \n\nI’ve cheated on tests in the past like most people, and I know she’s suspicious of me cheating, even though what I do isn’t her business at all. She said to me the other day that she knows I cheat and will report me. Frankly, I think it’s hilarious she thinks she can tell me what to do or control my actions in any way, so my best friend and I decided to prank her.\n\nThe girl was sitting in the library at lunch where she always sits, probably since no one ever wants to sit with her in the lunch room. My friend had a test to make up from when she was absent and the teacher gave it to her to go take in the library. My friend and I sat at the table next to the girl, and I pretended to write down all her answers while she took the test. I kept asking her for the answers and writing things like I was cheating.\n\nLike we thought, the girl fell for it and decided to butt into our business. She reported us to the teacher. I had already taken the test, and my teacher could clearly see my friend and I put different answers for things. So she knew we didn’t cheat and asked why the girl was saying this. I said that the girl has threatened me before that she will report me for cheating (which is completely true) and that I think she just likes to bully us and threaten us. My teacher said she’s going to take action in accordance with the bullying handbook.\n\nSince there was proof we didn’t cheat, the girl will probably be suspended for threatening and bullying, since that’s the zero-tolerance policy in the bullying handbook. Our other friend knows what happened and is upset we purposely did this.", "verdict": null, "score": 1.0, "created": 1632119452.0, "author_fullname": "mauelekuu", "url": "https://www.reddit.com/r/AmItheAsshole/comments/prp5s6/aita_for_pranking_a_girl_and_likely_getting_her/"}, {"title": "AITA for saying my mom’s opinion about me doesn’t matter?", "content": " \n\nYesterday I(21f) got a new haircut. I really love it and it makes me look really cute. When I got home, my mom said “what the fuck have you done with your hair? You don’t look good at all”. I ignored her. I went to my room. I showed my hair to my siblings(18f and 12m) and they loved it. My mom again came to our room and said, \"You look like a monkey. This hair doesn’t suit you at all. You look like a crazy woman.” She was nagging and nagging. Even my sister got annoyed and said, \"it's just her hair, what’s the big deal?” She didn’t stop. I then said, “I  absolutely love it and what you think doesn’t matter to me in the slightest. I don’t care. It’s my hair and I will do it as I will. Your opinion means nothing to me” She went on saying,” Of course. Who am I to you? Do what you wish.” (in an emotional way, being she is my mother) And she hasn't talked to me since. I am not really dying to talk to her. And this morning my father came to my room and said, \"What is wrong with your hair? You have got too much freedom. You are out of control”.\n\nThe haircut I got is just bangs and layers. That’s it. \n\nI said what I said because whatever I do is always an issue to my mom. The last time I got my hair dyed, she yelled at me saying, “you have got too much freedom. Who told you to get your hair dyed and who gave you money?” I kept silent at the time. I never ask my parents for money. I buy dresses for myself. They pay for my studies. That’s it. And trust me when I say this, I have studied through scholarships for most of my life. They are paying almost 4000$ for my undergrad. I even buy my siblings lunch almost everyday when my parents go to work without giving them pocket money. I always buy dresses for my sister. I help mom with dishes. In fact, I do all the dishes, every time. It’s not that I am sitting here on my ass all the time. \n\nBefore someone says, move out or you live with your parents and all that, let me tell you. Moving out from your parents’ house is not a norm here. If anything, it is considered as abandoning your parents and you will be called a “rebel”. Since I am a female, the only time I am allowed to move out from here is when I get married or if I go abroad to study. I plan on doing the latter. And I am also searching for a job right now.", "verdict": "Not the A-hole", "score": 1.0, "created": 1632119648.0, "author_fullname": "TThr0owawayy", "url": "https://www.reddit.com/r/AmItheAsshole/comments/prp796/aita_for_saying_my_moms_opinion_about_me_doesnt/"}, {"title": "AITA for telling my sister I can’t talk to her anymore until she decides to get help?", "content": "I’m 27f and my sister is 29f alcoholic/major depressive. She called me a few nights ago at 2am and was really down. Earlier in the day I had contacted her and asked her if she needed to come over, which she declined. Another thing that really annoys me is she is always calling between 2-4am even when I told her I have work and I get up at 5am and not to call me so late (she has never respected this boundary). On this night I snapped and I told her I was very worried for her and that she desperately needed to get help bc I didn’t want to bury my sister. She cut me off and said she was going to bed. \n\n\nShe lives with my mom and apparently my mom woke up in the night and my sister said that talking to me pushed her over the edge. And she has spent 3 days crying and in a “worse” place now that I told her and my mom that I need to distance myself for a while, or until she decides to get help, because it’s emotionally taxing on me (who also has my own mental health to deal with). My mom and both my sisters (the oldest is 33) are saying I’m abandoning her at her lowest. \n\n\nMy sister (29) has been an alcoholic for 15yrs and always been in the same place. I’ve been there for her and protected her how I can for as long as I remember. I feel insulted that they think I’m “abandoning” her. \n\n\nMy mom is an extreme enabler and her and my sister (29) have a severely codependent relationship, and I don’t see anything changing. My other sister (33) has her own family and told me I need to just listen and accept thats how things are and will be. I know myself and I don’t think I’ll ever reach that level of complacency and will always try to help bc of how dire her situation is. She needs to be in a hospital or rehab or something, and not voluntarily. Maybe I’m being immature idk. But it’s been the hardest thing to watch her continue to destroy herself, never seek help, and so on. \n\n\nMy mom told me it’s making my sisters (29) depression worse and I told her that mine was important too. \n\nAITA?", "verdict": null, "score": 1.0, "created": 1632119662.0, "author_fullname": "Valuable_Security_98", "url": "https://www.reddit.com/r/AmItheAsshole/comments/prp7cz/aita_for_telling_my_sister_i_cant_talk_to_her/"}, {"title": "AITAH for releasing an archagent of eternal suffrage upon a small peasant village due to them not relaying to me their gold?", "content": "[removed]", "verdict": null, "score": 1.0, "created": 1632119743.0, "author_fullname": "slayerwillbeinstrive", "url": "https://www.reddit.com/r/AmItheAsshole/comments/prp7x6/aitah_for_releasing_an_archagent_of_eternal/"}, {"title": "AITA for accusing my “girlfriend” of cheating?", "content": "I (21M) has been exclusive with my “gf” (21F) for a month. One day her and a couple of her friends (which was celebrating one of their birthday) went to eat lunch. It was her, her friend, A (23F), her friend’s bf, S (23M), and one of their friend, M (26M). She had posted on her story of them hanging out, but one post stood out to me. It was a picture of her and M with a filter on it that read babe w hearts on their face. I couldn’t help, but feel strangely since I think it gives off the wrong impression. I had asked her about, but she reassured me that it didn’t mean anything. Later that day, I was waiting on them to tell me when and where we were going to eat for the birthday dinner. I had texted and called my “gf” multiple times to ask her, but I could not get a hold of her. I was feeling a lil uneasy about it, since this was a first for me. I called her friend, A, to ask about the dinner plan and asked where my “gf” was. She told me “she had went home earlier” and that made me very confused. Now I’m overthinking about the post, and how my calls and text are being dodged, and now I’m told that she’s been at home. I couldn’t help but think of the worst thing possible. I automatically assumed that she had cheated on me with M, and had planned to leave her.\n\n-turns out she was at home getting ready for the dinner and she told me she didn’t have time to look at her phone\n\nAITA?", "verdict": null, "score": 1.0, "created": 1632119896.0, "author_fullname": "Bubbly_Abies8129", "url": "https://www.reddit.com/r/AmItheAsshole/comments/prp90c/aita_for_accusing_my_girlfriend_of_cheating/"}, {"title": "AITA for asking a girl what happened to her boobs", "content": "Im 28M shes 25F\n\nIve been seeing this girl recently and we have been on 4 really good dates until now. She asked me to head back to her place on the 5th date. I did go. She went to her bathroom and came out naked, but well, i saw that well her chest was almost flat. \n\nI was really surprised and so i asked her what had happened to her chest. She said that she stuffed her bra, she asked me why I asked her and i said it was weird for me. She got angry and called me an asshole. I just didnt know what to do. That made me lose a lot of attraction to her\n\nI have certain physical standards for women I date,  They should have at least B cups, I do not date blondes, only date brunettes, should have thin lips and they should not have an hourglass figure bc i find that unattractive. \n\nShe said I was being a jerk and asked me to leave. I'm not going to tell my friends about this bc im too embarrased,  so im on reddit\n\nAITA?", "verdict": null, "score": 1.0, "created": 1632119998.0, "author_fullname": "throwRAfakeboobs", "url": "https://www.reddit.com/r/AmItheAsshole/comments/prp9rc/aita_for_asking_a_girl_what_happened_to_her_boobs/"}, {"title": "AITA for telling my wife that I think it was wrong for her brother to buy a diamond ring and propose to his girlfriend two weeks after we donated and fundraised to help him after he lost his home to a fire?", "content": "My BIL has lived with his girlfriend for almost two years. He has been through terrible tragedy before, losing his previous serious girlfriend about 5 years ago. He unfortunately recently went through another horrible tragedy, losing his home to a forest fire. Him and his girlfriend are safe. They were able to evacuate, get out almost all of their belongings and help neighbors evacuate too. I cannot imagine how bad it would feel to experience the amount of loss that he has. Luckily, he has a place to live temporarily through friends and a great support system.\n\nMy FIL set up a gofundme, with my BIL approving it and advertising it. The goal was to help raise money for what was lost, what may not be covered under insurance and to help them get by in the meantime. I happily donated a generous amount, and I spread the word to my friends and family. I wanted to help, and I figured even every little bit would be helpful. Many of my family members donated generous amounts as well. The gofundme was successful in fundraising a solid amount of money, and I was grateful.\n\nA week or two later, he proposed to his girlfriend. They had been together long enough and are a good match. Everyone is happy that there is some positive news for them after such an awful situation. I am happy for them too.\n\nHowever, he proposed with a decently-sized diamond ring. I learned that he bought the ring after all the fundraising. He did not have the ring before the fire. The fire was the catalyst for the proposal. I told my wife that it felt wrong that he bought an expensive ring after asking for and accepting donations. I feel that the money was given to help him rebuild and get by in other ways. Of course it is his money to do what he wants with it, and this is rising from the ashes in just a different way than what I was intending to contribute.\n\nMy wife argues that he was planning on proposing before, and that he had the money for the ring already. I want to give him the benefit of the doubt and say this is true. However, if he had enough money for an expensive ring, then he didn’t truly need a gofundme. In my opinion, he should have gotten her a more affordable ring considering the circumstances. \n\nMy wife sees nothing wrong with the situation, and she said she couldn’t believe that I thought her brother was such a horrible person and would do such a thing. I don’t, and I feel sorry for what he has been through. I’m happy that he has some good news. The timeline of events with the fundraising just leaves a bad taste in my mouth, and I feel taken advantage of, in a way. I also feel bad for encouraging my friends and family to help. The expensive purchase doesn’t feel right, and I feel used. AITA?", "verdict": null, "score": 1.0, "created": 1632120035.0, "author_fullname": "theperk", "url": "https://www.reddit.com/r/AmItheAsshole/comments/prpa25/aita_for_telling_my_wife_that_i_think_it_was/"}, {"title": "AITA for asking a girl what happened to her boobs", "content": " \n\nIm 28M shes 25F.\n\nIve been seeing this girl recently and we have been on 4 really good dates until now. She asked me to head back to her place on the 5th date. I did go. She went to her bathroom and came out naked, but well, i saw that well her chest was almost flat.\n\nI was really surprised and so i asked her what had happened to her chest. She said that she stuffed her bra, she asked me why I asked her and i said it was weird for me. She got angry and called me an asshole. I just didnt know what to do. That made me lose a lot of attraction to her\n\nI have certain physical standards for women I date, They should have at least B cups, I do not date blondes, only date brunettes, should have thin lips and they should not have an hourglass figure bc i find that unattractive.\n\nShe said I was being a jerk and asked me to leave. I'm not going to tell my friends about this bc im too embarrased, so im on reddit\n\nAITA?", "verdict": null, "score": 1.0, "created": 1632120100.0, "author_fullname": "throwRAfakeboobs", "url": "https://www.reddit.com/r/AmItheAsshole/comments/prpaie/aita_for_asking_a_girl_what_happened_to_her_boobs/"}, {"title": "AITA for leaving my family to live with my girlfriend and not wanting to pay rent to my brother?", "content": "Idk if this post will even be well suited for this subreddit but I think this is the closest thing I could think of.\n\nSo a bit of back story, I’ve been living with my brother for over 6 years and have been paying him rent for those six years one day I brought up the idea  of moving out to him and my brother was very against it and got into a huge argument with me about it, my main reasonings were that I wanted to be with my girlfriend and I’m the only one that does chores around the house but I told him I appreciate that he let me be with him for so long but I would like to go try things on my own. months go by and my girlfriends lease is ending so we go looking for apartments and eventually find one she like we do several meetings with the apartment managers and I decide to add my name to the lease I tell my brother about what I did and another argument occurred he brings my dad and step mom along to get me to cancel the lease agreement I stood my ground and said no this disagreement went on for hours and my family calling me a idiot and saying I’m only doing this for sex and they got into some personal and private stuff claiming they are trying to help me not hurt me. Weeks pass and I begin living with my girlfriend and we are happy together and the beginning of the new month I pay my first bill to the apartment and I receive a text from my brother stating that I need to pay rent to him too, I told I will pay because the leave was so sudden and then he got our dad involved again and forced me into a deal we’re I have to pay until he gets a new tenant I agree and continue on with my life. That was since January it’s about to be October and I’m still paying 2 rents and my girlfriend doesn’t know am I the asshole for wanting to stop wanting to pay  rent to my brother? He has taken care of me my whole life and we do get along once in a while and he is my only brother what do I do?", "verdict": null, "score": 1.0, "created": 1632120123.0, "author_fullname": "Destinmonkey", "url": "https://www.reddit.com/r/AmItheAsshole/comments/prpao7/aita_for_leaving_my_family_to_live_with_my/"}, {"title": "AITA for offering to take my younger nephew so my older nephew gets time with his parents?", "content": "My sister and her husband have two boys. James 7 and Luke 3. Last year Luke was diagnosed with diabetes and the household money has been spent on specialists for him, two hospital stays, and medications. It has also taken up their time and James has been feeling more and more displaced of late. He admitted to me and my brother that he resents Luke for taking his parents away from him so much and his life was better before he had a brother. So I suggested I could look after Luke overnight if they wanted to get some special time in with James. They said it wasn't needed. Then my sister asked why I offered. I told her I thought it would be nice for James to get some time since they've been busy lately. She told me he was doing fine and he doesn't need extra time. That they need to focus on being a family and she resents that I would suggest that by offering to take Luke. I told her James still might appreciate the time because this last year has been difficult for him too and the changes it brought to the family. She got even more mad so I left it alone. But there has been a chill there ever since.\n\nAITA?", "verdict": "Not the A-hole", "score": 1.0, "created": 1632120202.0, "author_fullname": "TomorrowDown", "url": "https://www.reddit.com/r/AmItheAsshole/comments/prpb92/aita_for_offering_to_take_my_younger_nephew_so_my/"}, {"title": "AITA for refusing to attend a friend's wedding because of something discriminatory she had said against our own race?", "content": "[removed]", "verdict": "Not the A-hole", "score": 1.0, "created": 1632120231.0, "author_fullname": "SoledadSoledad", "url": "https://www.reddit.com/r/AmItheAsshole/comments/prpbfv/aita_for_refusing_to_attend_a_friends_wedding/"}, {"title": "AITA for mom shaming my sister because she spent her kid's cash benefits to bail out her boyfriend?", "content": "My older sister- Marj 34F has 3 children, 6, 5 and 3. She receives cash benefits for them every month.  \n\nRecently she called me to borrow money to bail out her boyfriend (not the kid's dad) because he was arrested for possession of cocaine. I refused to loan her money because I know she has no source of income to pay me back.\n\nSo last Friday I found out that she was able to bail out her boyfriend because she posted a TikTok video. I messaged her and asked who loaned her bail money. She said she used her kid's money. I called her out for being irresponsible and a terrible mother. I reminded her that her kids have needs and if she can't take care of them then I'll call CPS on her. She blew up on me and called me an asshole for threatening her. I think it's my responsibility to look out for my niece and nephews especially with my sister living with a drug user. \n\nSo am I an asshole? Was I too harsh with my words?", "verdict": "Not the A-hole", "score": 1.0, "created": 1632120554.0, "author_fullname": "Bacon4BreakfastAgain", "url": "https://www.reddit.com/r/AmItheAsshole/comments/prpdth/aita_for_mom_shaming_my_sister_because_she_spent/"}, {"title": "AITA? This guy owes me a lot of money.", "content": "So I bought a house a few years ago... Theres a 50ish year old dude (im27) who I used to watch hockey and have beers with 5 or so years ago because we were neighbours.. so when I buy my house I am looking for a friend or 2 to rent rooms and help pay the mtg (not because i need them to, but because there is room and i want to make early payments) So myself, my SO, and my other friend decide even though this dude is older we will let him rent a room...\n\nThings start off okay... bills paid... whatever.. dude is obvs pretty bad with his money but always pays rent and any debts... till he doesnt... He gets around 1200$ in debt with late rent and borrowing 20 here or there.. He starts working for me and pays it off out of his paychecks.. then he goes to work for his family, and is making more than anyone in the house, good right!? He has a POS car his family gave him for free a decade ago... rust holes, engine light, over 400000 klm... and I have a nicer but also super cheap sport coupe that he wants bad... he offers to pay me 2k, plus his POS car for it... I agree on the condition that it stays in my name till its paid.. I proceed to put about 2k into his POS car... turning it into a reliable POS... He beats the living hell out of the little sport coupe and racks up 1000$ in speeding tickets on the car (with my plate so where i live i am responsible to pay) on top of this he racks up another 1200 in late rent and insurance and so on... so at this point he is 2200 in debt.\n\nHeres the kicker, now.. he decided to fuck right off and try ghosting me... hasnt been at the house in 2 months and ends call when i try to call him. thing is i know where he is, and I know where he parks the coupe (worth much less now than when he got it from me.. he had a fender bender or 2 and hasnt done any maintanance) \n\nAm I the asshole if I go repo this car? I feel a little bad because I have his old car still and I did a bunch of work to it... so this guy will no longer have any car... but he owes me more than it is worth, and its still in my name... his old car is in my name and worth a lot more than when i got it. Im also pretty sure he has a bunch of shit stored in the car while hes at his sons apt... \n\n\n\nTLDR- guy 2x my age rented a room from me and racked up 2200 in debt... The car he drives is in my name and only worth 1500 (assuming its not in even worse shape than i think) aita if i repo it and sell to pay off his debt? (he is ghosting me when i txt or call but i know where hes parking and where hes staying...)", "verdict": "Not the A-hole", "score": 1.0, "created": 1632120915.0, "author_fullname": "ta12342069", "url": "https://www.reddit.com/r/AmItheAsshole/comments/prpghb/aita_this_guy_owes_me_a_lot_of_money/"}, {"title": "AITA for not answering on chat apps?", "content": "I am in my own train of thoughts most of the time and I get really distracted by messages on whatsapp and co. It happens that I won't reply for weeks, but then do it totally accurate and friendly. If someone wants to meet me I can do it in a short time to make it happen, but when someone is telling me about holidays or some open topic I tend to leave the answer until I am in a mood to think about it. A lot people I like are starting to be mad at me and my behavior. \n\nI must add that I think text messages are not like real conversations. We are not in the same room or situation and we are not talking without delay. In a 1o1 or group irl I am totally there and aware of the people around me. Every time I meet those persons I tell them that I suck at texting and that my behavior is not meant to disrespect them, but it seems like they don't get it. Being available all the time through the internet is completely horrible for me. Everyone can text me bullsh*t at any time and awaits an answer in seconds like I am a robot just waiting for them. \n\nI've red somewhere 'no communication is communication aswell'. But if one chooses to text me, it seems that it is not that important and I don't need to answer asap. \n\nThe only option I have is to delete the applications, but then I am totally out of reach for old and new friends.\n\nSo AITA for not deleting the app but keep on not answering as I always did?", "verdict": null, "score": 1.0, "created": 1632120964.0, "author_fullname": "dieSau", "url": "https://www.reddit.com/r/AmItheAsshole/comments/prpgus/aita_for_not_answering_on_chat_apps/"}, {"title": "San Francisco - The City (New Video)", "content": "[removed]", "verdict": null, "score": 1.0, "created": 1632120999.0, "author_fullname": "BloePuzzleheaded", "url": "https://www.reddit.com/r/AmItheAsshole/comments/prph3b/san_francisco_the_city_new_video/"}, {"title": "Met a girl on Hinge. Feeling scammed and anxious. Any advice?", "content": "[removed]", "verdict": null, "score": 1.0, "created": 1632121026.0, "author_fullname": "Pretty-Site-7916", "url": "https://www.reddit.com/r/AmItheAsshole/comments/prpha4/met_a_girl_on_hinge_feeling_scammed_and_anxious/"}, {"title": "Am i the asshole for not inviting my in-laws to my birthday dinner?", "content": "[removed]", "verdict": null, "score": 1.0, "created": 1632121273.0, "author_fullname": "psyhco_goat", "url": "https://www.reddit.com/r/AmItheAsshole/comments/prpj93/am_i_the_asshole_for_not_inviting_my_inlaws_to_my/"}, {"title": "AITA for accidentally offending my wife when I said muckbang slurping sounds are disgusting?", "content": "My wife showed me a YouTube video of a “funny” Mukbang ASMR channel. She thought it was funny because it’s basically just a mouth with the nose done up to look like eyes and it has a whole character around it. The concept was goofy, no argument there. This particular video though had a lot of slurping sloshing sounds, which is actually something I find disgusting, not by choice, like it triggers a reaction in me when I hear it too much. Like fingernails on a chalkboard for some people. I shuttered when the sounds kept going in the video and then made an offhand comment about how the slurping sounds were disgusting and I don’t understand how people enjoy listening to it.\n\nShe suddenly got really offended when I said that since she watches a lot of these kind of videos and enjoys ASMR. I told her it was the sound that grossed me out not the people who enjoy watching / listening to it, but she just got more and more angry and says I’m judging her for liking it.\n\nNothing I say will calm her down. Am I the asshole for not being able to like this and for commenting offhand about it?", "verdict": "Not the A-hole", "score": 1.0, "created": 1632121360.0, "author_fullname": "ThrowerAwayOfAccount", "url": "https://www.reddit.com/r/AmItheAsshole/comments/prpjy1/aita_for_accidentally_offending_my_wife_when_i/"}, {"title": "Am i the asshole for not inviting my in-laws to my birthday dinner?", "content": "[removed]", "verdict": null, "score": 1.0, "created": 1632121371.0, "author_fullname": "psyhco_goat", "url": "https://www.reddit.com/r/AmItheAsshole/comments/prpk0z/am_i_the_asshole_for_not_inviting_my_inlaws_to_my/"}, {"title": "Relationship with dad/family", "content": "[removed]", "verdict": null, "score": 1.0, "created": 1632121439.0, "author_fullname": "aaaaaaaaafg", "url": "https://www.reddit.com/r/AmItheAsshole/comments/prpkj0/relationship_with_dadfamily/"}, {"title": "AITA For Unfriending my Suicidal Friend?", "content": "[removed]", "verdict": null, "score": 1.0, "created": 1632121461.0, "author_fullname": "yuh_get-it_i-guess", "url": "https://www.reddit.com/r/AmItheAsshole/comments/prpkp0/aita_for_unfriending_my_suicidal_friend/"}, {"title": "AITA am i the asshole for not inviting my in-laws to my birthday dinner?", "content": "Hey OP (15F) here, just wanted to let you know this story was told from the point of view of my mother, i'm not taking sides on this but i really need this stupid petty fight of theirs to end since its really tearing my brother up seeing his mum this distressed. So any advice would be greatly appreciated.\n\nIt was my (48F) Birthday a few days ago and i was celebrating with my husband (50M) and my two kids, the day started out great but that changed around 11AM that morning when my husband confronted me about dinner - some context, usually when someone in our family has a birthday both my parents and my husbands parents will come around that night for dinner, I had invited my parents but not my husbands parents for a few reasons, 1: we had just gotten out of a level 4 lock down where we are living and his parents would have to travel to come to the dinner which are PM is advising we don't do at the moment, 2: me and his parents have never really gotten along that well, we are civil with each other but they don't like me very much. 3: i just want a quiet evening with my parents my husband and children.\n\nSo my husband confronted me about not inviting his parents and i told him those reasons but he was still mad at me and just walked off without saying anything, my parents come around and while they're here hes acting fine with me but the moment they leave he's back to silence again. A day passes and he's still giving me the silent treatment so i ask him why he's still mad at me, and he say's hes not mad at me, obviously this upsets me and we start yelling, i'm yelling about how he's giving me the worst birthday ever and how i don't deserve his silent treatment, and he's yelling about how he's doing no such thing. He walks away mid argument and go to walk into my room just to turn around too see my kids standing there, the youngest (12M) crying for me, since me and his father don't fight like this.\n\nWe just ate dinner and i was met more silence from my husband and my kids trying to stop dinner from being so quiet and awkward. So reddit AITA for this fight? i don't really think it was such a big deal, as he hardly speaks to his parents anyways, - maybe a couple times a month at most - if it really was so big to him i don't know why he couldn't of just talked it out with me civilly.", "verdict": null, "score": 1.0, "created": 1632121462.0, "author_fullname": "psyhco_goat", "url": "https://www.reddit.com/r/AmItheAsshole/comments/prpkps/aita_am_i_the_asshole_for_not_inviting_my_inlaws/"}, {"title": "WIBTA if I kick my boyfriend out?", "content": "[removed]", "verdict": null, "score": 1.0, "created": 1632121569.0, "author_fullname": "Dangerous-Sun-9878", "url": "https://www.reddit.com/r/AmItheAsshole/comments/prplj4/wibta_if_i_kick_my_boyfriend_out/"}, {"title": "WIBTA for taking my for taking my sister to small claims court", "content": "So I'm considering taking my (M22) sister (F19) to court for damages since she destroyed my iPad pro by accidently stepping on it. We have talked about it and she said that she is not going to pay any more than 300 dollars for a repair. I have since taken it to the apple store to get see how much the repair would end up costing me and they quoted me 800 dollars and when bringing it up to my sister, who has been ignoring me and interrupts me at any mention of the subject, she yelled at me saying that there is no way that she's going to pay that much since she is saving up for a new car as she has crashed her most recent one. She has been looking for the cheapest repair places in our area and going as far as to say that she found a place over an hour away and told me that I'd have to drive there to see about doing the repair since she doesn't want to go. This severely affects me with my art career and she just doesn't seem to realize that.  So WIBTA?", "verdict": null, "score": 1.0, "created": 1632121676.0, "author_fullname": "PMMePicsOfDemTatas", "url": "https://www.reddit.com/r/AmItheAsshole/comments/prpmdl/wibta_for_taking_my_for_taking_my_sister_to_small/"}, {"title": "Sharing is caring? Script ownership", "content": "[removed]", "verdict": null, "score": 1.0, "created": 1632121701.0, "author_fullname": "stringpaperplane", "url": "https://www.reddit.com/r/AmItheAsshole/comments/prpmka/sharing_is_caring_script_ownership/"}, {"title": "AITA for falling asleep while talking on phone with a girl?", "content": "So I have been texting and talking to this girl for a few months. We have been on a couple of dates and couldn't meet more often because of Covid. Last night I fell asleep while on phone with her. She was telling me some story and I was listening and then all of sudden I wake up from the sound of phone disconnecting. I realized I fell asleep and then I messaged her and tried calling but she turned off her phone. In the morning after a few attempts and a long message she said she is angry because I fell asleep and started \"snoring\" while we were talking.\n\nNow I understand why she is angry and it is my fault for falling asleep and I have even apologized. However what is bugging me is how much angry she is and she wouldn't even say anything for a long time. Is falling asleep an asshole behavior? I try to be respectful but at the same time I don't want to be apologizing too much for something I consider a honest mistake. Or maybe it is a major issue for most people and I am just blind to it.\n\nWe both are 29 years old and I am a guy.", "verdict": "Not the A-hole", "score": 1.0, "created": 1632121771.0, "author_fullname": "texas_laramie", "url": "https://www.reddit.com/r/AmItheAsshole/comments/prpn4o/aita_for_falling_asleep_while_talking_on_phone/"}, {"title": "AITA for kicking out my vegan friend after she tried to force her food on us?", "content": "My (26F) little brother just had his 18th birthday. He is obsessed with Greece and their history and cuisine. We live in an area where there aren’t any Greek restaurants unless you drive far out of the way, so he’s never had Greek cuisine. But a brand-new Greek restaurant finally opened in our area.\n\nFor his birthday, we were going to take him there for dinner to get lamb kabobs and baklava. But then we thought it would be easier to have the food delivered to our house, where we could do presents and cake while waiting. My friend (27F), who is vegan, volunteered to pick up the lamb and baklava for us while we had the party. We gave her the money, and she went.\n\nShe came back without the Greek food, and she had instead used the money to buy us multiple jumbo salads from a vegan restaurant. I was furious. She ruined my brother’s birthday and disrespected all of us by tricking us. I kicked her out of the house and said not to come back until she apologizes to my brother for ruining his day.\n\nShe said I’m a bully and that she was only helping us all and making us better. I said if that’s better, I don’t want it. AITA?", "verdict": null, "score": 1.0, "created": 1632121907.0, "author_fullname": "albaraodn", "url": "https://www.reddit.com/r/AmItheAsshole/comments/prpo76/aita_for_kicking_out_my_vegan_friend_after_she/"}, {"title": "WIBTA if I confronted my siblings", "content": "[removed]", "verdict": null, "score": 1.0, "created": 1632122078.0, "author_fullname": "Delicious-Register-4", "url": "https://www.reddit.com/r/AmItheAsshole/comments/prppig/wibta_if_i_confronted_my_siblings/"}, {"title": "aita for being angry about homecoming plans?", "content": "[removed]", "verdict": null, "score": 1.0, "created": 1632122120.0, "author_fullname": "Mother-Ebb1096", "url": "https://www.reddit.com/r/AmItheAsshole/comments/prppve/aita_for_being_angry_about_homecoming_plans/"}, {"title": "WIBTA if I kick my bf out?", "content": "\nSo, my boyfriend (28m) and I (25f) have lived together for almost 2 years now. When we first lived together we were just friends/roommates. Currently we have a 5 month old and have been dating for 3 months. \n\n(There's a lot of drama in all that but it doesn't really feel relevant.)\n\nHe doesn't have his GED so his earning capacity is very limited. over the time he's lived here, he has not worked at all. I told him I couldn't handle everything alone back when I was pregnant with it 1st, so I feel a bit of bitterness about that. \n\nI've become a camgirl to be able to afford to survive, because I'm at severe risks regarding covid and can't work out of the home, and while initially I did it for the money we needed, I have since discovered I actually have fun with it, so I don't think that is something to hold against him. Though I will admit I can't say I'll keep doing it once I'm back to work. Found a good job that'll start next month.\n\nI've almost kicked him out at the encouragement of my friends 3 times, but I love him and if I kicked him out he'd be homeless and destitute so I always cave and let him stay. He's been promising for months to get a job, at the very least to keep up with his responsibility as the homemaker. Neither has happened. I found him a job in a warehouse where he could make more than double what fast food would offer (not having a GED limits him severely so fast food and some warehouse work is all he's qualified for) but he failed the drug screen. They said he can retest and when he's clean he can start work but he hasn't stopped smoking yet. There's always another reason or someone giving him bud for free. He goes \"you can't get mad because it's free\"...\n\nHis connection to bud is a beast all its own so idk if it would be considered relevant or not? \nBut I get annoyed with the situation a lot lately, especially since we found out 2 weeks ago that I'm pregnant again. He's given our son ONE bath since he was born. \n\n It isn't uncommon to hear \"come on man go to sleep\" at night after he's let the baby nap all day or \"there is literally nothing wrong with you\" when the baby wakes up while he's trying to play his Xbox (which is most of his time. He'll wake up while I'm watching TV, go to the bathroom, come back and turn Hulu off to play fallout.)\n\nThe last time I told him to leave, he told me he didn't want to lose our family and we both cried and decided to try again. At this point, I want to try to work with him, I don't want to be just another person who gave up on him. \n\nWIBTA if I took myself and our son to my friends house and gave him a deadline to leave by? I'd be staying at my friend's till he was gone. The reason I'd do it that way, for anyone curious, is because I can not tell this man no (I have severe anxiety and a bad people pleasing habit), so I'd be telling him he needs to go then shutting off my phone so he can't get me to change my mind.", "verdict": "Not the A-hole", "score": 1.0, "created": 1632122267.0, "author_fullname": "Dangerous-Sun-9878", "url": "https://www.reddit.com/r/AmItheAsshole/comments/prpqz5/wibta_if_i_kick_my_bf_out/"}, {"title": "aita for being mad about homecoming plans?", "content": "[removed]", "verdict": null, "score": 1.0, "created": 1632122271.0, "author_fullname": "Mother-Ebb1096", "url": "https://www.reddit.com/r/AmItheAsshole/comments/prpr0e/aita_for_being_mad_about_homecoming_plans/"}, {"title": "AITA for scolding a colleague who grabbed a disproportionate share of the platter? I told him his parents must not have taught him manners.", "content": "My colleague and I work are assigned to the same group at work. Our manager bought us a platter of tortilla chips with a few toppings for us to try. My colleague then grabbed a lot off the platter, leaving not much for others to share. I then scolded him and asked him why his parents did not teach him proper manners. He then stated that he grabbed a lot after seeing me grab a lot as well.", "verdict": "Everyone Sucks", "score": 1.0, "created": 1632122309.0, "author_fullname": "the_siloviki", "url": "https://www.reddit.com/r/AmItheAsshole/comments/prpraq/aita_for_scolding_a_colleague_who_grabbed_a/"}, {"title": "AITA for telling my friend they brought cockroaches to my house?", "content": "[removed]", "verdict": null, "score": 1.0, "created": 1632122369.0, "author_fullname": "IamGar-bage", "url": "https://www.reddit.com/r/AmItheAsshole/comments/prprti/aita_for_telling_my_friend_they_brought/"}, {"title": "AITA for making McDonald's busy right before my friend clocks out", "content": "I work the graveyard shift and I didn't have enough time to pack my meal before I left for work. My friend works at a McDonald's that I pass by before work.\nI started passing by and noticed they were empty. I knew my order was going to be big so I went in and ordered 6 quarter pounders (eat throughout the night. Not all at 1 time). I eat 1 on the way and knew I was eat another on my way home.\nMy friend complains in the group chat asking why someone needed to order 6 quarter pounders. I mentioned that was me and why.\nHe apparently didn't read that until a few hours later and called me an asshole for doing so. Apparently me going there started attracted more people and he ended up staying a little longer.", "verdict": "Not the A-hole", "score": 1.0, "created": 1632122473.0, "author_fullname": "Fitraness1234", "url": "https://www.reddit.com/r/AmItheAsshole/comments/prpsm7/aita_for_making_mcdonalds_busy_right_before_my/"}, {"title": "Relationship with father/family", "content": "[removed]", "verdict": null, "score": 1.0, "created": 1632122533.0, "author_fullname": "aaaaaaaaafg", "url": "https://www.reddit.com/r/AmItheAsshole/comments/prpt28/relationship_with_fatherfamily/"}, {"title": "WIBTA for confronting my siblings?", "content": "I (30f) have been married to D(30m) for 10 years and have been together with D for 15. Two years ago we moved from the States to Germany for his work because it was a good next step for his career. \n\nWell, Older sibling S(32NB) and younger sister R(19f) and I started chatting and playing games with our significant others every weekend during late evening hours my time and midday for them. This started to change lately because I don't hear from S except for late Sunday night lately and from R unless she needs something. They get together with each other on weekdays and weekends on our mutual discord server and I'm feeling very left out lately because they don't even spare me a greeting at all or will tag me after I've already gone to bed on Sunday. \n\nWell it's been months since I've talked to them extendedly and S always seems to make other plans every weekend lately. R doesn't reach out first ever and I'm frankly getting tired of being the only one getting left out. WIBTA if I confronted them about wanting them to at least message me first once in a while or make time once in a while to play games and chat like we used to? My siblings and their significant others still do our thing even now but much later like 1 am my time Sunday. I'm terrified of sounding like an entitled b\\* so would I be wrong to ask them to include me again?", "verdict": "Not the A-hole", "score": 1.0, "created": 1632122551.0, "author_fullname": "Delicious-Register-4", "url": "https://www.reddit.com/r/AmItheAsshole/comments/prpt66/wibta_for_confronting_my_siblings/"}, {"title": "AITA relationship with father", "content": "\nThe beginning takes place during and right after hs. They were huge sticklers on chores and such, and so when I didn't do the dishes or whatever else they had me doing they would go ballistic. It once hit the point where I had just come home, and my father asked me to do the dishes, and I told him, \"okay, just give me a minute\"\n\nHe didn't like that, and told me to do them now, so we argued back and forth a little bit and I reluctantly agreed. While I was in the kitchen a couple minutes afterwards, he asked me to grab him a drink. As I'm walking towards him with the drink, he asks me to grab his pants off the floor because they have his wallet in them. I said to him, okay, let me hand you this drink first. He REALLY didn't like that. He literally blew up at me, calling me a fucking idiot and asking why the fuck I don't just do shit the way he tells me, to which I obviously argue, but upon realizing how angry I am and how angry he is, I walk out of the house to cool off. He then proceeds to text me and say \"come home or I lock the doors on you.\". I walk in, and still seething, I look at him and say, \"I'm gonna beat your ass\", hit him 2 times in the arm and sit down in the chair and start bawling. \n\nTo my defense, them treating me like this was a daily routine. I had a stepmother who treated me even worse at the time and literally hated my existence, and at present day acknowledges she treated me like garbage. \n\nBut my father's response was to call the police while I'm crying my eyes out and send me to jail. He pressed charges, I spent 6 days in jail and plead guilty. I got released, all a month after I turned 18. I basically moved out for a short time span with someone I met on Facebook market place, and maybe a year later I had some issues with her raising rent to a ridiculous amount, and mentioned it to my father.\n\nHe had me over and basically told me I could move back in, as long as I looked for a place to stay. Problem was, every apartment I tried denied me for my misdemeanor for battery.\n\nThey were okay with this originally, offered to keep me and work to get it expunged. But things slowly went farther and farther downhill, with my father screaming obscenities at me for everytime I left my blanket on the floor I slept on, basically every single time I fucked up absolutely anything to the slightest degree, I'd get a text while at work telling me, \"fuck you, your eviction notice is on the table.\", while coming home to no notice. \n\nToday, I didn't change the cat litter before I went to work, and they texted me a picture of an eviction notice and told me to gtfo, essentially, and that my entire family will completely drop me once all is said and done, and I'm left here with no options, since everything has to background check me before I move in.\n\nI feel awful and I'm not really sure how to take this. Do I blame myself?", "verdict": null, "score": 1.0, "created": 1632122592.0, "author_fullname": "aaaaaaaaafg", "url": "https://www.reddit.com/r/AmItheAsshole/comments/prpthb/aita_relationship_with_father/"}, {"title": "WIBTA for not letting someone win?", "content": "Hello you all, first time posting so sorry for editing.\n\nFor the backstory lets jump 2 years back in time.\n\nMe (12m) my cousin (10f) and my parents and her parents.\n\nEvery time we play a game(any) she has a habit to throw a fit whenever she loses, so her parents always ask us to let her win, which we do. But one day we were playing a game in which we were betting something.\n\nIt was a child friendly game (not like poker or something) and I had betted 100 rupees for myself OUT OF MY OWN MONEY, and the rest of the people bet something higher. Cousin's parents also bet 100 rupees for her. It was going pretty good because I realized that I was going to win right around 500 rupees. I was excited since I knew I was about to win. \n\nI won. YAY\n\nThat means the 500 rupees was mine, or was it?\n\n The cousin's parents asked me to make it so that it showed that she won. I thought that they were only asking me to show that she won the game not the bets, but they asked me to give them my winnings to her. I said that I was ready for letting her win the game but not the winnings. My mom, who was also playing, whispered in my ear to please give her the 500 rupees as I was her elder brother. She also told me that she would give me my 100 rupees back. So I reluctantly agreed. \n\nWhen we were going back home I asked for the hundred rupees. My mom said that it was my fault that I had bet that much. I kept quite after that.\n\nAfter that, I either played a no bet game or never played.\n\n(just in case, the game is 'housie')\n\n**FF 2 years**\n\nAm 14 and she's 12f, her parents still ask people to let her win.\n\nOn to the main story, today, for god knows what reasons there were a lot of people, lot of people to bet. Everyone betted over 500,including me, people there were rich and I mean RICH RICH. Some one betted 5k rupees. The pot was 10k(yeah).\n\nOnce again I was close to winning, and am in the middle of the game. Where did I get the time? well its going to take another 20 mins for her to return from her 1 hour toilet break.\n\nI have one number left for the full house (4k rupees, the rest 6k rupees were gone for the first second and the third line). I have more that high chance of winning since I was the only one with a single number, rest had at least 3 numbers including cousin. (people like to tell how many numbers they have left, when I announced mine the cousin's parents looked at me with a smile, i recognized it as they always smiled when they know I am going to give her the money.)\n\n&amp;#x200B;\n\nSo, WIBTA, if I don't let my cousin win money?", "verdict": null, "score": 1.0, "created": 1632122640.0, "author_fullname": "excusxme", "url": "https://www.reddit.com/r/AmItheAsshole/comments/prptt1/wibta_for_not_letting_someone_win/"}, {"title": "AITA for wanting to remove my younger sister from my mums custody or wanting to break up my mum and her girlfriend?", "content": "[removed]", "verdict": null, "score": 1.0, "created": 1632122682.0, "author_fullname": "Beautiful_Bluejay_90", "url": "https://www.reddit.com/r/AmItheAsshole/comments/prpu44/aita_for_wanting_to_remove_my_younger_sister_from/"}, {"title": "Am I the asshole for thinking her gifts were unthoughtful and kind of lame compared to mine?", "content": "[removed]", "verdict": null, "score": 1.0, "created": 1632122851.0, "author_fullname": "sher-hanes", "url": "https://www.reddit.com/r/AmItheAsshole/comments/prpvc4/am_i_the_asshole_for_thinking_her_gifts_were/"}, {"title": "AITA for asking my mother in law for a day to myself to grieve the day after my father died?", "content": "My dad passed away on Friday after 5 years of me caring for him as his alcoholism slowly destroyed him. I am devastated and totally raw. \n\nMy mother-in-law came round to our house early the next morning to ‘help’ (she was gardening) but I told my husband I felt overwhelmed and needed a day just to be quiet and alone to reflect on everything and let it sink in a bit. He spoke to his mum about this and she said she totally understood (as she was bereaved last year) and left (totally amicably). We hugged goodbye and said we’d speak in the week. \n\n[For context, she has a history of being quite a strong, present woman and last year told me it was time for me to, and I quote, “Wrap up your career and start concentrating on the home and making your husband’s life as easy as possible.” She also ‘lost’ a birthday present from one of my best friends before I’d even used it and didn’t speak to me for a couple of months when I asked her if she knew where it had gone (I saw her using it then it just disappeared).]\n\nThe next morning I call her to check she’s ok as she’s been ignoring my messages and phone calls. She then admits that she can’t believe that I asked her for space to grieve saying “It’s not all about you, you’re so selfish, how dare you ask me to leave your house. I should have just met up with my son today and left you alone, what about what my son wants?”\n\nShe then phoned my husband a few minutes later and spoke for about 15 minutes straight about all the shortcomings she thinks I have, like I don’t do enough laundry etc. My husband and I do discuss housework openly, I pay for a cleaner to come once a week as we both work full time and also I am currently 8 months pregnant. \n\nAll this the day after I lost my dad. \n\nAm I in the wrong?", "verdict": null, "score": 1.0, "created": 1632123226.0, "author_fullname": "Designer-Lonely", "url": "https://www.reddit.com/r/AmItheAsshole/comments/prpy4f/aita_for_asking_my_mother_in_law_for_a_day_to/"}, {"title": "AITA for not wanting to really hang out with my disabled friend anymore?", "content": "[removed]", "verdict": null, "score": 1.0, "created": 1632123263.0, "author_fullname": "LightJuli", "url": "https://www.reddit.com/r/AmItheAsshole/comments/prpydt/aita_for_not_wanting_to_really_hang_out_with_my/"}, {"title": "AITA - found this in my wife's phone. Wanted to write more but character-limited.", "content": "[removed]", "verdict": null, "score": 1.0, "created": 1632123349.0, "author_fullname": "Educational-Yam5944", "url": "https://www.reddit.com/r/AmItheAsshole/comments/prpyzv/aita_found_this_in_my_wifes_phone_wanted_to_write/"}, {"title": "AITA for already refusing to name a future daughter after one of his favorite relatives?", "content": "[removed]", "verdict": null, "score": 1.0, "created": 1632123361.0, "author_fullname": "SouthPoet", "url": "https://www.reddit.com/r/AmItheAsshole/comments/prpz2z/aita_for_already_refusing_to_name_a_future/"}, {"title": "AITA - wife's old flame", "content": "[removed]", "verdict": null, "score": 1.0, "created": 1632123475.0, "author_fullname": "Educational-Yam5944", "url": "https://www.reddit.com/r/AmItheAsshole/comments/prpzvx/aita_wifes_old_flame/"}, {"title": "AITA for ghosting her", "content": "[removed]", "verdict": null, "score": 1.0, "created": 1632123620.0, "author_fullname": "palm_treezzz", "url": "https://www.reddit.com/r/AmItheAsshole/comments/prq0wn/aita_for_ghosting_her/"}, {"title": "Am I the asshole for thinking her gifts were unthoughtful and kind of lame compared to mine?", "content": "[removed]", "verdict": null, "score": 1.0, "created": 1632123865.0, "author_fullname": "sher-hanes", "url": "https://www.reddit.com/r/AmItheAsshole/comments/prq2o7/am_i_the_asshole_for_thinking_her_gifts_were/"}, {"title": "[UPDATE] AITA for being overly sensitive and petty ?", "content": "[removed]", "verdict": "UPDATE", "score": 1.0, "created": 1632124051.0, "author_fullname": "simplyveryconfused", "url": "https://www.reddit.com/r/AmItheAsshole/comments/prq421/update_aita_for_being_overly_sensitive_and_petty/"}, {"title": "Am I the asshole for wanting to boys to fall In love with me?", "content": "[removed]", "verdict": null, "score": 1.0, "created": 1632124324.0, "author_fullname": "EngineSquare3753", "url": "https://www.reddit.com/r/AmItheAsshole/comments/prq5xh/am_i_the_asshole_for_wanting_to_boys_to_fall_in/"}, {"title": "WIBTA If we as a group of 8 asked if we could attend the same school at the same time given the situation?", "content": "For school, we have to go abroad or do private study for two semesters to a year. I'll note that the alternative isn't really fun, it's an offsite or online thing with a ton of work that we don't really want to do. I'm not against it, I'd rather not. We have over a year for this application But I'll say it's too late just in case.\n\nI have a group of friends who are like my family, the principal and My friend's counselor are aware and we do a lot of projects together and sports and music and etc. There's 8 of us so I know it's kind of ridiculous compared to just a couple of friends who have a request. Would it be okay to ask the counselors if we could all do the program together at the same time? Most people have the option of what they're going to do, but we've waited a long time because we're just really anxious about it and we were thinking maybe we would get put in the same organization at the same time at last minute until we learned that we don't really choose when we go (within year of application) and registering later makes it less likely to go where you want to go. We all decided that we're going to go do private study. We want to ask if we can go to the same schools, and if not at least do it at the same time So we can get done at the same time.\n\nAlso we've been kind of back and forth especially me and one friend in the group because it was their ide a to wait and I kept putting pressure on them Because I thought they were keeping everyone from taking responsibility And I'm also really impatient when it comes to making plans. Now everybody is against them after we realize just how late it is and lack of choice for us. That friend is the oldest and they make most or all decisions usually well", "verdict": "Not the A-hole", "score": 1.0, "created": 1632124359.0, "author_fullname": "butterflyilyy", "url": "https://www.reddit.com/r/AmItheAsshole/comments/prq668/wibta_if_we_as_a_group_of_8_asked_if_we_could/"}, {"title": "AITA for calling 101 instead of 999?", "content": "So yesterday I (19F) was walking home alone through a car park and saw a girl who looked around my age who was upset and crying about wanting to go home. There were 2 guys with her and when I asked if everything was OK one of the responded for her, saying they were waiting for a lift. I got a really weird feeling but thought I was probably over reacting so I called my mum for advice and she said to call 101 (non emergency) to let them know, just in case anything happened. So I called them (this was about 10mins after I saw the people as I finished walking home as it was late and I was alone) and was on hold for 36minutes. When an operator answered she started asking why I didn't call immediately as it had now been awhile and when I explained I'd been on hold she said she could see that but I should have called 999 (the emergency line) immediately even if I wasn't sure. I apologised and said I didn't know what to do but she was just saying \"well in future you should call 999\". She seemed really judgemental and I've been up all night feeling guilty, what if that girl got hurt because I didn't know what to do? What if it was all a misunderstanding and it was just 2 guys helping their upset friend get home?", "verdict": "No A-holes here", "score": 1.0, "created": 1632124372.0, "author_fullname": "sockforcroc", "url": "https://www.reddit.com/r/AmItheAsshole/comments/prq69r/aita_for_calling_101_instead_of_999/"}, {"title": "AITA - wife's messages", "content": "**Background**\n\n\\- My SO and I have been together for 7y, knew each other a bit as kids.\n\n\\- We hit it off as adults. We met again 4x over 2 months, + daily messages. We spent hours together, and I fell for her.\n\n\\- The following happened after we had started dating but before exclusivity (lived 5 hours apart, I drove each time):\n\n* Day A - The day after a date where I wanted to make a move but couldn't (long story), I poured my heart out to her. She said, 'I didn't know you felt that way', followed by some statements about 'not being interested in a r’ship at this point'. I was shattered, went home but didn't lose hope. We continued daily messages.\n* B (big holiday)\n   * I got drunk at a party and kissed a random girl. This happened before the messages below.\n   * SO went to a party and got drunk. We exchanged many messages, including wishing each other for the holiday. Her wish included calling me 'baby', my heart leapt.\n   * I found out later that she invited M (a friend she had mentioned before) who had been at the same party back to hers.\n* B.5 - 4 weeks later, after continuing daily messages, we met again and I was finally able to make my move. We became a couple.\n* C - We each shared our previous hookup stories, ending with B.\n   * She told me that M had been an ongoing 'friend-with-benefits' before B.5.\n   * She assured me that they never had sex and that she never had feelings for him.\n   * I was very sad. She said she was also pretty cut up to learn that I had kissed someone on B.\n* D - We Facetimed and her flatmate (F, who knew M) had found out about them. She teased my SO and they joked along, which upset me.\n\n**Present day:**\n\nWe’re married. My wife is a shift worker so I’m mostly alone (now lockdown, WFH). Yesterday she asked me to go to a shop with her phone (which had the order confirmation). I got curious and thought to see what she had said to M on B. I have never looked through her phone before.\n\n* She only sent him her postcode. In the same frame was the following from a few days later:\n* M - 'Did I wear a glove?'\n* SO - 'I don't think so. Are you worried?'\n* M - 'Haha always'\n* SO - 'I have my period now anyway. Risk calc is always done.'\n\nI was surprised so read back. These stood out, reverse chron.:\n\n* He sent an Uber screenshot from his to hers at 0130 one morning, then both wrote kiss emojis. This was him coming over or her going home in an Uber he ordered.\n* A message from another exchange where he said 'You taste good tho', she laughed.\n* I didn’t read more.\n\nShe was single from &gt;1 year before we met. Given how much of a nymph she was with me, it makes sense that they would have had a sexual r’ship. I asked her about it but didn’t tell her how I knew.\n\n* She insists that they never fucked.\n* She only ever saw/met with him twice, both times when F was around, and never went to his house.\n\nI know it's my fault for looking + it doesn’t matter after so long but she’s lying and I feel like shit. .\n\nAITA?", "verdict": null, "score": 1.0, "created": 1632124376.0, "author_fullname": "Educational-Yam5944", "url": "https://www.reddit.com/r/AmItheAsshole/comments/prq6am/aita_wifes_messages/"}, {"title": "AITA for wanting to boys to fall In love with me?", "content": "\nLet me just start I to say i am 16 and in a relationship with a person I love dearly. The issue is I keep thinking of other boys and how to get there attention and if they like me. I don’t want a relationship with them I just feel the urge to flirt with them( I just have the urge I don’t actually do it). I have commitment issues and I also have daddy issues so that’s probably why I feel the urge to do things like that. I truly do love my boyfriend dearly and he’s honestly the most kind person I have every met. I know in the asshole, I’m just looking for advice on what to do. (Also I do not feel this way when it’s just the two of us, I only feel this way when we are around boys we know and when I’m alone)", "verdict": null, "score": 1.0, "created": 1632124564.0, "author_fullname": "EngineSquare3753", "url": "https://www.reddit.com/r/AmItheAsshole/comments/prq7m5/aita_for_wanting_to_boys_to_fall_in_love_with_me/"}, {"title": "[UPDATE] AITA for being overly sensitive and petty ?", "content": "[removed]", "verdict": "UPDATE", "score": 1.0, "created": 1632124901.0, "author_fullname": "simplyveryconfused", "url": "https://www.reddit.com/r/AmItheAsshole/comments/prqa1w/update_aita_for_being_overly_sensitive_and_petty/"}, {"title": "AITA For not calling my sister on her birthday?", "content": "So about a month before my older sister’s (28) birthday, I (26) had an emergency surgery because they found an ovarian cyst that was my ovary was wrapped around and were planning on removing it and possibly my ovary as well. My dad (58) took me to the ER because I couldn’t drive myself with how much pain I was in. He stayed long enough to know they were going to do a surgery, but he decided to go home and sleep before he went to work in a few hours. I texted my younger sister (24) about the surgery and how nervous I was. She and my other sister live in different states, so the first thing she asked is if Dad was there. I told her no, he had to work soon and she immediately spammed my dad saying he should be there and he ended up coming back and calling out of work so he could be there. My younger sister also messaged my older sister (28), who has been a little more distant from us because she’s dedicated to her family, husband and two kids, and has never made an effort to come see me in the last 7 years because ‘it’s just too hard too travel with kids’, and I get that. So I’ve visited her a few times in the past years. Well she texts me too saying that she hopes my surgery goes well and she’ll call me afterward.\n\nTurns out, it was a softball sized benign tumor that had completely ‘killed’ my ovary, so they had to remove both. After the surgery, when I wasn’t drowsy, I tried to call my sisters but they were both too busy. I didn’t want to send them what happened in a text, so I just waited for them to call me back, but they never did. \n\nFlash forward 3 weeks and it’s my younger sisters birthday so I call her to wish her a happy birthday, because she really was supportive to me and we do talk a lot more than my other sister. A week and a half later, it’s my older sister’s birthday and I guess I was feeling petty and didn’t bother to wish her a happy birthday. Even though I never complained to anyone how hurt I felt that they didn’t call me after my surgery, my sister blows up talking about how rude I am for not calling her. But she doesn’t say that to me, she says it to my dad and sister, and then both of them relay it to me. \n\nThen comes the horrible luck of my dad butt dialing her while he’s telling me this. I said that I really don’t care because she doesn’t seem to care about my life or how I’m doing. Well, she lets us know that she heard everything and was mad. She’s been even more distant than before, doesn’t respond to any of messages in our (my sisters) group message unless it’s directly about her. And then she just sends pictures of bread she makes, expecting us to praise her on it, and they’re usually right after she ignored a message from me. She still has yet to ask me about the surgery, but I’m not holding my breath.\n\nSo, I feel like I might be TA because I was being petty when I didn’t call her for her birthday.", "verdict": "Not the A-hole", "score": 1.0, "created": 1632124992.0, "author_fullname": "butterflyflyfreee", "url": "https://www.reddit.com/r/AmItheAsshole/comments/prqasb/aita_for_not_calling_my_sister_on_her_birthday/"}, {"title": "AITA for telling my ex and mother of my child to grow up and be a better mother", "content": "My ex and I have a 6 year old daughter together that I have custody of. We separated two months ago she only gets supervised visits and phone calls. Our daughter has been acting out due to the separation. Yesterday her mother told her she isn't going to waste her time talking to her if she is going to talk like that to her. My 6 year old daughter was upset because her mother's phone didn't work when she tried to call previously. So she was saying you stink and you don't really love me. She also says these things to me when she is upset for me its no big deal I understand. After being told by her mother that she isn't going to waste her time talking to her because of the comments her mother hung up and didn't speak to her anymore that night. My daughter ended up crying herself to sleep because of what her mother said. I got angry and told her mother to be the adult that we put our daughter in this situation and are responsible for any feelings and behavior issues she is having. To act like an adult and be a better mother.", "verdict": "Everyone Sucks", "score": 1.0, "created": 1632125143.0, "author_fullname": "Mindless-Trip-3242", "url": "https://www.reddit.com/r/AmItheAsshole/comments/prqbw6/aita_for_telling_my_ex_and_mother_of_my_child_to/"}, {"title": "AITA for not letting someone who is not a woman join a women’s group?", "content": "I run an all-girl hiking group. There’s a girl in the group who now no longer considers herself a girl and says she is non-binary.\n\nSo obviously since she is no longer a girl, she is not welcome in the group any more. The group is for girls only. I told her this, and she flipped out about how I’m discriminating against non-binary people.\n\nI’m not. I’m enforcing the rule. This is a group for girls, not non-binary people and men. I said she’s welcome to find a hiking group for non-binary people, to which she said none exist. Which is not my problem. \n\nAITA for not letting someone who isn’t a girl into a group for girls?", "verdict": null, "score": 1.0, "created": 1632125300.0, "author_fullname": "xhdbcbcb", "url": "https://www.reddit.com/r/AmItheAsshole/comments/prqcyp/aita_for_not_letting_someone_who_is_not_a_woman/"}, {"title": "[UPDATE] AITA for being overly sensitive and petty ?", "content": "[removed]", "verdict": "UPDATE", "score": 1.0, "created": 1632125638.0, "author_fullname": "simplyveryconfused", "url": "https://www.reddit.com/r/AmItheAsshole/comments/prqfbq/update_aita_for_being_overly_sensitive_and_petty/"}, {"title": "Union Bank of India Recruitment 2021 Apply Online", "content": "[removed]", "verdict": null, "score": 1.0, "created": 1632125845.0, "author_fullname": "Freemejob", "url": "https://www.reddit.com/r/AmItheAsshole/comments/prqgpw/union_bank_of_india_recruitment_2021_apply_online/"}, {"title": "AITA if I told my gf one of my friends has touched my dick in the past and she asked me to unfriend him", "content": "A few months ago I told my gf that when we were 14 my friend and I tried to touch each others dicks and stroke just to see what it would feel like. We stroked like 3 times and were weirded out by it so we stopped. When I told her this story she laughed but then a couple days back she brought it up saying how she feels uncomfortable with me being friends with someone who I've done that with. \n\nShe has asked me to not hang out with this person who I would consider as one of my best and very few friends. I argued that I won't do so as in a previous relationship I stopped talking to a friend at the request of my partner and hated myself after the relationship ended for doing so.\n\nSince I refused to do as she asks she told me I do not value her enough and am choosing my friends over her, despite my best attempts to explain that we were just curious teens. Both of us are straight and have not talked about the incident since and yet she won't let it go and is saying it's either him or her and I am almost certain I will choose him. AITA?", "verdict": null, "score": 1.0, "created": 1632125872.0, "author_fullname": "yeetusdeletusaway", "url": "https://www.reddit.com/r/AmItheAsshole/comments/prqgx3/aita_if_i_told_my_gf_one_of_my_friends_has/"}, {"title": "AITA for getting angry I was rostered on at the wrong time on the wrong day, then I wasn't told until I turned up to work?", "content": "Our rosters usually come out on Thurs/Friday. I'm relatively new to the company and an old employee is leaving, I'm working part-time but will be filling in for a few weeks full-time while they find a new replacement, I've also covered the other employee's shifts in the past- which is why I didn't originally think much about the hours change.\n\nUsually I work in the evenings (I have study during the day). However, this week I was rostered Monday-Wed at 8am to 5pm, so I turned up to work and my manager says 'oh we don't need you today' hence I asked why I wasn't texted, called, or emailed prior to arriving if they knew that. They said they didn't know until I arrived (they're the one who sent the roster) and I wasn't particularly thrilled, especially because it was morning in peak traffic times so I wasted like 40mins going to and back from work for no reason. Also I could have slept in.\n\nLater I got a new roster and apology in an email.", "verdict": null, "score": 1.0, "created": 1632125926.0, "author_fullname": "Combobled", "url": "https://www.reddit.com/r/AmItheAsshole/comments/prqh93/aita_for_getting_angry_i_was_rostered_on_at_the/"}, {"title": "AITA for \"abandoning\" my mother and spending too much time at my girlfriend's house?", "content": "So me (F19) and my girlfriend Angelica (F19) have been dating for a year. We've been close friends for a few years before that though and we're very much in love. We spend as much time as we can together and it's the happiest and healthiest relationship I've ever been in, we communicate about everything and I'm so incredibly comfortable around her.\n\nHer family is also extremely supportive and welcoming of me. She is also autistic, so it's hard for her when her plans change and she prefers being at her own house as its more comfortable/all her things are there/its familiar etc. I don't mind this at all so when we're together we'll much more often be at her house instead of mine.\n\nI live with my parents, and it really upsets my mom that I'm constantly at Angelica's house instead of at home. At the moment, I spend one or two nights a week at home with family, one or two nights a week at my sister's house because she lives closer to my work, and the rest of the time I'll be at Angelica's. Mom hates this, and whenever i am at home she'll make comments about how I'm never there, if I ask for something she'll ask \"why can't your other family do it\", make snide comments when I borrow Angelica's clothes, call me needy for always being there etc etc. I would understand that she would be upset if I was spending all my time with Angelica and not doing anything else, but we both work 2 jobs each and are in tertiary education (I'm even on a scholarship), so I know she can't be upset that we might be 'bad influences' on each other or something.\n\nI think she might be upset that I don't spend as much time with her anymore and that I've 'abandoned' her and I do feel guilty for that. I've told her that I'm very busy at the moment and struggling to balance work, education, a love life and family all at once and she responded with \"yeah. you are.\" which made me feel really guilty. We don't have the best relationship and do argue a lot. I don't really enjoy being home unless my younger brother is there as well (I get along really well with all of my siblings). If I have a problem, I'll rarely go to mom, and instead go to my girlfriend or her mom or friends for advice. It's really obvious I'm favouring Angelica's family and home over my own and my mom is not happy. I know I don't want to spend more time at home than I currently am but i can't help but feel guilty about it. AITA?", "verdict": "Not the A-hole", "score": 1.0, "created": 1632126233.0, "author_fullname": "aitaabandoned", "url": "https://www.reddit.com/r/AmItheAsshole/comments/prqj91/aita_for_abandoning_my_mother_and_spending_too/"}, {"title": "AITA for telling my friend I won’t lie for them", "content": "[removed]", "verdict": null, "score": 1.0, "created": 1632126344.0, "author_fullname": "fooortquad", "url": "https://www.reddit.com/r/AmItheAsshole/comments/prqk08/aita_for_telling_my_friend_i_wont_lie_for_them/"}, {"title": "AITA for saying I won’t lie for my friend", "content": "[removed]", "verdict": null, "score": 1.0, "created": 1632126538.0, "author_fullname": "fooortquad", "url": "https://www.reddit.com/r/AmItheAsshole/comments/prql9a/aita_for_saying_i_wont_lie_for_my_friend/"}, {"title": "AITA for not addressing stuff to my girlfriend in important House Needs?", "content": "[removed]", "verdict": null, "score": 1.0, "created": 1632126706.0, "author_fullname": "ApostleOfChrist", "url": "https://www.reddit.com/r/AmItheAsshole/comments/prqmcq/aita_for_not_addressing_stuff_to_my_girlfriend_in/"}, {"title": "AITA For Telling My Wife \"My Body, My Choice.\"?", "content": "[removed]", "verdict": null, "score": 1.0, "created": 1632126743.0, "author_fullname": "narsfweasels", "url": "https://www.reddit.com/r/AmItheAsshole/comments/prqmml/aita_for_telling_my_wife_my_body_my_choice/"}, {"title": "AITA for being resentful of my friend for acting like he's better than me?", "content": "First time posting here, sorry for any possible errors. \n\nI am having trouble getting along with a friend of mine. We are very close and talk often, but I feel jealous towards him and it's damaging our relationship. We mostly spend time gaming with our friend group. \n\nWe usually have a similar level of skill when gaming as a group, save for the friend in question. He seems to pick up every game extremely quickly and excel at it. And since there is a huge gap in skill level between us, I feel inferior to him and have no fun playing with him.\n\n I express this in negative ways, to say the least. He seems to take my feelings for granted when this happens. He doesn't directly trashtalk me but he makes fun of me for being bad at the game (Think sarcastic positivity, like \"You can do this, you're the best player in the world!!! \" ) I might just be interpreting it differently but he makes me feel like shit. I get angry, get REALLY salty (excessive self criticism, jealousy, resentment, and more) and overall be an unfun person to deal with because of the saltiness. He seems to not care in the slightest which makes me even more mad.\n\nI told to him multiple times that he makes me feel bad. He says no one else seems to care and (indirectly) I should learn to take it.\nHe then doesn't change, but instead jokingly puts me down at every opportunity. I don't see a particular dislike though, he still talks to me. But when I ask him a question, he generally doesn't respond. He has said to me before that my saltiness and excessive complaining makes me an unfun person. He says he doesn't get why I mind being bad at a game so much. \n\nHe also complains when a situation in general goes well, but not as well as he wanted. He seems really ungrateful to me and that makes me spiral into rage even more. I want to sort it out with him but he deflects everything with humor and when he doesn't, he dismisses how I feel.\n\nHe coats every word he says with humor and I seriously can't tell when he is genuine or not. Am I right to be confused or am I just too sensitive?", "verdict": "Asshole", "score": 1.0, "created": 1632126757.0, "author_fullname": "Wiwade", "url": "https://www.reddit.com/r/AmItheAsshole/comments/prqmqf/aita_for_being_resentful_of_my_friend_for_acting/"}, {"title": "AITA for scaring my roommate when he was in the bath?", "content": "[removed]", "verdict": null, "score": 1.0, "created": 1632126785.0, "author_fullname": "albaraodn", "url": "https://www.reddit.com/r/AmItheAsshole/comments/prqmwp/aita_for_scaring_my_roommate_when_he_was_in_the/"}, {"title": "AITA for saving for my nephew secretly?", "content": "My late sister has a son Luca (18). She passed away when he was 4 and his dad remarried when he was 6 and he has step and half siblings from his dad's second marriage. After my sister died I started a little account for him that grew over the years. When he turned 18 I told him about it, gave him all the details and now he has access to the money. His dad is furious that I did it behind his back. He said that is something everyone should have known about. I asked him why. He said because he has other kids to think about. I told him I only had my nephew to think about and the money was for him and not for his family. He told me they should all have been considered by me since they're my nephews family and by saving just for him and giving him money nobody knew about he now has a better start than any of the other kids will.\n\nAITA?", "verdict": "Not the A-hole", "score": 1.0, "created": 1632126842.0, "author_fullname": "Hailsends", "url": "https://www.reddit.com/r/AmItheAsshole/comments/prqnag/aita_for_saving_for_my_nephew_secretly/"}, {"title": "AITA? My manager commited a hit and run on my car and I reported her.", "content": "[removed]", "verdict": null, "score": 1.0, "created": 1632126845.0, "author_fullname": "itsYaylor", "url": "https://www.reddit.com/r/AmItheAsshole/comments/prqnbe/aita_my_manager_commited_a_hit_and_run_on_my_car/"}, {"title": "AITA - Told my wife \"My Body, My Choice\"", "content": "  \n\nMy (41M) wife (46F) has always wanted a breast enlargment, as it caused he a great deal of stress and unhappiness that she was \"small\". She researched all the treatments, a couple of different hospitals, borrowed the money from me, which she paid back befor the deadline, got the procedure. She came back home with a high fever, and was sick for several days afterwards. I took care of her, but this was during the beginning of the craziness, so everyone was worried. We quarantined, cost us a little bit in lost earnings, but it was ok. \n\nFast forward to now, and well, I have and have had, the *opposite* problem for pretty much my entire life from about age 10. The problem is visible even when I have slimmed down, and even at my lightest, well... moobs. People have mocked me ***relentlessly*** my entire life for this. I recently found out that not only was it possible, but perfectly **safe** to have reduction surgery. I did my research with the help of a friend's SO who is VP of a cosmetic clinic (I did not choose hers in the end) and also my HMO. I settled on a place and I'm going to have non-invasive surgery.\n\nI have kept my wife informed **at every stage** of this process , from beginning to end. And she has not shown the least understanding or empathy for me. She believes it's not necessary as it's not a life threatening problem and she doesn't care about my body. Ok, I appreciate the sentiment, and I'm glad. But this ***bothers me:*** and the problem can be fixed.\n\nShe first began hassling me about hospitals - which one? Why? How many have you researched? How do you know that doctor is good? Have you watched the operation on the internet? What do people say?\n\nI answered her questions patiently, but it became pretty obvious that no matter what I said or did **a)** She does not want me to have the surgery and **b)** the reason for that is because I plan to have it during an upcoming national holiday, which would \"ruin our plans\" (we were planning to go to an expensive brunch on one day) but give me more time to recover. I even mentioned that although there would be pain, the whole thing would take 3 hours and in most cases people go back to work the next day, and in some cases, afternoon if they have it done in the morning. I have checked with multiple sources on this.\n\nAfter a consultation at the hospital, I decided to go with the non-invasive option, as it's slightly more expensive, yields the same results, and won't require surgery. She seemed pleased that was the case, but blew up when I told her it was $1000 more expensive than the surgery option. I went through the reasoning again. She finally accepted and said \"Well, at least we can go to brunch\".\n\nThat got me. \"So, the only real objection you had to me doing it in the vacation was because it would throw off our 'plans'?\" She blustered, rehashed the old ground we had gone over, I mentioned she was fine with it so long as we could have an expensive brunch? She kept going over the same arguments we had time and again, repeating previous points that I had explained to her. She raised her voice, shouted, got aggressive (I stayed calm) at the end of it I said \"I would hope you would support me in something non-invasive, simple and safe. But regardless, it's **my body, my choice.** And I want to feel good about myself.\"\n\nWell, apparently, that's only something for women to say, as men have oppressed them and controlled their bodies. Which I agree with - old white men hold too much sway over women's reproductive health. I'm ardently Pro-Choice and respect anything a woman wants to do with her body - it's hers.\n\nBut some friends have told me I had no right to say that, as I am an oppressor as a man.", "verdict": null, "score": 1.0, "created": 1632126901.0, "author_fullname": "narsfweasels", "url": "https://www.reddit.com/r/AmItheAsshole/comments/prqnnt/aita_told_my_wife_my_body_my_choice/"}, {"title": "Aita for making Mom stressed about me locking the bathroom door??", "content": "[removed]", "verdict": null, "score": 1.0, "created": 1632126914.0, "author_fullname": "Ok-Heart1", "url": "https://www.reddit.com/r/AmItheAsshole/comments/prqnqm/aita_for_making_mom_stressed_about_me_locking_the/"}, {"title": "AITA for not helping fiancé more with wedding planning?", "content": "[removed]", "verdict": null, "score": 1.0, "created": 1632126939.0, "author_fullname": "carolinaorange", "url": "https://www.reddit.com/r/AmItheAsshole/comments/prqnx9/aita_for_not_helping_fiancé_more_with_wedding/"}, {"title": "AITA for not helping more with planning the wedding?", "content": "We are planning a wedding that we postponed already due to Covid. I recently started a new job about two months ago and I really wanna make a good impression and I’m very stressed about this job. We are also moving to a different apartment for a week before the wedding but my fiancé will not be helping with because she will already be in town with the wedding planning.\n\nRecently my fiancé’s mother was in a bad car accident and is in a coma. My fiancé talked about maybe we should cancel the wedding but apparently all her family members told her not to because your mother would want us to have the wedding.\n\nRecently she’s been complaining to me with all her stress and I don’t think she realizes how stressed I am with my stuff for the move. She basically got mad at me because I didn’t wanna pick up the food and drink on the day of the wedding for when we’re getting ready. She offered to do it but now she’s mad about it. She seems mad that I’m not doing any tasks on the day of the wedding and now she has another one to do. She mentioned how so many people are asking her if you need help with the wedding planning is they can tell she is overwhelmed. If all these people are asking her if she needs help I don’t understand why she doesn’t let them help her and how am I the a for not helping more if she has all these offers for help. Plus wedding stuff is not exactly my thing she’s better at that sort of thing that I am. \n\nSo AITA?", "verdict": "Asshole", "score": 1.0, "created": 1632127390.0, "author_fullname": "carolinaorange", "url": "https://www.reddit.com/r/AmItheAsshole/comments/prqr24/aita_for_not_helping_more_with_planning_the/"}, {"title": "AITA for not wanting a haircut?", "content": "So I have trichotillomania and am known to pull out patches of my own hair, it's probably linked to my anxiety issues and such. Anyways my grandma and mom won't stop complaining about wanting me to get a haircut even though I've explained I don't want a haircut at all. With the way my hair is pulled out I can easily cover and hide it without much issues, I'd prefer to let my hair grow back out since it takes 7 months to grow it back to this point. \n\nMy only issue is I wish they would see my point of view, I have hats, I wear hats often almost everywhere we go regardless of hair pulling or not. \n\nFrom their point of view I'm sure they just don't want me to get bullied or laughed at for having a bald spot but to be honest I don't care that much about my hair. I respect myself enough that words genuinely don't hurt me. I have the mentality that I love myself enough so why should other peoples opinions bother me? \n\nI almost feel like they're embarrassed to go out with me because of my bald spot. They also had a point before where I was pulling my hair out and they forced me to get a haircut because \"you look like a girl\" and \"you don't keep it combed\" I have naturally curly hair when it gets long.They prefer I keep it short regardless of pulling or not. \n\nI also pay the rent for my mom's apartment, I feel like I should at least get to choose when to cut my hair.", "verdict": "Not the A-hole", "score": 1.0, "created": 1632127604.0, "author_fullname": "QuiteHistorical", "url": "https://www.reddit.com/r/AmItheAsshole/comments/prqse2/aita_for_not_wanting_a_haircut/"}, {"title": "AITA for reporting my manager for committing a hit and run", "content": "[removed]", "verdict": null, "score": 1.0, "created": 1632127756.0, "author_fullname": "itsYaylor", "url": "https://www.reddit.com/r/AmItheAsshole/comments/prqtf9/aita_for_reporting_my_manager_for_committing_a/"}, {"title": "I (24M) sent my friend (26M) home for creeping on my teen neighbor (19F) and her friends (19F &amp; 18F), and then ended up sleeping with said neighbor that night.", "content": "[removed]", "verdict": null, "score": 1.0, "created": 1632128033.0, "author_fullname": "1dcsrt10", "url": "https://www.reddit.com/r/AmItheAsshole/comments/prqvc3/i_24m_sent_my_friend_26m_home_for_creeping_on_my/"}, {"title": "AITA for making Mom anxious about me locking the bathroom door?", "content": "I (19F) live with my mom (41F) as I'm taking a gap year to study for entrance exams and to save up money before I move out. For context, my mom has always been very protective of her children. For example when I was around 11-12yo she had a freak out about me having locked the bathroom door when I was showering. She told me never lock the door, only for my stepdad to barge in while I was on the toilet a couple days later and snap at me for NOT locking the door.... Been locking it ever since.\n\nFor a long time she didn't mention it again, but for some reason it's something she's started stressing about again. She told me a couple weeks ago to not lock the door when I shower in case something happened (for example I slip). Note that nothing like that has ever happened to me or any of my siblings. I  locked it regardless, and she got annoyed, saying that there should be no reason for me to wanna lock it and that Im making her anxious. She told me that she wouldn't come in when im showering \"unless she really needs to use the toilet\". I've left it unlocked a total of two times, the first time she didnt come im but the second time she came in without asking to get something from the cabinet.\n\nThe thing is that I'm a very private person and very uncomfortable with people seeing me naked. She doesn't understand this: she walks around half-naked almost every day, might leave the bathroom door open when doing her business etc. I don't want her to come in when Im showering, especially since the bathroom is tiny and the toilet seat is maybe a meter away from the shower with only a seethrough shower wall in between. Another reason is that I have some scars on my waist and thigh that I dont want her to find out about, as she is so overbearing and would start worrying and watching me to a point where it would make me uncomfortable.\n\nHer request is making me uncomfortable, and in turn she says I'm making her anxious. I feel like it's not too much to ask to have some privacy as a 19-year-old. AITA for making her anxious by locking the door?", "verdict": "Not the A-hole", "score": 1.0, "created": 1632128136.0, "author_fullname": "Ok-Heart1", "url": "https://www.reddit.com/r/AmItheAsshole/comments/prqw3v/aita_for_making_mom_anxious_about_me_locking_the/"}, {"title": "AITA for not caring about this missing girl case that everyone’s talking about?", "content": "I get it, it’s horrible for her parents to find this new out but why should the whole nation be told about it 24/7? So there’s a missing white girl and her white boyfriend who was obviously suspect #1 was let off the hook and now he’s gone. Sounds like white privilege and ignorance to me. Black boyfriend would probably spend 5 days in questioning with cold sandwiches and piss water. A missing black female vlogger probably wouldn’t even make the headlines.\n\nI know what you guys are gonna say but I still don’t care. This is a case of mayonnaise on mayonnaise crime. She can’t be the only person missing. And that dude can’t be the only possible killer the “law” has let walk.", "verdict": null, "score": 1.0, "created": 1632128162.0, "author_fullname": "auntieruckus", "url": "https://www.reddit.com/r/AmItheAsshole/comments/prqw9o/aita_for_not_caring_about_this_missing_girl_case/"}, {"title": "AITA for being mad at my (f17) boyfriend (m18) for not wanting to go to prom or winter formal with me", "content": "I always wanted to go to prom and WF if I had a date when I was younger, but if I didn't I wouldn't go because our prom and WF were heavily for couples or dates since it was fancy dining and etc. \n\nI met my boyfriend when he was a junior and I was a sophomore, but both his prom and WF was cancelled because of COVID. I was very upset, if we were going to become high-school sweethearts, it sucks we dont have pictures of us in prom or formal. It would be really cute to see us back in high-school.\n\nHe's now a freshman in college and im a senior, and I'm blessed to have a winter formal and prom this year. I was so excited that I told him about and he said he's not going with me. I asked him why and he said \"It's embarrassing to go back after I graduated\"\n\nAnd Im really mad but extremely sad because I stopped calling him and I cannot stop crying because this is a one in a lifetime chance before I graduate. And this is my last year in this state before we have to become long distance. We rarely get the chance to even go to an event together formal or not and our chances will get even slimmer once im gone. But he just doesn't want to go because of his frail ego?\n\ni was really hurt and tried to convince him but he still doesn't want to go so I said \"Fine, should i just go with somebody else? I'm not gonna go without a date\" and he also didn't want that so he expects me to just not go or go by myself like thats gonna be so fucking fun. \n\nI feel really stupid for being emotional and crying over this but im a teenage girl and i want to experience this and have a formal event with my boyfriend, but he's being so selfish and he hasn't even thought about how i feel", "verdict": null, "score": 1.0, "created": 1632128228.0, "author_fullname": "ahegao-weeb", "url": "https://www.reddit.com/r/AmItheAsshole/comments/prqwq0/aita_for_being_mad_at_my_f17_boyfriend_m18_for/"}, {"title": "AITA for telling a nurse that she's a terrible mother and that I felt awful for her kids?", "content": "[removed]", "verdict": null, "score": 1.0, "created": 1632128290.0, "author_fullname": "throwawayallthetime0", "url": "https://www.reddit.com/r/AmItheAsshole/comments/prqx65/aita_for_telling_a_nurse_that_shes_a_terrible/"}, {"title": "AITA for telling a nurse that she's an awful mother and that I felt bad for her kids?", "content": "\nI know context is needed.. A couple of days ago I drove my little sister to get a physical exam, and she also agreed to get a flu shot. Both of us are terrified of needles and can faint at the sight of them, so this was a big thing for her, especially volunteering to do it. Her other vaccines took some preparation. Anyhow, everything was going fine, until the nurse came in to take her to the backroom. I went with them, and already, I could tell that the nurse was not in the mood. She had this very come-here-now and do-this-because-i-say-so-attitude. Whatever, I brushed it off as her just having a bad day/being exhausted, and didn't take it personally. She left and I stood outside while the doctor did the physical for my sister, and everything went well. I came back in before the nurse went to get the vaccine. I could tell my sister was shaky and nervous but she was doing her best to be calm, as was I. The same nurse came in with the vaccine. She got it all ready, when my sister asked her to give her a minute or two to calm herself down and asked her if she could lie down. This woman flat out said NO because she said that she had things to do and didn't want to waste her time. My sister then replied that she was afraid of needles and that she was a fainter. The nurse then said that my sis needed to grow up and stop acting like a baby. I was getting upset and responded that what she said was very insensitive to anyone with anxiety and phobias and she needed to stop being rude, and she needed to accommodate my sister, who was starting to tear up at this point. This bitch then started to raise her voice and told her to stop crying and get it over with,, or else she would have to hold her down and inject her. Now, this is something that I feel very strongly against. This has happened to me in the past, where our abusive father would come with me to my appointments, and whenever I needed a shot, instead of the nurses reasoning with me, the bitches and my dad would restrain me, causing a lot of trauma. I wouldn't be surprised if my sister went through this too. I then told the nurse that her doing that will NOT be happening and that she should be ashamed for even considering doing something so scarring and, yes, abusive. She then said that \"sometimes kids need to be scarred to toughen them up\" and that she knew that because she was a mother. I lost my shot at this point and told her that I felt so awful for her kids for having such a terrible mom. I grabbed my sis and walked out of the room, while I heard the dumbfuck yelling at me in the background. My poor sis was having a panic attack. We got home and I told my mom what had happened and she said that I shouldn't have said what I said and went too far. Furthermore, I shouldn't have done it in front of my sister because I may have mad her anxiety worse. AITA Reddit?", "verdict": "Not the A-hole", "score": 1.0, "created": 1632128609.0, "author_fullname": "throwawayallthetime0", "url": "https://www.reddit.com/r/AmItheAsshole/comments/prqzl1/aita_for_telling_a_nurse_that_shes_an_awful/"}, {"title": "AITA for hesitating to buy my boyfriend expensive stuff", "content": "I am a (37f) and my long time boyfriend (47) have been together for almost 14 years and we have 2 kids together (13 and 3). For the past 3 yrs I've worked 2 jobs to support our family. After the birth of my son my first job wasn't cutting it so I got a second job working at a restaurant and this year got promoted to manager. After my son was born I gave him the choice of staying home with our children or getting a job and flat out told me he didn't want to go work. For the last couple years he has changed (going through a mid life crisis I think) and has been extremely hard to please. I usually give him anything he asks for with in reason. Before we got together he was addicted to drugs and got clean after the birth of my daughter and did wonderful, not even touching alcohol. He started smoking pot again which in most cases is fine but he has an addictive personality and expects me to pay for on top of his cigs and everything else. \n\nThings kinda got bad a week ago when I got stimulus for my kids and planned on doing clothes shopping for my kids. Lately my boyfriend has gotten into this weird fixation survival gear and clothing which i have bought a lot of it for him. He wanted some kind of shirts and pants from Poland that cost over $200. I asked him if we could buy one thing now i get the other next month because our son hit a growth spurt and was needed fall and winter clothes and shoes and i need some new work shoes because i wore out my old pair and I am on my feet 40 plus hours a week. He got angry with me and said I emasculate him by him having to ask me to buy him stuff and he said as soon as our son was in school he was getting a job so he could buy himself stuff. It kind of set me off because in the 14 years we have been together he never held down a job and let me struggle with bills and taking care of our kids and i let him know how infuriating it was. The next day he woke me up 3 hours after i got off work he woke me up (i work night shifts so i sleep part of my day) Lied and said he needed to go see his counselor I got up and saw him walking from his friends apartment across the street and he came home high. He said he talked to some woman he just met and she said she saw me in a car with a bald guy (the only one i know is my friends husband) and basically accused me of cheating. My lepard gecko died of old age the other day and while i was getting ready to bury him and explaining to our 3yr old what death meant my bf screamed at him and jerked the dead lizard out of my hand and threw it away. the whole weekend he hasnt spoke to me and basically stomps around the house when he sees me and mutters stuff under his breath.", "verdict": "Not the A-hole", "score": 1.0, "created": 1632128708.0, "author_fullname": "Isadora-84", "url": "https://www.reddit.com/r/AmItheAsshole/comments/prr0a8/aita_for_hesitating_to_buy_my_boyfriend_expensive/"}, {"title": "AITA for reporting my managers hit and run?", "content": "I (22f) had a manager named Jane(30-40f) and I reccently got a new job. Now this place I left has very strict rules about managers interacting with other employees outside of work. They are absolutely not allowed to fraternize and is basis for termination depending on the situation. Last night I went out with a few friends that still work with Jane. After the bar closed we piled into my friends car and I left mine in the lot to return to later. As we were pulling out one of my friends goes “Is that Jane?”. We didn’t think it was but we asked anyways and yup it really was. She was wasted. We spoke for a minute when suddenly we realized the group of women she was with just vanished leaving her with us. She was in no condition to drive so we got her into my friends car and drove her around the surrounding neighborhoods she was directing us to. We drove her around for over an hour-for reference the bar closed at 2AM and I got back to my car in the lot at 4AM. She refused to tell us her address saying she didn’t know it making us drive in circles. We didn’t know if it was because she didn’t want us to know where she lived because she feared for her job or she was that drunk. Either way she refused to let us help her so we went back to the lot where my car and Janes car was. I was putting gas in my friends car for her when I see Jane start pulling out of her spot which coincidentally is across from the spot I had pulled my car into. Right as I finish putting gas in my friends car I’m reracking the pump and I hear a loud thump. I look up and see Janes car leaving the parking lot and just know she backed into my car. I don’t know if this makes a difference but my car means a lot to me and I have a lot of pride in it. Today I called my old place of work to talk to her and get her information since she had mentioned while driving her around she was supposed to work. My plan was to ask her if she wanted to go through insurance or pay for it out of pocket because insurance would need a police report. I didn’t want to out her for being social with people that still work for her or a hit and run. I was told that she wasn’t at work and no other info could be given out. We did some digging on our public jailing page and found that she had been arrested for a DUI. At that point it had almost been 24 hours since she hit my car. She was already legally in trouble so I made the hit and run report and filed it through my insurance noting her name and that she was arrested. Some people are saying I’m the AH for reporting it since she already is in big trouble and the damage honestly wasn’t that bad (It was about a thin 6in scrape, shifted my bumper, and paint transfer) but my mom is telling me that I needed to. AITA? She might lose her job and on top of that have to pay for a DUI, hit and run charges, and fixing my car.", "verdict": null, "score": 1.0, "created": 1632128852.0, "author_fullname": "itsYaylor", "url": "https://www.reddit.com/r/AmItheAsshole/comments/prr1cq/aita_for_reporting_my_managers_hit_and_run/"}, {"title": "AITA for the tension in the Household?", "content": "Me and my girlfriend, withholding info at this time, are not on good terms. I never talk to my GF in any way to instigate an argument because I have seen first hand what the results are to say the least. \n\nOur biggest tension points are chores, washer, and the bed in decreasing order. \n\nWe do chores around the house overall and the purpose in my mind in the home is a Safe Space. While im lackadaisical, I don't let things bad or get the usual results from the absence of cleanliness. But my GF from being a germaphobe and the lack of division of labor, takes literally all the chores and does them. I told he she doesn't need to do everything and she can have \"her time\", but she always relents. I do my best but when I do try to get stuff done I am always \"corrected\", and it has hapoened numerous to the point that it rather be not done, than done. Defeatism basically.\n\nThe washer was a housewarming gift from my mother, but we noticed after waiting for a set of time, that it likes to recreate the scene from Madagascar's \"I like to Move It, Move It\". We have the money to fix it but backlogs and whatnot prevent us from doing so. She wants to buy a new washer, but I feel like this would be an insult towards my mother as she has done a lot through my life if i just gave it back. My GF spent the repair money from her grandparents accidentally, and wants to use my Server Money to buy a new one.\n\nWe both agree on a new bed, but again, when I think she needs proper sleep because the bed is a bit too small she angrily implies that I shouldve come to bed the night previous. We fight over blankets, and barely get enough sleep but the bed again is way too small. \n\nSo the reason im typing this? I do not want to be forced to spend money on a new washer, New bed, and she thinks I don't my part in the house. I do not have a lot money, but tonight in a stuper she said that we need to find out how much I have to spend on a New Washer, or Bed; along with me not \"doing my part\". I try to investigate the problems or help out but I am always hit with a brick wall. Im more agreeable on the Bed, but I never dissent on the others because of the literal fear of arguing with her on stuff that is necessary or lead to a breakup.\n\nThere literally nothing I can think of, or do to mitigate any of this. \n\nAITA?", "verdict": null, "score": 1.0, "created": 1632129006.0, "author_fullname": "ApostleOfChrist", "url": "https://www.reddit.com/r/AmItheAsshole/comments/prr2fe/aita_for_the_tension_in_the_household/"}, {"title": "WIBTA If i confronted my new boyfriend about his shitstains in the toilet?", "content": "Okay this is a bit of an awkward one, but I really didn't know where else i could post this and i'm feeling very stressed about it right now.\n\nI (21F) recently started dating a really good friend of mine (21M).  \nWe've known eachother for 2 years already before we decided to actually start dating.   \nWe used to work the same position at the same standard office culture type of company, where we were one of the few colleagues that were very young (&lt;20) and that's how we bonded and became workfriends.   \nWe mostly met for lunch everyday during breaks, discussed our lives, interests and had the most amazing banter.\n\nThis was all so great that during these 2 years our friendship blossomed further and further.   \nWe started meeting outside of work aswell and started doing all of these fun activities together.   \nWe even went to a family wedding together where I starred as his +1 and we started sharing more and more intimate details about our lives. Long story short, we became very very close.   \nThis all came to a beautiful peak when he confessed to me that he actually developed feelings for me and I realised that I developed feelings for him too.\n\nWe started dating officially two months ago and we are both delighted over how perfect everything is going. We really see a serious future and potential marriage for us.   \nCue in my surprise when I went to the bathroom to pee after he went to have 'a pee' approximately 15 minutes before me and I open the toilet to sit down and see gigantic shit stains in the toilet pot.   \nI was obviously disgusted and felt a wave of second hand embarrassment, because I didn't want the other people living in his house (he has 4 roommates who were at home) to think that it was me who crafted these shit stains into the toilet bowl   \nSo, I had a big sigh and minor panic attack, and then decided that it would be the best to clean it (yes i'm still disgusted and feel gross).\n\nSo I did that, and moved along with the evening.   \nAt that time i decided that it would be best to not say anything about it immediately, because multiple of his roommates were in the living room with us and I didn't want to put him in an awkward position.\n\nNow it's two days later and it's still a massive point of overthinking for me.   \nI never had the situation before where I went to the bathroom immediately after he went, so I have no clue if this is a normal or regular thing for him   \nI would find it a big turn-off though if it was him, especially since I also struggle with minor OCD which comes with a small obsession over hygiene (and, let's cut the crap: it's disgusting and you shouldn't behave like this at 21). \n\nMy problem is that i'm not really sure if it was him or if the shit stain maybe was already there (and was from one of his roommates) and he just decided that he wasn't going to clean his poop. \n\nWIBTA if I confronted my BF about this anyway, and if no, how can i do this in the best and least awkward way possible?", "verdict": null, "score": 1.0, "created": 1632129105.0, "author_fullname": "alextrona", "url": "https://www.reddit.com/r/AmItheAsshole/comments/prr340/wibta_if_i_confronted_my_new_boyfriend_about_his/"}, {"title": "AITA for ignoring my mother?", "content": "So recently I told my mother some life changing information that I hoped would make us closer. But instead she sided with the abuser. When I initially told her though she 100% supported me it’s only when she went back to her home did she start to doubt me. Now my abuser is fully in her life again and she refuses to acknowledge any of the things I told her and that ,”she believes that I believe it happened”. So i just started ignoring her. I don’t answer her calls or her texts except once in awhile to tell her i’m fine. But today she called me and I ignored it and then she texted me that I was being a bad daughter by ignoring her and now i’m questioning myself. So AITA?", "verdict": "Not the A-hole", "score": 1.0, "created": 1632129418.0, "author_fullname": "sunnysunshiine", "url": "https://www.reddit.com/r/AmItheAsshole/comments/prr5d4/aita_for_ignoring_my_mother/"}, {"title": "Am I wrong here? Babysitter’s edition.", "content": "[removed]", "verdict": null, "score": 1.0, "created": 1632129452.0, "author_fullname": "Fun_Presentation_542", "url": "https://www.reddit.com/r/AmItheAsshole/comments/prr5lh/am_i_wrong_here_babysitters_edition/"}, {"title": "AITA, babysitter’s edition.", "content": "I was hired to work a babysitter’s gig for today. The family seemed really nice and had good reviews. However when I got there, there was no structure. There was no clear schedule what I was supposed to do, I asked about it ten times and yet nothing. They also wanted me to cook for them and clean. Sure, no worries but this wasn’t mentioned and there was nothing available. When I asked about it, they were like the babysitter handles everything. The toddler was supposed to be really easy but she wasn’t, at all. Both parents were in the same room as me so I also felt real awkward. Anyways, I was supposed to be paid for 8 hours but they sent me home after 3. Am I wrong here for still wanting to be paid for 8, considering I declined another job for them and they asked me to be there for 8? I freed up my day for them, and paid my own gas and parking.", "verdict": "Not the A-hole", "score": 1.0, "created": 1632129529.0, "author_fullname": "Fun_Presentation_542", "url": "https://www.reddit.com/r/AmItheAsshole/comments/prr65l/aita_babysitters_edition/"}, {"title": "AITA for not going to family meetings", "content": "A little background first, I(26F) got a hereditary disabling disease that changes scale everyday (hEDS also known as hypermobile Ehlers Danlos Syndrome). This causes many issues through the day like subluxing and luxating joints, muscle ruptures, muscle inflammations, GI problems, chronic exhaustion and fibromyalgia. Those are the ones that appear daily. As it is hereditary my grandma, aunts, mom(65), and my 2 other sisters(35 and 41) have it too but not as badly as i do. As i am the only one of my aunts,mom and sisters that needs to use a wheelchair and crutches from time to time and other tools. Also have a lot of medicine to keep myself together intern and extern.\n\nSo this happened a while back but i keep getting complaints from my mom that i don't attend family meetings like birthdays the whole year round. And i kinda feel guilty and an AH.\n\nLatest example was my grandma's birthday, she got close to 90. I had subluxed my hip and shoulder few days before and had very little sleep due to the pain and GI problems because of the stress from the aforementioned issues. So i told my mom i wasn't going. She said that i should go as GM is growing old and it could be one the last times i get to see her. And i should attend to make GM happy.\nI replied that i was very tired because the lack of sleep due to pain and rather spend the days resting and recovering and keep my health in check.\nShe kept pushing by repeating that GM is growing old and we don't know how much longer she'll be around and that i barely visit her. (GM is healthy tho albeit with some physical problems which she has a wheelchair for)\nAt that point i grew tired of her using this against me(almost every time when it's about GM). So i rudely applied that she should stop trying to guilt me into going. She yelled at me that she wasnt trying to guilttrip me but just stating facts.\nI then told her that it is a fact that she's forcing me to go out for dinner at a restaurant and neglect my health for a birthday to please her.\nShe got mad and told me to think things over and expects me to go. I just turned around and went back to where i came from.\nI called GM afterwards telling her i probably won't be coming to her bday because of health issues. She told me that it doesnt matter and i should take care of myself. \n\nThe bday came along and mom woke me up, calling to know if i was going to go. I told her i was still in cruciating pain and didnt sleep the past days as i couldnt find a position to sleep in and had migraine because the lack of sleep. Along with some muscle inflammations due to subluxing hip and shoulder. She kept asking if i couldnt try and i told her a firm no.\n\nAfter the dinner she came back home and i asked how it went. She basicly told me i should have been there but the dinner was alright. \n\nAlthough this happened a while back i still feel guilty and an AH for not showing up. AITA?", "verdict": null, "score": 1.0, "created": 1632129574.0, "author_fullname": "Nazrada", "url": "https://www.reddit.com/r/AmItheAsshole/comments/prr6h7/aita_for_not_going_to_family_meetings/"}, {"title": "AITA for starting an argument with my SO?", "content": "So I’ll just get straight to the point. My SO was sleeping and I decided to go to the store I wrote a note just in case she woke up  stating where I went and what time I left. I left the note on a chair in our living room next to the front door. As I’m pulling back in to the apts we live in 3 minutes after I had originally left (since the store was down the street) she text me asking me where I was. I told her I went to the store but I was pulling in and it had just been three minutes since I had left. It was weird because she was just sleep? I mean I was up since I’m ALWAYS up at this time but yeah. Anyways I walked in and she was on the couch for some reason(trying to argue). She asked what I went for I didn’t need anything and I told her what i got that was that. After that however she just sat there in the living room on the couch for a good 5 minutes and I asked what’s the problem 3 times she didn’t say anything which aggravated me. I started asking her why was she in the living room wasn’t she just asleep and what not and she just continued just sitting there acting like she has some kind of authority over me or something idk but that’s how It came off so I told her just to back to sleep and she was being annoying and continued to not say anything so I started getting louder. It was just so aggravating. Anyways yeah we ended up going back and forth after I got louder and yeah, stupid argument for sure but am I the asshole for telling her to go back to the room and go back to sleep? I felt like she was just being a pest at that point, she was sleeping so perfectly then we were arguing out of no where.\n\nTl;dr gf got mad I left to the store while she was sleep I got back home and she stayed in the living room aita for telling her to go back to the room and go to sleep?", "verdict": "Asshole", "score": 1.0, "created": 1632129659.0, "author_fullname": "Stonedpheonix18", "url": "https://www.reddit.com/r/AmItheAsshole/comments/prr72x/aita_for_starting_an_argument_with_my_so/"}, {"title": "AITA Some context this happened when I was about 12 and I still couldn't really control my anger at this time and it was my first year in highschool", "content": "So on one lunch break with my friends some of the entitled girls (eg) in my grade came around we i was eating at the time and my friend had just left our spot to play and just as they left the (eg) started just being entitled year sevens and calling me names. then after a bit one if them threw part of an apple at my head so I got up already annoyed and they it back at them a couple of time then sat back down then they threw it again so I threw it at them again aswell then the threw it the third time and it landed in my lunch container that I had my food in so I just lost and threw the container at them. then I went pick up the container one of the step on my container and snapped of the clip on part of the lid so I push her leg of with my foot then she put put me in a terrible half choke hold so I kicked her leg back and my forearm pushed against her stomach to get out and my arm must of brushed her breasts by accident. Then when I got free and sat back down she said I grabbed her breasts and all her friends started yelling it aswell then a teacher on duty sorted it out and told them to go away and go tell a deen if they want then they left. Then when we where in class they started saying it again the teacher wouldn't even listen to my side of the story and sent me to rtc but I was already passed so I just sat there. He finally partially listened to my side of the story then he sent the girl that put me in the headlock to go to rtc and tell them what had happened then two minutes later he sent me up she told her side to the deep then I told mine she restated that I must have accidentally done it (even though some parts of her story was still a lie) we came to and agreement and both said sorry.", "verdict": null, "score": 1.0, "created": 1632129690.0, "author_fullname": "scrobling", "url": "https://www.reddit.com/r/AmItheAsshole/comments/prr7at/aita_some_context_this_happened_when_i_was_about/"}, {"title": "AITA for not keeping a potentially dangerous secret from my friends because another asked me to", "content": "First post on Reddit so take it easy on me \n\nI 24M have a 22F friend she’s been on again off again with a 23M for a few years now, and they’re not good for each other at all.\n\nOver the years he has mentally manipulated her, bullied her, and also butted heads with several people in our friend group (I can post more of those in a sub Reddit that fits it). \n\nEvery time one of these situations happen she asks me to keep it a secret from our friend group, to keep the peace and not upset anyone. Normally I say fine under the assumption she will handle it.\n\nThis time things went too far and I don’t think I should keep this secret. A week or so ago I got a phone call from my friend, saying she needed help/advice. I thought it was going to be the normal “he said/did this” thing. I was wrong, she told me he had threatened himself because she wouldn’t cuddle or have s** with him. She said he waved around 3 items, 2 of them were nothing but the last was a knife. The moment I heard that I told her to call the police, she had to hang up on me because he came back and had another friend 22M call the cops since they were in the same county. The cops showed up and took him to the hospital for evaluation. \n\nLike I said over the years I’d kept my mouth shut on things like her being mentally abused to physically grabbed on a few occasions. Because she said she’d handle it, I assumed this was the last straw but 2 days later I get a call saying he’s not banned from the house and asking me to not tell anyone about the incident.\n\nAfter talking it over with my GF 20F, I came to the conclusion that this isn’t some little thing that could only affect her now. This is potentially dangerous. Our friend group has a gathering in a week and a half (restrictions have died down where I am) and I told my friend if she has any intention of bringing him around any of the friend group she has to tell them about the incident or I will. I believe the guy needs help, but I also believe in the current state everyone should have a say as to wether or not to be around him. No one in our friend group likes the guy and this would be the final straw. And to be clear, I want the info on the knife being public knowledge not the hospital trip. \n\nTLDR guy scares gf with knife, I want to tell our friend group about potential danger", "verdict": "Not the A-hole", "score": 1.0, "created": 1632129822.0, "author_fullname": "fooortquad", "url": "https://www.reddit.com/r/AmItheAsshole/comments/prr88q/aita_for_not_keeping_a_potentially_dangerous/"}, {"title": "AITA for reporting an eBay seller just because they got cold feet?", "content": "I was looking for an item on eBay.  I saw the item I want in the auction.  I thought maybe I could one-up the bidders if I message the seller and strike a deal with him.  So, I did that.  The item itself is worth 50-60 dollars, so I was hoping I could get it for at least 40 not including the taxes.\n\nOn the same day the seller messages back and told me that he/she could part ways with this item if I agree on 10 dollars and pay for shipping.  I was shocked and reply right away.  The seller set up the offer and I purchase it right away.\n\nThe next day almost 24 hours the seller told me they desire to back out of the deal since the auction was gaining steam.  I was livid as my payment already went through and now the seller made the tracking numbers already and now wants to back out?!  I wrote an email telling the seller how disappointed I was and asked to strike another deal.  He did not respond, so I processed to warn him about how I was going to contact support as that was the only thing I thought was appropriate to do since the seller breached eBay policy.  I thought me warning the seller would be a gesture of fairness to him/her even if they did not treat me with the same fairness.\n\nWell, they left a feedback on my account stating how much of a jerk I was and how people should avoid selling things to me.  like what?\n\nAm I the asshole for reporting him/her whatever I did may me seem like an ass?  I feel like I did everything accordingly.  I did not call the seller any names.  I mean, I sold things on eBay and there were times where the same items were rising in values I did not back out but still shipped it.", "verdict": null, "score": 1.0, "created": 1632129977.0, "author_fullname": "NatureAfraid4253", "url": "https://www.reddit.com/r/AmItheAsshole/comments/prr9bi/aita_for_reporting_an_ebay_seller_just_because/"}, {"title": "AITA for not letting my dad's girlfriend come for a meal with us?", "content": "[removed]", "verdict": null, "score": 1.0, "created": 1632130078.0, "author_fullname": "Rhia0_o", "url": "https://www.reddit.com/r/AmItheAsshole/comments/prra1s/aita_for_not_letting_my_dads_girlfriend_come_for/"}, {"title": "AITA For not letting my dad's girlfriend come for a meal with us?", "content": "[removed]", "verdict": null, "score": 1.0, "created": 1632130257.0, "author_fullname": "Rhia0_o", "url": "https://www.reddit.com/r/AmItheAsshole/comments/prrbeb/aita_for_not_letting_my_dads_girlfriend_come_for/"}, {"title": "Aita for telling my family that I won't wash the dishes if they don't clean out the plates first?", "content": "I (16f) live with my mother and younger sister(9f). So basically all 3 of us in the house has chores and mine unfortunately is washing the dishes, now I've always hated doing the dishes but Ive found a way to make it fun by using earphones and jamming out while I wash them lol\n\nNow to the problem whenever I wash the dishes I've been finding plates with leftover food in the sink and it's absolutely disgusting.. I've asked both my sister and mother countless times to clean out their plates before putting them in the sink but nothing happens, most of the times I have to go and pick up empty cups from both my sisters bedroom and my mom's bedroom but I don't mind that, it's just the food in the plates that annoys me... I know anyone that does the dishes knows exactly how disgusting it is to get food out of the part where you put the plug in once the water drains out.... So today after countless times telling them to please empty out their plates, I told them I wouldn't be washing the plates that has anything in them and they can do it themselves since they don't know how to do something as simple as cleaning out their own plates/bowls\n\nMy mother just said it's my responsibility to do the dishes and anything dishes relates so I shouldn't complain\n\nAm I the idiot here?", "verdict": "Not the A-hole", "score": 1.0, "created": 1632130394.0, "author_fullname": "Igotstungbyawasp", "url": "https://www.reddit.com/r/AmItheAsshole/comments/prrceg/aita_for_telling_my_family_that_i_wont_wash_the/"}, {"title": "AITA for letting my sister borrow a necklace that is a family heirloom of my ex's?", "content": "I have 4-month-old twins with my ex. He had an awful reaction to finding out I was pregnant (demanding I get an abortion, accusing me of trying to trap him, etc.) so we broke up and went NC but after our children were born, he had a change of heart. He wanted me to give him a second chance and started sending me gifts to try to “woo” ~~buy~~ me back. \n\nOne gift was a necklace that was passed down from the mother to the wife of the oldest son of the oldest son. I tried to reject the gift, but he kept insisting I take it and said it was a tradition in his family. I pointed out that we weren’t married, and he said I was still the mother of the oldest grandson so by right I should have it. I only took it because he kept insisting. \n\nMy sister went to a party last week and asked to borrow the necklace. I let her because he had insisted it was mine, so I thought it was fine to do with it whatever I wanted to and since it’s too fancy for me to wear, I thought it was nice for someone to wear it since it is very beautiful and shouldn’t be hidden in a box.\n\nMy ex and his family saw pictures of my sister wearing it and they flipped out. My ex told me he had given me the necklace to show he was serious about making amends and he wouldn’t have if he had known I would give it to just anyone to wear. His family have asked for it back so they can keep it safe for me. He’s been acting cold towards me since and I’m starting to feel awful.\n\nAITA?", "verdict": "Not the A-hole", "score": 1.0, "created": 1632130500.0, "author_fullname": "exsfamilyheirloom", "url": "https://www.reddit.com/r/AmItheAsshole/comments/prrd4v/aita_for_letting_my_sister_borrow_a_necklace_that/"}, {"title": "AITA for thinking about cutting my holiday short because my family is disfunctional?", "content": "[removed]", "verdict": "TL;DR", "score": 1.0, "created": 1632130922.0, "author_fullname": "Rosita29", "url": "https://www.reddit.com/r/AmItheAsshole/comments/prrg7p/aita_for_thinking_about_cutting_my_holiday_short/"}, {"title": "AITA For calling my mom, then getting mad at my (hopefully) undeserved punishment?", "content": "Okay guys so yesterday my mom took mine and my sister’s phones away since we were chilling in bed using them at 2am on a weekend, even though she didn’t mind before. There was no warning beforehand or order not to use them, she just took them but anyways that’s not even the important part.\n\nToday we weren’t allowed to use them for the whole day and she only let me use it once in order to take a picture of my school notes and turn them in. She’s always been more lenient with my younger sister (who is kind of known as a trouble child to EVERYONE else BUT my mom?!) so I knew this would happen but I walked into the guest room and saw my sister USING HER PHONE WHILE WATCHING OUR BABY SISTER. My mom asked what we were doing in there and she saw that my sister had been using her phone, she didn’t care? That’s when I knewww my mom had given her permission. I got upset and asked my mom why my sister had been allowed but not me and she said whatever use yours too I guess.\n\nLater on in the day she was bitching about how we didn’t really help with our siblings (Fucking Lie) while she was doing her hair like we said we would. I said “well you didn’t let my sister not use her-“ I was going to finish by saying “phone like you said you would”, but I didn’t finish my sentence because I knew my mom was a bitch and she would punish me. She said “no just finish your sentence, tell me” so I said “do you promise you won’t get mad and take our phones again if I tell you?” She said she promised but I was a dumb bitch for believing it. Anyways I said “earlier you said you wouldn’t let us use our phones but you took the punishment off of my sister” (Which is very common for my mom to do). She then snapped and said “well I had no choice she was watching the baby” but I told her I had watched the baby too and she didn’t let me use it. My mom said “she had to help me with the baby so I told her to put on ABC Kids TV” absolute bullshit.. my sister was on TikTok and she saw. I then asked my sister what happened (In front of my lying ass mother) and she said the truth and told me that my mom said she could use it.\n\nMy mom went ballistic after being caught in her lie, and started victimizing herself. She was talking about how she wasn’t respected, her kids ruled her, she’s such a nice mom. And then she (omg what a surpriseeee) took our phones away again. She also said “if you want a mean mom I’ll be one” I told her she already was a mean mom and a liar too. Anyways we argued much more than that but that was the main point.\n\nTLDR: My mom punished my sister and I, and then lifted the punishment off of my sister so I called her out after she promised she would not punish me but she did anyways and now I’m pissed. AITA?", "verdict": null, "score": 1.0, "created": 1632032986.0, "author_fullname": "Unlucky_Phone_1903", "url": "https://www.reddit.com/r/AmItheAsshole/comments/pr2ryb/aita_for_calling_my_mom_then_getting_mad_at_my/"}, {"title": "AITA for not confronting someone who offended me indirectly?", "content": "Here's the thing I'm a black guy M21, there's this girl that met on tinder a couple of months ago, she'd just broken up with her bf by the time we started talking and was still pretty heartbroken, I was also going through a delicate moment in some other aspects of my life, so basically we ended up helping each other out and became good friends along the way. I had invited her over a few times and she would always come by, so one day she was going to have a family cookout and invited me as her guest, according to her she just wanted to make up for me, since every now and then I would have her over and treat her respectfully, so she'd like to have me there, well I confess I was really reluctant to go but after she insisted so much I ended up giving in. When I was there everything was going pretty well, that's when a member of her family (brother) makes a playful coment, he says something along the lines of ''she must be into you since her sisters are in a relationship with black guys, it runs in the family'' it didn't bother me that much but what my friend said next hit me hard, she was like '' I'm not even into black guys to start with so that won't happen'' she had told me before that she's into white guys and it's just her personal preference in which I respect, I just felt embarrassed and humilliated bc I was among strangers and I was already nervous and it didn't help me at all her brother's comment and her lack of support, Am I overreacting here? Help me please my fellows redditors.", "verdict": null, "score": 1.0, "created": 1632032989.0, "author_fullname": "Lekstor", "url": "https://www.reddit.com/r/AmItheAsshole/comments/pr2ryt/aita_for_not_confronting_someone_who_offended_me/"}, {"title": "AITA for not giving priority to my wife during my mother’s surgery", "content": "My (33) wife (33) decided to schedule an elective procedure 2 days before my mom’s surgery that was scheduled 2 months ago at a hospital which is in a different state . The day of the surgery, I was occupied with ensuring my mother gets to the hospital on time, takes pre-surgery meds, gets checked in, have an interpreter for her (English is her second language). Now halfway during the day of the surgery, I receive a text from my wife that she is not feeling well to which I casually asked how is she doing? \nNow my wife starts yelling at me, gets angry at me for not paying attention to her and her needs when she clearly knew months in advance of my mother’s surgery. \nAlso BTW, after her elective procedure she moved in with her brother and SIL so that they can take care of her. \n\nPlease tell me if AITA for shifting my attention from her for a day and give my attention to my mother during her surgery? Also, it’s 3rd day since my mom’s surgery and she is still mad at me.", "verdict": null, "score": 1.0, "created": 1632033005.0, "author_fullname": "baby-help", "url": "https://www.reddit.com/r/AmItheAsshole/comments/pr2s36/aita_for_not_giving_priority_to_my_wife_during_my/"}, {"title": "AITA for kicking my husband out of our house ?", "content": "This happened a few days ago on Sunday.\n\nLately my (26F) husband (32M) has been coming home late from work. We have been married for 4 years. He always makes excuses that he's working overtime and when he isn't he says that he is hanging out with his friends. I want him home so he can help around with our 8 month old. I work part time. My mom is the one who watches my son while Im at work and when I come home she leaves. Taking care of a baby is hard by yourself and I want my husband to help since our son is his child too. I got tired of him coming home late and asked if I can hang out with these friends. He was quiet then with an attitude told me I can come. I tried to calm myself saying that Im overreacting and I shouldn't act like this. I hired a babysitter for the day bc I didn't want to bother my mom. We didn't really talk on the car ride there. When we get to his friends house it was very awkward. I wasn't really close with these people and so it was weird there. Everyone there was staring at me and I was confused as to why they were looking at me. The hangout was just a BBQ and a football game. Anyways when I finally felt comfortable I actually had a good time and met a really nice girl. She also is a mother and her baby is 10 months. We both aren't into football so We talked majority of the time. When the football game was over I go and wanted to see what my husband was doing. When I go to the living room I saw a girl basically cuddling my husband. She was smiling at me and gave me a smug look. I  got angry. He told me that she was just an old friend from high school. I then find out that they are coworkers as well. So my husband and I were having a fight in front of all his friends. Then a friend of his got tired and said that my husband was cheating on me with that girl. He said that everyone knew and that's why Im not invited to these hangouts. Everything suddenly made sense to me, my husband coming home late, his friends staring at me since they knew, and my husband lying. I told my husband he wasn't allowed back inside the house and not to come near me or my son again.\n\nI felt so angry and felt stupid that there was so many red flags that I missed. I was angry and I wasn't thinking. So I packed most of his things and threw them outside. Since he wasn't going to live in this house anymore. He's been calling and texting me but I've been ignoring them. I have no motivation to do anything now. My sister has been a great help and she told me that she's moving in to help me and my baby. Im planning on getting a divorce. I don't want to stay married with him. But we have a baby together and I don't know what to do. I want my son to go up in a house with both his parents.\n\nHis family called me and are saying that im a asshole for kicking him out of the house since it is his house as well not just mine. But my friends and family say im not because he's a cheater and he never really was involved in our sons life.\n\nSo AITA?", "verdict": null, "score": 1.0, "created": 1632033277.0, "author_fullname": "throwaway283791328", "url": "https://www.reddit.com/r/AmItheAsshole/comments/pr2u19/aita_for_kicking_my_husband_out_of_our_house/"}, {"title": "AITA for throwing up on my bathroom floor instead of in the toilet", "content": "Warning. Just discussing a lot of gross stuff. Unsanitary\n\nSo I (16F) started having huge stomach issues a few days ago, very bad diarrhea. And on top of that, my period also started. Very messy and disgusting. I had terrible cramps and felt nauseous, but every month I feel nauseous and like I'm going to throw up, however it's only happened once or twice. So I'm sitting on the toilet crying in pain, and then it hits me that I'm gonna vomit. If I get off the toilet to throw up in it I'm gonna get blood and shit on the floor, if I don't I'm gonna throw up on the floor. So I throw up on the floor. I leave the bathroom shaking, crying, and dizzy once everything calms down and go tell my dad (42M) that I puked. He starts shouting at me and telling me I'm stupid. Telling me I should have thrown up in the toilet. I explain that I couldn't do that, and he tells me I'm stupid again and I should have brought something to throw up in. I didn't think to do this because like I said earlier, I feel like I'm gonna throw up every month, but it rarely happens.\n\nHe just kept shouting at me about it and telling me I was stupid and because I was the oldest of his kids he shouldn't have to be telling me to do this stuff. So should I really have thought to bring something? Or what should I have done? Was I at fault?", "verdict": "Not the A-hole", "score": 1.0, "created": 1632033366.0, "author_fullname": "Karasu_145", "url": "https://www.reddit.com/r/AmItheAsshole/comments/pr2ums/aita_for_throwing_up_on_my_bathroom_floor_instead/"}, {"title": "AITA if i hit up the girl i cheated on my ex with?", "content": "It happened over a year ago, haven’t talked to her since. I just broke up with my gf about a month ago and I’ve just been lonely and literally have no one else to kick the tires on.", "verdict": null, "score": 1.0, "created": 1632033404.0, "author_fullname": "thisshitslapsnocap", "url": "https://www.reddit.com/r/AmItheAsshole/comments/pr2uw0/aita_if_i_hit_up_the_girl_i_cheated_on_my_ex_with/"}, {"title": "AITA for wanting my blanket back?", "content": "Let me start by saying I know I was definitely acting like a little bit of an AH during my initial reaction to this situation. I mostly just want an opinion on everything else going on. \n\nMy boyfriend (25m) and I (26f) currently live with my mother, where we give her $1,200/month, as well as paying for our own food, etc. She asked us to move in with her because she needs our rent money to help with her house payment. I think this is important to know.\n\nMy boyfriend and I sleep with a portable air conditioning unit (that we bought) on high because we both tend to overheat while we sleep. My mom has hinted on a few occasions that she thinks we keep the room too cold, but has never spoken to us directly, so I kept it on the same temperature because it’s what makes me comfortable. However, the other night I wasn’t feeling well and decided to put a (relatively new) heavier blanket on while I slept. This blanket was left on my bed when I went to work at my overnight shift.\n\nWhen I got home the next morning, I couldn’t find the blanket. I texted my boyfriend and he hadn’t seen it since before he dropped me off at work last night. I got annoyed and marched into my mom’s room to ask her where it was (it was 7 am). Long story short, she took the blanket while I wasn’t home because she “was planning to return it” and spent fifteen minutes refusing to tell me where it was because “I wouldn’t need it if I turned the air conditioning down”. She eventually gave in after I told her I wasn’t leaving her room until she told me. It was in the office closet, back in its original packaging. She claims it was because “there was no room anywhere else”, but we never use this closet, so I have no doubt she was just hiding the blanket.\n\nI know it was a dick move to wake her up at 7 am to confront her and I’ve already apologized for it, but it’s been 3 days and she’s still sulking. AITA?", "verdict": "Not the A-hole", "score": 1.0, "created": 1632033691.0, "author_fullname": "QueenCurlyQ", "url": "https://www.reddit.com/r/AmItheAsshole/comments/pr2wtk/aita_for_wanting_my_blanket_back/"}, {"title": "AITA for being stuck in a love triangle?", "content": "I met Robbie in the psych ward. He was coming off meth and I’m healing from ptsd and depression. We were incredibly vulnerable and honest with each other. Once we got out we spent the last 45 days together. Inseparable. \n\nProblem arises. I go to Therapy. Group therapy. I meet Jeff. He’s what I’ve been looking for. He’s a great father. He’s upset about his home life. He raises kids that aren’t his. He’s amazing. But he’s fresh out of a relationship. Hence the group therapy. \n\nI’ve fucked up. I love Robbie. He’s my soulmate. He gave me hope when I felt hopeless. He makes me laugh until I don’t need to cry. He smiles at me and I take a picture to remember how gorgeous he is. \n\nJeff just can’t figure out what he wants. I’m falling for him. \n\nI’ve now gotten myself in a stupid love triangle. It’s never ending of overthinking. I can see potential with each of them. But I really really want to just be happy. \n\nAm I the asshole for taking two vulnerable men and making them fight over me? Because I can’t eat. I can’t sleep. The guilt is tough. I know I love attention. When one doesn’t give it to me I’m sad. When one makes me laugh, I forget about the other one. \n\nI feel like an qsshole. Am I?", "verdict": null, "score": 1.0, "created": 1632033723.0, "author_fullname": "giggles2121", "url": "https://www.reddit.com/r/AmItheAsshole/comments/pr2x0j/aita_for_being_stuck_in_a_love_triangle/"}, {"title": "AITA from banning my coworker from my period products stockpile?", "content": "Disclaimer: mobile, non-native speaker\n\n\nI work at a medium sized office, I know everyone on my floor. We have semi-open space set up and only one set of men’s and women’s toilets (they are large though), so we meet each other all the time and us women run into each other at the toilets. \n\n\nDue to this, my coworkers just know that my periods are wild (it’s not like I announce it, it’s purely because of how often I go to toilet during those days, always holding a pad or a tampon) and that one entire drawer if my desk is just a stockpile of pads and tampons. Of course, if a fellow coworker has a period emergency I am happy to give her a pad or tampon or a over-the-counter painkiller. One pack of ten pads costs like 120 out of my 20k currency (not US dollars), so while it isn’t cheap, it’s affordable. And usually they don’t ask for more than a pad per month. \n\n\nUsually.\n\n\nOne coworker asks for at least one pad/tampob a day during each of her periods. Which is a lot, in my opinion. As a woman with heavy flow who sometimes goes through one pad in an hour I understand, but the thing is… I know for a fact she cannot bleed. It is anatomically impossible. The entire office knows it. I started locking my period drawer since pads would dissapear randomly and others told me she was the one taking them.\n\n\nSo this week when she ran up to my desk asking for a pad since her period was killing her, I opened my stacked drawer and offered her a painkiller to ease the cramps. She declined saying her periods don’t hurt, she just needs the pads. I tried to be as sensitive as I could and told her that she costs me an entire pack of pads or tampons a month, it’s too much, she has to get her own… she replied she has her own but her period is so irregular she needs one NOW since she already used up her one spare. I told her that I am sorry but that I don’t believe she needs them… for reasons I don’t want to get into. She immediatelly got what I was getting at, stormed to the HR.\n\n\nI have a meeting with the HR tomorrow. Some coworkers are telling me I was being rude, others said I did the right thing by speaking up and that she must have been waiting for someone to finally call her out so she can cause a ruckus.", "verdict": null, "score": 1.0, "created": 1632033850.0, "author_fullname": "jdjdndjjcjcjcj", "url": "https://www.reddit.com/r/AmItheAsshole/comments/pr2xwj/aita_from_banning_my_coworker_from_my_period/"}, {"title": "AITA for not stopping my dog destroy precious photos?", "content": "Last year,  my parents got me a dog for a combination birthday/Christmas/Finished school present.They paid for the dog, but I pay for every other expense. Before we got her, we all agreed that she would be my responsibility. They are not going to walk her, or feed her or train her etc, that's all on me, she's my responsibility.\n\nI keep my end of the bargain. I try to walk her at least twice a day or more. I get up early, feed her, play with her, buy everything. I am at Uni and have a part time job. When I'm not at home, she spends all of her time outside. 90% of the time she is well behaved, but she thinks its a game to escape. Most of the house is quite messy, so the only room she is allowed in is the family room.\n\nHowever, I did not realise that they literally were going to refuse to have anything to do with the dog. This shocked me as they both love dogs. They refuse to play or pat her, or stop her from doing bad things. Some examples of situations where I think they should have helped out.\n\n1) our house backs onto the bush and mum was coming back from a walk and opened the gate. Dog escapes. I was at Uni at the time. Mum doesn't look for her or contact me. She closes the back gate. When i get home, I find her cold, wet and stuck in a creek bed.\n2) Dad was outside, and had laid down some bait earlier. I was unaware. Dog goes out to pee, dad sees her sniff the bait. He doesn't tell me she might have eaten the bait. I go to bed, but I come back out for a drink. I see the dog covered in vomit and poo, whimpering. She almost died\n\nI try keep her as safe and secure as possible but some things are beyond my control. But I have convinced the parents to tell me when something happens.\n\nBecause of lockdown, uni is online. I was in the office, taking an exam. Mum lets the dog escape, and comes to tell me in the middle of my exam. Due to the exam, I yell at her \"Can't you help out just this once? I'm in the middle of an exam, go get some treats, find the dog and call her back, it's easy!\" Mum leaves the room. Given she didn't say \"no\" I thought she went to retrieve the dog.\n\nAn hour later I finish and discover that mum didn't go get the dog. Long story short: the dog had chewed the only existing photos of my dad and his mum, which my dad had left on his bedroom floor. Dad went into a rage, blaming me and the dog. Everything is my fault because she is my dog. I put my foot down and said \"everytime she escapes, it's because of you, she never escapes when I am leaving, you never help, and mum had given me the impression that she would get the dog during the exam!\n\nI've spent this weekend cleaning the office of mum and dad's junk, so she can be with me at all times, even during study/class. It's not fair on her to be cooped up instead of out in the yard, but I am at a loss of what to do. If I could move out of home I would, but I can't\n\nAITA for not stopping my dog destroy my dad's pictures? She's my responsibility.", "verdict": "Not the A-hole", "score": 1.0, "created": 1632033871.0, "author_fullname": "robinsond2020", "url": "https://www.reddit.com/r/AmItheAsshole/comments/pr2y23/aita_for_not_stopping_my_dog_destroy_precious/"}, {"title": "A woman wanted me to be her sugarbaby, but I'm a minor...", "content": "[removed]", "verdict": null, "score": 1.0, "created": 1632034065.0, "author_fullname": "aquilanoir", "url": "https://www.reddit.com/r/AmItheAsshole/comments/pr2zc4/a_woman_wanted_me_to_be_her_sugarbaby_but_im_a/"}, {"title": "Am I the toxic one or is this just college??", "content": "[removed]", "verdict": null, "score": 1.0, "created": 1632034150.0, "author_fullname": "AmazingAnimeGirl", "url": "https://www.reddit.com/r/AmItheAsshole/comments/pr2zx1/am_i_the_toxic_one_or_is_this_just_college/"}, {"title": "AMITA or is this just college??", "content": "[removed]", "verdict": null, "score": 1.0, "created": 1632034210.0, "author_fullname": "AmazingAnimeGirl", "url": "https://www.reddit.com/r/AmItheAsshole/comments/pr30bx/amita_or_is_this_just_college/"}, {"title": "AITA or is this just college??", "content": "Hello I am once again here to rant about college. Idk if im the toxic one in this situation I genuinely feel like im not but I've ran into so many unpleasant people im starting to wonder if im the problem. Basically I ended up at these guys' dorm with a group that included two other girls we talked about various things all night and I really got along with one of the guys! Well one if them was talking about making a Tinder and he was asking what the girls opinions were. Well, the one thing that came to my mind was fish pics. I told him it was a red flag 😭😂 and another guy immediately jumped in saying he has fish pics and he's gods gift to the planet and that no one asked for my opinion (even though someone else literally did) the second thing we were talking about was porn we had a VR set so we wanted to see if it could be set up on the tv. The one guy who was controlling it said the name of a pornstar and that she was his go-to. I JOKINGLY laughed and said \"wow you know her name you must watch a lot of porn.\" He responded with everyone does and I was like \"well not everyone knows the name or watches the same one everytime.\" He immediately lashed out and said it was his dorm and that he didn't want to hear my shitty opinions and if I was going to be a \"fucking bitch\" I could leave. I didn't even want to engage so I just stood up and said  \"this is really toxic im leaving\" and the friend that I came with just said okay bye. Like....its literally my birthday and it was 2am I wouldn't let her walk home intoxicated at 2am to stay with random toxic men. I don't know if she's really even my friend cause that's a major no. Anyway I don't know if im the toxic one or if im just having bad luck with people in college this seems like a case of men who can't take jokes made by women or their opinions this whole situation was just so weird.", "verdict": null, "score": 1.0, "created": 1632034262.0, "author_fullname": "AmazingAnimeGirl", "url": "https://www.reddit.com/r/AmItheAsshole/comments/pr30pa/aita_or_is_this_just_college/"}, {"title": "AITA for not buying enough food for everyone?", "content": "I (20) recently got a job babysitting kids from the neighborhood and I’m making enough money to buy some extra things for myself, like clothes, jewelry, but mostly food.\nI get take out whenever I don’t feel like cooking, and I always make sure to get a little extra for anyone at home who also wants to eat, but I can’t go around asking everyone if they want something for themselves since I’d have to pay (i live w my parents, grandma, 2 aunts, and 3 cousins), and I can’t afford to spend more than $400MXN (or $20US) every time I get take out. \nMy family gets it and don’t expect for me to order food for all of them, but not my aunt C (38). She has 2 kids (2 &amp; 4) who constantly ask for my food. I get it, they’re kids and want to try out new things, but giving them a little is very different from buying them entire meals, and that seems to be a big issue with my aunt C.\nLast weekend I ordered chicken wings for me and my older cousin L (18)(He paid his part) and 12 pieces extra for the rest of them.\nL and I ate, calmly and went out for a walk, but when we came back, hells had arisen at home. My cousins were crying, my aunt had her angry face on, and my grandma was holding her head as when she gets headaches.\nWhen we asked what happened we expected very bad news, but no, my aunt was only screaming (at me specifically) for starving her kids.\nShe said that what I gave them to eat wasn’t enough for a 4 year old and I wasn’t decent enough to order the baby (2) some appropriate food for her age. \nI told her I wasn’t responsable for feeding her children and I was just trying to be nice by giving them at least a little of what I had, but she pulled the babysitter card and told me since I was one, I should know that kids need to eat more than what I offered them, so I was deliberately starving them and eating in front of them to have fun.\nL immediately ran from the scene and my aunt kept yelling at me while the kids cried and my grandma pretended to hear nothing, until I exploded and told her that if she wasn’t going to cook for everyone, clean the house or at least wash her disgusting kids’ dishes, she didn’t have a say in anything else (I admit I may also have called her a pendeja and estúpida vieja somewhere in the conversation)z\nWith that she became more furious telling me that I was an asshole for being selfish and that she had enough work being a mom of two. \nMy grandma stopped the fight by calling my mom on the phone to work and now I’m the one who’s in trouble, grounded without computer, video games or take out for 3 weeks and, to top it all off, I’m also grounded from babysitting, while my aunt got a free pass and take out that my dad ordered for her and her kids.", "verdict": null, "score": 1.0, "created": 1632034291.0, "author_fullname": "mshellsm", "url": "https://www.reddit.com/r/AmItheAsshole/comments/pr30wz/aita_for_not_buying_enough_food_for_everyone/"}, {"title": "AITA for deciding to cut contact with my long distance friend?", "content": "[removed]", "verdict": null, "score": 1.0, "created": 1632034429.0, "author_fullname": "BookWyrm9402", "url": "https://www.reddit.com/r/AmItheAsshole/comments/pr31u2/aita_for_deciding_to_cut_contact_with_my_long/"}, {"title": "AITA for not driving my sister to a party when I said I would?", "content": "My mom and I (F25) visited my sister (F19) this weekend at her university for family weekend. We went to the football game, got some burgers, saw some of her friends and generally had a good time all day Saturday. She was happy that we had come up for the weekend as I had never been to see her at school and she’s in her sophomore year. \n\nThe potential asshole moment comes after we were done for the day. In the afternoon, she started talking about a friend’s birthday party that she planned on going to after dinner. I wasn’t aware of this initially, but I didn’t have a problem with it. She’s in college and she likes going to parties, that’s no big deal. She asked if I could drive her when we went back for the Airbnb for the night and I agreed. \n\nHowever, six hours later, after a day full of drinking at tailgates, at lunch, and at dinner, she was pretty drunk. As in, forgetting what was happening in conversations, wanted me to help her find a bathroom she had already visited twice and come in the stall with her, swaying while standing, slurring words, bumming cigs, drinking strange drinks she found on a table etc. You get it, we all know what drunk people look like. \n\nSo we leave dinner and get back to our separate cars, my mom driving one and my sister and I in the other. She’s still expecting me to drive her to a party when she is all but down for the count in my passenger seat. A little background on my sister: she’s still technically underage, so she doesn’t know her limits very well and often gets way too drunk. Her friends have had several conversations about having to “babysit” her at frat parties. She also gets really stubborn when she’s drunk and often refuses to leave parties even when it’s time for her to go.\n\nI told her that while she is free to do what she would like, I think that going to a party in her state and drinking more is a really bad idea and I would not drop her off. If she wanted to go she would have to find another ride because I didn’t want to be a part of this bad decision. \n\nShe did not take this well. The whole ride back to the Airbnb she kept talking about how she had been looking forward to this party all week and she had to be there for her friend’s birthday. I told her she was still able to go if she wanted to, but my car was going to the place I was sleeping and she’d have to find a ride from there. She called all of her friends to complain about how her mom and sister thought she was too drunk to go out.\n\nWe went back to the Airbnb and she fell asleep on the couch immediately. She then woke up about three hours later and called a guy she hooked up with once who picked her up and took her back to her apartment instead of staying with us like she originally planned (not a judgement, just proving her desperation to leave the house). \n\nI felt like I was just trying to look out for her best interests while she was intoxicated, but now she’s mad at me. AITA?", "verdict": "Not the A-hole", "score": 1.0, "created": 1632034470.0, "author_fullname": "Madwoman-inthe-attic", "url": "https://www.reddit.com/r/AmItheAsshole/comments/pr323y/aita_for_not_driving_my_sister_to_a_party_when_i/"}, {"title": "AITA for “using” my friend to get to a party", "content": "T having a party w alc and A lives nearby. Im not allowed to sleep at Ts so i asked A if i could sleepover at her house. When i asked her she said “ur using me” and i said yeah. \n\nI did kinda use her to go to the party but i enjoy hanging w her and sleeping pver at her house normally. AITA for “using her” to go to a party?", "verdict": null, "score": 1.0, "created": 1632034486.0, "author_fullname": "GloomyLoad8546", "url": "https://www.reddit.com/r/AmItheAsshole/comments/pr327q/aita_for_using_my_friend_to_get_to_a_party/"}, {"title": "AITA for not wanting my boyfriends band mate in the house?", "content": "[removed]", "verdict": null, "score": 1.0, "created": 1632034601.0, "author_fullname": "nyknac", "url": "https://www.reddit.com/r/AmItheAsshole/comments/pr32yj/aita_for_not_wanting_my_boyfriends_band_mate_in/"}, {"title": "AITA for starting some music and opening reddit after some fun time with my SO?", "content": "Throwaway for very obvious reasons.\n\nIs it bad that I just enjoyed some wonderful horny time with my SO (over text+images), we cooled down and both went to bed, and I instinctually opened my phone because that's what I do for no particular reason when I have nothing else I'm actively doing?\n\nI feel like it's a terrible thing to do, even though they're in bed asleep now, that I'm in my bed opening reddit. It feels like I'm so disaffectionate and I should just calm down and chill for a bit. It seems like a legitimate issue to me and I don't know what to do or think about it. \n\nBeing an asshole is entirely reasonable to me here and I entirely understand if that's the case.\n\nside note: I hope (and am pretty sure) this doesn't break rule 11 (for relationships) because it's not something I did in response to a thing they did or an argument we had or something, it's an action I feel bad about taking.", "verdict": null, "score": 1.0, "created": 1632034945.0, "author_fullname": "throwawaystupidshi", "url": "https://www.reddit.com/r/AmItheAsshole/comments/pr35it/aita_for_starting_some_music_and_opening_reddit/"}, {"title": "WIBTA if I sat my maid of honor at the end of the table because of her child?", "content": "I'm getting married in few weeks and we have to finally send our seating plan to the venue. I'm having a hard time placing my maid of honor at the table, though... I love her, she's a friend and a sweet person, but she'll also be attending the wedding with her baby, who will be only 6 months old. We will only have one long table, with me and my fiancee seating in the middle, and I know that if I seat her nearby the child might be getting on other people nerves (it's learning to talk, screaming loudly, crying every other minute, you know how small children are) and I wanted my guests (and ourselves) to have good time, nice chat, some wine, not constantly having to deal with crying and demanding child. \n\nI feel like such an asshole, but I really don't want my whole wedding be centered around this baby. Even if they would take the baby out every time it gets loud (which is frankly impossible), they would leave 2 or 3 empty seats in the middle of the table, where I could actually sit someone who would be able to enjoy other people company and contribute to the party. I was thinking about seating them at the end of the table for 2 reasons:\n\n\\- Someone will have to seat there either way... And wouldn't it be most sensible to seat there people who have to constantly get up and move, change the baby, take it for a stroll, etc?\n\n\\- It could actually be better for the child - less people, less noise, less chaos.\n\nI don't know what to do... I love them, but I REALLY don't want to sit next to a toddler my whole wedding and force my other guests to do so. I know how disruptive and annoying it is for most people. What would you do in my situation? WIBTA if I sit them for the first half of the wedding by the end of the table so 1) they have more space 2) they don't disturb other guests with their child?\n\nI'm dreading this, because I feel this is something she might get really upset about, but the alternative is potentially ruining half of the wedding for other guests.", "verdict": null, "score": 1.0, "created": 1632034957.0, "author_fullname": "Terrible_Vermicelli1", "url": "https://www.reddit.com/r/AmItheAsshole/comments/pr35m6/wibta_if_i_sat_my_maid_of_honor_at_the_end_of_the/"}, {"title": "AITA for telling my friend to stop hijacking convos to be about her?", "content": "I have a friend who’s usually the sweetest girl ever, but there’s one thing that always bothers me about her. We have no problem venting to each other. But anytime I try to vent, she always ends up turning it around to be about her problems. \n\nToday, it happened again while I was telling her about some side effects of my ADHD, and she started telling me about how she experiences those effects too, and starts telling her own venting stories once again. I ended up just being fed up and snapped at her a bit, telling her to stop making every convo about her problems.\n\nAfter tensions died down a bit, I apologized for flying off the handle, and I’m worried I might’ve upset her. She doesn’t seem mad, but I still feel like an asshole. Was this an asshole move, and how can I make it up to her?", "verdict": null, "score": 1.0, "created": 1632035017.0, "author_fullname": "Strange-Pollution-59", "url": "https://www.reddit.com/r/AmItheAsshole/comments/pr3614/aita_for_telling_my_friend_to_stop_hijacking/"}, {"title": "Aita for my response to my boss saying 'Run, Wilbur' to me?", "content": " We work in catering in a rural area. Yesterday, during the day, I noticed a blue tarp that was about to go flying \\[it was a windy day\\] and asked my boss if she wanted me to get it. Boss said yes so I started walking and out the door, I hear 'run, Wilbur'.\n\nI'm not going to mince words, I am considerably overweight \\[obese\\] and the first thing that came to my thought process was the pig from Charlotte's Web. It hurt me very deeply.\n\nAfter I made sure the tarp couldn't go flying away, I went back into the kitchen and said \"I'm going to be as nice as I can but *don't ever* call me that again\".\n\nI don't make eye contact but the convo went like this:\n\nB: What do you mean?\n\nMe: Don't call me a pig.\n\nB: What? I never called you a pig.\n\nMe: Wilbur is a pig's name. From Charlotte's Web.\n\nB: I've never heard of that. I just heard it from a tv show. I've never called you any names.\n\nMe: Yes you have, you called me a sumo wrestler three years ago.\n\nB: You're *still* going on about that? I'm actually offended.\n\nIt pretty much fizzled out after that because she tried to defend herself.\n\nI internalise a lot, that sumo comment has been in my head for the last three years. I asked her to apologise when she said it, she did 'I'm sorry' but I asked her 'are you really sorry or just saying it and never actually feel sorry' and she said she would never truly be apologetic for it.\n\nMost of the time, it's okay working there. I am the slowest but not the worst \\[her words, not mine\\], the other workers are very nice and Boss is warm and friendly most of the time.\n\nThe times when I hate it is when I say something she says hurts my feelings, she will say I'm too sensitive and I need to toughen up. Her boss during her trainee/apprenticeship was commonly angry and very particular apparently.\n\nOne time, when I talked about the dark side of my mental health, she told me to stop talking about it but when her daughter was affected, Boss worried day and night and told her daughter to take a few days off.", "verdict": "Not the A-hole", "score": 1.0, "created": 1632035171.0, "author_fullname": "ElektrikRush", "url": "https://www.reddit.com/r/AmItheAsshole/comments/pr371z/aita_for_my_response_to_my_boss_saying_run_wilbur/"}, {"title": "AITA for refusing to give my ex boyfriend his half of the security deposit.", "content": "[removed]", "verdict": null, "score": 1.0, "created": 1632035228.0, "author_fullname": "rustygluegun", "url": "https://www.reddit.com/r/AmItheAsshole/comments/pr37fl/aita_for_refusing_to_give_my_ex_boyfriend_his/"}, {"title": "Am i the asshole for going off on the guy that cheated on my best friend", "content": "[removed]", "verdict": null, "score": 1.0, "created": 1632035365.0, "author_fullname": "Knight_wing39", "url": "https://www.reddit.com/r/AmItheAsshole/comments/pr38e4/am_i_the_asshole_for_going_off_on_the_guy_that/"}, {"title": "AITA for saying I’m used to depression?", "content": "This happened a few days ago, but I can’t seem to wrap my head around it, so I figured this was the right place to go. \n\nI’m (17,M) a bit of a robot when it comes to emotions, or at least that’s what acquaintances and friends often tell me. But they also tell me I’m a pretty good listener and I give them advice if they ever want to vent or ask for help. One day a friend of mine (16,M) hasn’t been himself, I asked him what’s wrong and he told me what’s going on, I tell him my thoughts and he thanks me for the advice. This time I’ve received a question that I’ve never gotten before. He said “How are you so good at dealing with it all?” I asked him what he meant and he clarified, he meant dealing with sadness, loneliness, and depression. I simply responded with “I’m just used to it” and he immediately gave me a dirty look, then he said “How can you say that so casually? That’s actually disgusting”. I was confused, I told him “it’s just how I grew up” and he walked away from me, I haven’t talked to him sense. \n\nI don’t know if he felt his problems were undermined because of what I said but I genuinely meant what I said, if that’s how it came across then I’d apologize immediately but I don’t see the problem with saying “I’m used to it”. Or at least not yet anyways \n\nWhat do you think? AITA?", "verdict": "Not the A-hole", "score": 1.0, "created": 1632035432.0, "author_fullname": "Skippy8690", "url": "https://www.reddit.com/r/AmItheAsshole/comments/pr38w3/aita_for_saying_im_used_to_depression/"}, {"title": "AITA for wanting to keep the thermostat at a “freezing” temperature?", "content": "So we live in Arizona and I am 8 weeks postpartum and breastfeeding and I am HOT from hormones all the time. Like hair wet from sweat when I’m just sitting down. I like to keep the air at 76 degrees. Then I have to sleep with a fan on, because if I don’t, I wake up covered in sweat- even if I’m just in my underwear. \n\nNow the problem comes in with my husband. He is always complaining about how cold the house is and keeps trying to sneak the temperature to 78. It’s not like I’m constantly checking it either- I literally only look when I think to myself “man I feel really hot”. I ask him to stop changing it and again- his defense is that it’s so cold. And that our 3 year old says she’s cold (she was sick with a fever at that point so…)\n\nI understand that he feels cold- but to be fair, he could wear pants instead of shorts, or wear a shirt to bed, or even use an actual blanket instead of sheet at night. He doesn’t give me any reasoning as to why he doesn’t do this. When it becomes a fight I tell him that if there was a way for me to fix my problem that is simply putting on more clothes, I would do it. \n\nSo, AITA for wanting to keep the air at a “freezing” 76 degrees?", "verdict": "Not the A-hole", "score": 1.0, "created": 1632035673.0, "author_fullname": "GreyWarden93", "url": "https://www.reddit.com/r/AmItheAsshole/comments/pr3aim/aita_for_wanting_to_keep_the_thermostat_at_a/"}, {"title": "AITA if I post a picture of my bullies/abuser on internet?", "content": "[removed]", "verdict": null, "score": 1.0, "created": 1632035881.0, "author_fullname": "CheeseandCorgi", "url": "https://www.reddit.com/r/AmItheAsshole/comments/pr3bza/aita_if_i_post_a_picture_of_my_bulliesabuser_on/"}, {"title": "AITA He wanted to be with me for 3 years and now that I'm available he doesn't want me and I'm upset.", "content": "Ok, before you judge me, hear me out. I moved states to start a new career. I was a manager and started having feeling for a subordinate. He really liked me and I liked him, but because of strict company rules we could not date. If we had and people found out I would have been fired. I could not jeopardize my job so I never made any advances past our initial flirting, but we became best friends with underlying feelings for eachother. For 3 years he has wanted to be with me but I hadn't let it happen even though I wanted it too. Despite us liking each other, I knew we could date because of work. So, during this 3 year period I got into a serious relationship with someone else and he had flings. I know me being in the relationship hurt his feelings, but I was trying to live my life since I couldn't be with him. Eventually I left that job and ended my relationship due to personal issues (not to be with my subordinate). But now there was an opportunity. For the first time since we met he and I were both single and in a place where we could date without fear of being jobless. We went on one date and then a week went by with silence.  Turns out in the week that went by he rekindled a romance with a past lover and they decided to be boyfriend and girlfriend. I am hurt, I feel rejected, and confused. I feel like an asshole because he had to watch me be in a relationship with someone else for years and I know that hurt him. But now that I'm available and we had the opportunity he just gave it up. He has been head over heels for me for years and now it's gone. \n\nAITA?", "verdict": null, "score": 1.0, "created": 1632035890.0, "author_fullname": "gruner678", "url": "https://www.reddit.com/r/AmItheAsshole/comments/pr3c1x/aita_he_wanted_to_be_with_me_for_3_years_and_now/"}, {"title": "WIBTA if I told my parents everything?", "content": "[removed]", "verdict": null, "score": 1.0, "created": 1632035925.0, "author_fullname": "Kawaii_Aikocchi", "url": "https://www.reddit.com/r/AmItheAsshole/comments/pr3c9h/wibta_if_i_told_my_parents_everything/"}, {"title": "AITA For Getting Involved In Someone Else’s “Family Drama”", "content": "Here it is-\n\nI (f16) am in high school. I do a few clubs and sports during the year, so I swing between a bunch of friend groups that I all get along with. In one, I’m friends with Jane (f15). In another, I’m friends with Elle (f16). They’re sisters. Elle and I sorta hang out more because we’re in the same grade and have classes together, but I really like Jane. She’s just so kind to everyone. Jane is dating Cody (m16) who is another friend of mine. \n\nJane was upset because there’s a rumor going around that she has an sti. This started going around right when Jane and Cody started dating. He, the awesome guy that he is, didn’t give a shit, saying that their sexual health is between just them. (Seriously, he’s great.) Jane was of course very embarrassed. \n\nOne day, Elle and I were walking when she started talking about Cody. She said that he and Jane shouldn’t be together cause Jane has an sti. I stopped dead in my tracks and asked why she’d say that. She just shrugged it off! She said that it’s true and it’s why they should break up. I asked who told her that. Elle said that she knows cause she’s her sister. I asked her who she told and she said “I dunno, a few people.”\n\nI left shortly after because I felt really uncomfortable. I considered what to do as I walked back to school. But the only right thing I could think of was to tell Jane. I pulled her aside after school and sat her down in a quiet stairwell so that we couldn’t be heard. I told her as gently as I could what Elle had said. Of course, she was shocked and disgusted. She cried a little, we talked a little. But it was as private of an affair as I could do at the time. She composed herself and left for the day. \n\nLater that night, my phone starts blowing up with Elle calling me every name under the sun. Cody also texted me to confirm what I had told Jane. I did so without details out of respect for Jane. Elle kinda threatened me a bit but I doubt she’d ever actually do anything considering I can hold my own very well. \n\nThe problem I’d that since then, Elle has gone around and told people what happened and everyone is saying I should have just stayed out of it and not caused drama. But to me, it’s not just one of my friends talking shit about the other. It’s a sister spreading really hurtful and damaging lies about the other to anyone born with ears. Not to mention that Elle started this by spreading rumors. I also told Jane privately and didn’t make a scene of anything.I asked my older brother because he goes to our school too. He said I should have stayed out of it. But I argued that if he was going around our school and telling everyone I had herpes, you bet your ass I’d want to know. \n\nJane appreciates that I immediately told her the truth and Cody appreciates me looking out for their relationship and for his girlfriend. And to me, that’s all that really matters. But doubt has seeped into my brain cavities and now I’m not sure. \n\nSo, AITA?", "verdict": "Not the A-hole", "score": 1.0, "created": 1632035948.0, "author_fullname": "yikesmobile6000", "url": "https://www.reddit.com/r/AmItheAsshole/comments/pr3cf1/aita_for_getting_involved_in_someone_elses_family/"}, {"title": "Am I the asshole for hating my parents?", "content": "[removed]", "verdict": null, "score": 1.0, "created": 1632035972.0, "author_fullname": "Destructive_Princess", "url": "https://www.reddit.com/r/AmItheAsshole/comments/pr3ckx/am_i_the_asshole_for_hating_my_parents/"}, {"title": "AITA for yelling at my BFF after she threatened to hurt my gf?", "content": "Me and my bestie had been friends since preschool and I had recently gotten a girlfriend (she was single). I wasn’t an asshole about it but whenever I mentioned my gf she got unreasonably pissy. So I was FaceTiming her one night and we were playing games together, and I got a text from my gf.\n     I told her what the text was and who it was from (gf) and she started talking about kicking her ass and beating her up. This continued for a few months. Mind you, she hadn’t seen gf since we were little.\n     one night she was talking sh1t about gf, and I had enough and started yelling at her about her threatening gf and how she’s being an asshole to her. She went silent and hung up with me. I tried multiple times to call her back but she wouldn’t pick up. A week later I asked why she’s being an asshole towards gf, and she said she was getting mad in advance because she knew gf is/is gonna cheat on me.\n     I feel bad for yelling at her, AITA?", "verdict": null, "score": 1.0, "created": 1632036094.0, "author_fullname": "nutella_man1432", "url": "https://www.reddit.com/r/AmItheAsshole/comments/pr3dd7/aita_for_yelling_at_my_bff_after_she_threatened/"}]