[{"title": "AITA after cutting my sister off after she was having suicidal ideations?", "content": "[removed]", "verdict": null, "score": 1.0, "created": 1632119309.0, "author_fullname": "Valuable_Security_98", "url": "https://www.reddit.com/r/AmItheAsshole/comments/prp4p9/aita_after_cutting_my_sister_off_after_she_was/"}, {"title": "AITA for pranking a girl and likely getting her suspended?", "content": "There’s a girl (17F) in my class who’s very uptight and annoying. She’s a teacher’s pet and a lover of rules, and no one likes her in our class. \n\nI’ve cheated on tests in the past like most people, and I know she’s suspicious of me cheating, even though what I do isn’t her business at all. She said to me the other day that she knows I cheat and will report me. Frankly, I think it’s hilarious she thinks she can tell me what to do or control my actions in any way, so my best friend and I decided to prank her.\n\nThe girl was sitting in the library at lunch where she always sits, probably since no one ever wants to sit with her in the lunch room. My friend had a test to make up from when she was absent and the teacher gave it to her to go take in the library. My friend and I sat at the table next to the girl, and I pretended to write down all her answers while she took the test. I kept asking her for the answers and writing things like I was cheating.\n\nLike we thought, the girl fell for it and decided to butt into our business. She reported us to the teacher. I had already taken the test, and my teacher could clearly see my friend and I put different answers for things. So she knew we didn’t cheat and asked why the girl was saying this. I said that the girl has threatened me before that she will report me for cheating (which is completely true) and that I think she just likes to bully us and threaten us. My teacher said she’s going to take action in accordance with the bullying handbook.\n\nSince there was proof we didn’t cheat, the girl will probably be suspended for threatening and bullying, since that’s the zero-tolerance policy in the bullying handbook. Our other friend knows what happened and is upset we purposely did this.", "verdict": null, "score": 1.0, "created": 1632119452.0, "author_fullname": "mauelekuu", "url": "https://www.reddit.com/r/AmItheAsshole/comments/prp5s6/aita_for_pranking_a_girl_and_likely_getting_her/"}, {"title": "AITA for saying my mom’s opinion about me doesn’t matter?", "content": " \n\nYesterday I(21f) got a new haircut. I really love it and it makes me look really cute. When I got home, my mom said “what the fuck have you done with your hair? You don’t look good at all”. I ignored her. I went to my room. I showed my hair to my siblings(18f and 12m) and they loved it. My mom again came to our room and said, \"You look like a monkey. This hair doesn’t suit you at all. You look like a crazy woman.” She was nagging and nagging. Even my sister got annoyed and said, \"it's just her hair, what’s the big deal?” She didn’t stop. I then said, “I  absolutely love it and what you think doesn’t matter to me in the slightest. I don’t care. It’s my hair and I will do it as I will. Your opinion means nothing to me” She went on saying,” Of course. Who am I to you? Do what you wish.” (in an emotional way, being she is my mother) And she hasn't talked to me since. I am not really dying to talk to her. And this morning my father came to my room and said, \"What is wrong with your hair? You have got too much freedom. You are out of control”.\n\nThe haircut I got is just bangs and layers. That’s it. \n\nI said what I said because whatever I do is always an issue to my mom. The last time I got my hair dyed, she yelled at me saying, “you have got too much freedom. Who told you to get your hair dyed and who gave you money?” I kept silent at the time. I never ask my parents for money. I buy dresses for myself. They pay for my studies. That’s it. And trust me when I say this, I have studied through scholarships for most of my life. They are paying almost 4000$ for my undergrad. I even buy my siblings lunch almost everyday when my parents go to work without giving them pocket money. I always buy dresses for my sister. I help mom with dishes. In fact, I do all the dishes, every time. It’s not that I am sitting here on my ass all the time. \n\nBefore someone says, move out or you live with your parents and all that, let me tell you. Moving out from your parents’ house is not a norm here. If anything, it is considered as abandoning your parents and you will be called a “rebel”. Since I am a female, the only time I am allowed to move out from here is when I get married or if I go abroad to study. I plan on doing the latter. And I am also searching for a job right now.", "verdict": "Not the A-hole", "score": 1.0, "created": 1632119648.0, "author_fullname": "TThr0owawayy", "url": "https://www.reddit.com/r/AmItheAsshole/comments/prp796/aita_for_saying_my_moms_opinion_about_me_doesnt/"}, {"title": "AITA for telling my sister I can’t talk to her anymore until she decides to get help?", "content": "I’m 27f and my sister is 29f alcoholic/major depressive. She called me a few nights ago at 2am and was really down. Earlier in the day I had contacted her and asked her if she needed to come over, which she declined. Another thing that really annoys me is she is always calling between 2-4am even when I told her I have work and I get up at 5am and not to call me so late (she has never respected this boundary). On this night I snapped and I told her I was very worried for her and that she desperately needed to get help bc I didn’t want to bury my sister. She cut me off and said she was going to bed. \n\n\nShe lives with my mom and apparently my mom woke up in the night and my sister said that talking to me pushed her over the edge. And she has spent 3 days crying and in a “worse” place now that I told her and my mom that I need to distance myself for a while, or until she decides to get help, because it’s emotionally taxing on me (who also has my own mental health to deal with). My mom and both my sisters (the oldest is 33) are saying I’m abandoning her at her lowest. \n\n\nMy sister (29) has been an alcoholic for 15yrs and always been in the same place. I’ve been there for her and protected her how I can for as long as I remember. I feel insulted that they think I’m “abandoning” her. \n\n\nMy mom is an extreme enabler and her and my sister (29) have a severely codependent relationship, and I don’t see anything changing. My other sister (33) has her own family and told me I need to just listen and accept thats how things are and will be. I know myself and I don’t think I’ll ever reach that level of complacency and will always try to help bc of how dire her situation is. She needs to be in a hospital or rehab or something, and not voluntarily. Maybe I’m being immature idk. But it’s been the hardest thing to watch her continue to destroy herself, never seek help, and so on. \n\n\nMy mom told me it’s making my sisters (29) depression worse and I told her that mine was important too. \n\nAITA?", "verdict": null, "score": 1.0, "created": 1632119662.0, "author_fullname": "Valuable_Security_98", "url": "https://www.reddit.com/r/AmItheAsshole/comments/prp7cz/aita_for_telling_my_sister_i_cant_talk_to_her/"}, {"title": "AITAH for releasing an archagent of eternal suffrage upon a small peasant village due to them not relaying to me their gold?", "content": "[removed]", "verdict": null, "score": 1.0, "created": 1632119743.0, "author_fullname": "slayerwillbeinstrive", "url": "https://www.reddit.com/r/AmItheAsshole/comments/prp7x6/aitah_for_releasing_an_archagent_of_eternal/"}, {"title": "AITA for accusing my “girlfriend” of cheating?", "content": "I (21M) has been exclusive with my “gf” (21F) for a month. One day her and a couple of her friends (which was celebrating one of their birthday) went to eat lunch. It was her, her friend, A (23F), her friend’s bf, S (23M), and one of their friend, M (26M). She had posted on her story of them hanging out, but one post stood out to me. It was a picture of her and M with a filter on it that read babe w hearts on their face. I couldn’t help, but feel strangely since I think it gives off the wrong impression. I had asked her about, but she reassured me that it didn’t mean anything. Later that day, I was waiting on them to tell me when and where we were going to eat for the birthday dinner. I had texted and called my “gf” multiple times to ask her, but I could not get a hold of her. I was feeling a lil uneasy about it, since this was a first for me. I called her friend, A, to ask about the dinner plan and asked where my “gf” was. She told me “she had went home earlier” and that made me very confused. Now I’m overthinking about the post, and how my calls and text are being dodged, and now I’m told that she’s been at home. I couldn’t help but think of the worst thing possible. I automatically assumed that she had cheated on me with M, and had planned to leave her.\n\n-turns out she was at home getting ready for the dinner and she told me she didn’t have time to look at her phone\n\nAITA?", "verdict": null, "score": 1.0, "created": 1632119896.0, "author_fullname": "Bubbly_Abies8129", "url": "https://www.reddit.com/r/AmItheAsshole/comments/prp90c/aita_for_accusing_my_girlfriend_of_cheating/"}, {"title": "AITA for asking a girl what happened to her boobs", "content": "Im 28M shes 25F\n\nIve been seeing this girl recently and we have been on 4 really good dates until now. She asked me to head back to her place on the 5th date. I did go. She went to her bathroom and came out naked, but well, i saw that well her chest was almost flat. \n\nI was really surprised and so i asked her what had happened to her chest. She said that she stuffed her bra, she asked me why I asked her and i said it was weird for me. She got angry and called me an asshole. I just didnt know what to do. That made me lose a lot of attraction to her\n\nI have certain physical standards for women I date,  They should have at least B cups, I do not date blondes, only date brunettes, should have thin lips and they should not have an hourglass figure bc i find that unattractive. \n\nShe said I was being a jerk and asked me to leave. I'm not going to tell my friends about this bc im too embarrased,  so im on reddit\n\nAITA?", "verdict": null, "score": 1.0, "created": 1632119998.0, "author_fullname": "throwRAfakeboobs", "url": "https://www.reddit.com/r/AmItheAsshole/comments/prp9rc/aita_for_asking_a_girl_what_happened_to_her_boobs/"}, {"title": "AITA for telling my wife that I think it was wrong for her brother to buy a diamond ring and propose to his girlfriend two weeks after we donated and fundraised to help him after he lost his home to a fire?", "content": "My BIL has lived with his girlfriend for almost two years. He has been through terrible tragedy before, losing his previous serious girlfriend about 5 years ago. He unfortunately recently went through another horrible tragedy, losing his home to a forest fire. Him and his girlfriend are safe. They were able to evacuate, get out almost all of their belongings and help neighbors evacuate too. I cannot imagine how bad it would feel to experience the amount of loss that he has. Luckily, he has a place to live temporarily through friends and a great support system.\n\nMy FIL set up a gofundme, with my BIL approving it and advertising it. The goal was to help raise money for what was lost, what may not be covered under insurance and to help them get by in the meantime. I happily donated a generous amount, and I spread the word to my friends and family. I wanted to help, and I figured even every little bit would be helpful. Many of my family members donated generous amounts as well. The gofundme was successful in fundraising a solid amount of money, and I was grateful.\n\nA week or two later, he proposed to his girlfriend. They had been together long enough and are a good match. Everyone is happy that there is some positive news for them after such an awful situation. I am happy for them too.\n\nHowever, he proposed with a decently-sized diamond ring. I learned that he bought the ring after all the fundraising. He did not have the ring before the fire. The fire was the catalyst for the proposal. I told my wife that it felt wrong that he bought an expensive ring after asking for and accepting donations. I feel that the money was given to help him rebuild and get by in other ways. Of course it is his money to do what he wants with it, and this is rising from the ashes in just a different way than what I was intending to contribute.\n\nMy wife argues that he was planning on proposing before, and that he had the money for the ring already. I want to give him the benefit of the doubt and say this is true. However, if he had enough money for an expensive ring, then he didn’t truly need a gofundme. In my opinion, he should have gotten her a more affordable ring considering the circumstances. \n\nMy wife sees nothing wrong with the situation, and she said she couldn’t believe that I thought her brother was such a horrible person and would do such a thing. I don’t, and I feel sorry for what he has been through. I’m happy that he has some good news. The timeline of events with the fundraising just leaves a bad taste in my mouth, and I feel taken advantage of, in a way. I also feel bad for encouraging my friends and family to help. The expensive purchase doesn’t feel right, and I feel used. AITA?", "verdict": null, "score": 1.0, "created": 1632120035.0, "author_fullname": "theperk", "url": "https://www.reddit.com/r/AmItheAsshole/comments/prpa25/aita_for_telling_my_wife_that_i_think_it_was/"}, {"title": "AITA for asking a girl what happened to her boobs", "content": " \n\nIm 28M shes 25F.\n\nIve been seeing this girl recently and we have been on 4 really good dates until now. She asked me to head back to her place on the 5th date. I did go. She went to her bathroom and came out naked, but well, i saw that well her chest was almost flat.\n\nI was really surprised and so i asked her what had happened to her chest. She said that she stuffed her bra, she asked me why I asked her and i said it was weird for me. She got angry and called me an asshole. I just didnt know what to do. That made me lose a lot of attraction to her\n\nI have certain physical standards for women I date, They should have at least B cups, I do not date blondes, only date brunettes, should have thin lips and they should not have an hourglass figure bc i find that unattractive.\n\nShe said I was being a jerk and asked me to leave. I'm not going to tell my friends about this bc im too embarrased, so im on reddit\n\nAITA?", "verdict": null, "score": 1.0, "created": 1632120100.0, "author_fullname": "throwRAfakeboobs", "url": "https://www.reddit.com/r/AmItheAsshole/comments/prpaie/aita_for_asking_a_girl_what_happened_to_her_boobs/"}, {"title": "AITA for leaving my family to live with my girlfriend and not wanting to pay rent to my brother?", "content": "Idk if this post will even be well suited for this subreddit but I think this is the closest thing I could think of.\n\nSo a bit of back story, I’ve been living with my brother for over 6 years and have been paying him rent for those six years one day I brought up the idea  of moving out to him and my brother was very against it and got into a huge argument with me about it, my main reasonings were that I wanted to be with my girlfriend and I’m the only one that does chores around the house but I told him I appreciate that he let me be with him for so long but I would like to go try things on my own. months go by and my girlfriends lease is ending so we go looking for apartments and eventually find one she like we do several meetings with the apartment managers and I decide to add my name to the lease I tell my brother about what I did and another argument occurred he brings my dad and step mom along to get me to cancel the lease agreement I stood my ground and said no this disagreement went on for hours and my family calling me a idiot and saying I’m only doing this for sex and they got into some personal and private stuff claiming they are trying to help me not hurt me. Weeks pass and I begin living with my girlfriend and we are happy together and the beginning of the new month I pay my first bill to the apartment and I receive a text from my brother stating that I need to pay rent to him too, I told I will pay because the leave was so sudden and then he got our dad involved again and forced me into a deal we’re I have to pay until he gets a new tenant I agree and continue on with my life. That was since January it’s about to be October and I’m still paying 2 rents and my girlfriend doesn’t know am I the asshole for wanting to stop wanting to pay  rent to my brother? He has taken care of me my whole life and we do get along once in a while and he is my only brother what do I do?", "verdict": null, "score": 1.0, "created": 1632120123.0, "author_fullname": "Destinmonkey", "url": "https://www.reddit.com/r/AmItheAsshole/comments/prpao7/aita_for_leaving_my_family_to_live_with_my/"}, {"title": "AITA for offering to take my younger nephew so my older nephew gets time with his parents?", "content": "My sister and her husband have two boys. James 7 and Luke 3. Last year Luke was diagnosed with diabetes and the household money has been spent on specialists for him, two hospital stays, and medications. It has also taken up their time and James has been feeling more and more displaced of late. He admitted to me and my brother that he resents Luke for taking his parents away from him so much and his life was better before he had a brother. So I suggested I could look after Luke overnight if they wanted to get some special time in with James. They said it wasn't needed. Then my sister asked why I offered. I told her I thought it would be nice for James to get some time since they've been busy lately. She told me he was doing fine and he doesn't need extra time. That they need to focus on being a family and she resents that I would suggest that by offering to take Luke. I told her James still might appreciate the time because this last year has been difficult for him too and the changes it brought to the family. She got even more mad so I left it alone. But there has been a chill there ever since.\n\nAITA?", "verdict": "Not the A-hole", "score": 1.0, "created": 1632120202.0, "author_fullname": "TomorrowDown", "url": "https://www.reddit.com/r/AmItheAsshole/comments/prpb92/aita_for_offering_to_take_my_younger_nephew_so_my/"}, {"title": "AITA for refusing to attend a friend's wedding because of something discriminatory she had said against our own race?", "content": "[removed]", "verdict": "Not the A-hole", "score": 1.0, "created": 1632120231.0, "author_fullname": "SoledadSoledad", "url": "https://www.reddit.com/r/AmItheAsshole/comments/prpbfv/aita_for_refusing_to_attend_a_friends_wedding/"}, {"title": "AITA for mom shaming my sister because she spent her kid's cash benefits to bail out her boyfriend?", "content": "My older sister- Marj 34F has 3 children, 6, 5 and 3. She receives cash benefits for them every month.  \n\nRecently she called me to borrow money to bail out her boyfriend (not the kid's dad) because he was arrested for possession of cocaine. I refused to loan her money because I know she has no source of income to pay me back.\n\nSo last Friday I found out that she was able to bail out her boyfriend because she posted a TikTok video. I messaged her and asked who loaned her bail money. She said she used her kid's money. I called her out for being irresponsible and a terrible mother. I reminded her that her kids have needs and if she can't take care of them then I'll call CPS on her. She blew up on me and called me an asshole for threatening her. I think it's my responsibility to look out for my niece and nephews especially with my sister living with a drug user. \n\nSo am I an asshole? Was I too harsh with my words?", "verdict": "Not the A-hole", "score": 1.0, "created": 1632120554.0, "author_fullname": "Bacon4BreakfastAgain", "url": "https://www.reddit.com/r/AmItheAsshole/comments/prpdth/aita_for_mom_shaming_my_sister_because_she_spent/"}, {"title": "AITA? This guy owes me a lot of money.", "content": "So I bought a house a few years ago... Theres a 50ish year old dude (im27) who I used to watch hockey and have beers with 5 or so years ago because we were neighbours.. so when I buy my house I am looking for a friend or 2 to rent rooms and help pay the mtg (not because i need them to, but because there is room and i want to make early payments) So myself, my SO, and my other friend decide even though this dude is older we will let him rent a room...\n\nThings start off okay... bills paid... whatever.. dude is obvs pretty bad with his money but always pays rent and any debts... till he doesnt... He gets around 1200$ in debt with late rent and borrowing 20 here or there.. He starts working for me and pays it off out of his paychecks.. then he goes to work for his family, and is making more than anyone in the house, good right!? He has a POS car his family gave him for free a decade ago... rust holes, engine light, over 400000 klm... and I have a nicer but also super cheap sport coupe that he wants bad... he offers to pay me 2k, plus his POS car for it... I agree on the condition that it stays in my name till its paid.. I proceed to put about 2k into his POS car... turning it into a reliable POS... He beats the living hell out of the little sport coupe and racks up 1000$ in speeding tickets on the car (with my plate so where i live i am responsible to pay) on top of this he racks up another 1200 in late rent and insurance and so on... so at this point he is 2200 in debt.\n\nHeres the kicker, now.. he decided to fuck right off and try ghosting me... hasnt been at the house in 2 months and ends call when i try to call him. thing is i know where he is, and I know where he parks the coupe (worth much less now than when he got it from me.. he had a fender bender or 2 and hasnt done any maintanance) \n\nAm I the asshole if I go repo this car? I feel a little bad because I have his old car still and I did a bunch of work to it... so this guy will no longer have any car... but he owes me more than it is worth, and its still in my name... his old car is in my name and worth a lot more than when i got it. Im also pretty sure he has a bunch of shit stored in the car while hes at his sons apt... \n\n\n\nTLDR- guy 2x my age rented a room from me and racked up 2200 in debt... The car he drives is in my name and only worth 1500 (assuming its not in even worse shape than i think) aita if i repo it and sell to pay off his debt? (he is ghosting me when i txt or call but i know where hes parking and where hes staying...)", "verdict": "Not the A-hole", "score": 1.0, "created": 1632120915.0, "author_fullname": "ta12342069", "url": "https://www.reddit.com/r/AmItheAsshole/comments/prpghb/aita_this_guy_owes_me_a_lot_of_money/"}, {"title": "AITA for not answering on chat apps?", "content": "I am in my own train of thoughts most of the time and I get really distracted by messages on whatsapp and co. It happens that I won't reply for weeks, but then do it totally accurate and friendly. If someone wants to meet me I can do it in a short time to make it happen, but when someone is telling me about holidays or some open topic I tend to leave the answer until I am in a mood to think about it. A lot people I like are starting to be mad at me and my behavior. \n\nI must add that I think text messages are not like real conversations. We are not in the same room or situation and we are not talking without delay. In a 1o1 or group irl I am totally there and aware of the people around me. Every time I meet those persons I tell them that I suck at texting and that my behavior is not meant to disrespect them, but it seems like they don't get it. Being available all the time through the internet is completely horrible for me. Everyone can text me bullsh*t at any time and awaits an answer in seconds like I am a robot just waiting for them. \n\nI've red somewhere 'no communication is communication aswell'. But if one chooses to text me, it seems that it is not that important and I don't need to answer asap. \n\nThe only option I have is to delete the applications, but then I am totally out of reach for old and new friends.\n\nSo AITA for not deleting the app but keep on not answering as I always did?", "verdict": null, "score": 1.0, "created": 1632120964.0, "author_fullname": "dieSau", "url": "https://www.reddit.com/r/AmItheAsshole/comments/prpgus/aita_for_not_answering_on_chat_apps/"}, {"title": "San Francisco - The City (New Video)", "content": "[removed]", "verdict": null, "score": 1.0, "created": 1632120999.0, "author_fullname": "BloePuzzleheaded", "url": "https://www.reddit.com/r/AmItheAsshole/comments/prph3b/san_francisco_the_city_new_video/"}, {"title": "Met a girl on Hinge. Feeling scammed and anxious. Any advice?", "content": "[removed]", "verdict": null, "score": 1.0, "created": 1632121026.0, "author_fullname": "Pretty-Site-7916", "url": "https://www.reddit.com/r/AmItheAsshole/comments/prpha4/met_a_girl_on_hinge_feeling_scammed_and_anxious/"}, {"title": "Am i the asshole for not inviting my in-laws to my birthday dinner?", "content": "[removed]", "verdict": null, "score": 1.0, "created": 1632121273.0, "author_fullname": "psyhco_goat", "url": "https://www.reddit.com/r/AmItheAsshole/comments/prpj93/am_i_the_asshole_for_not_inviting_my_inlaws_to_my/"}, {"title": "AITA for accidentally offending my wife when I said muckbang slurping sounds are disgusting?", "content": "My wife showed me a YouTube video of a “funny” Mukbang ASMR channel. She thought it was funny because it’s basically just a mouth with the nose done up to look like eyes and it has a whole character around it. The concept was goofy, no argument there. This particular video though had a lot of slurping sloshing sounds, which is actually something I find disgusting, not by choice, like it triggers a reaction in me when I hear it too much. Like fingernails on a chalkboard for some people. I shuttered when the sounds kept going in the video and then made an offhand comment about how the slurping sounds were disgusting and I don’t understand how people enjoy listening to it.\n\nShe suddenly got really offended when I said that since she watches a lot of these kind of videos and enjoys ASMR. I told her it was the sound that grossed me out not the people who enjoy watching / listening to it, but she just got more and more angry and says I’m judging her for liking it.\n\nNothing I say will calm her down. Am I the asshole for not being able to like this and for commenting offhand about it?", "verdict": "Not the A-hole", "score": 1.0, "created": 1632121360.0, "author_fullname": "ThrowerAwayOfAccount", "url": "https://www.reddit.com/r/AmItheAsshole/comments/prpjy1/aita_for_accidentally_offending_my_wife_when_i/"}, {"title": "Am i the asshole for not inviting my in-laws to my birthday dinner?", "content": "[removed]", "verdict": null, "score": 1.0, "created": 1632121371.0, "author_fullname": "psyhco_goat", "url": "https://www.reddit.com/r/AmItheAsshole/comments/prpk0z/am_i_the_asshole_for_not_inviting_my_inlaws_to_my/"}, {"title": "Relationship with dad/family", "content": "[removed]", "verdict": null, "score": 1.0, "created": 1632121439.0, "author_fullname": "aaaaaaaaafg", "url": "https://www.reddit.com/r/AmItheAsshole/comments/prpkj0/relationship_with_dadfamily/"}, {"title": "AITA For Unfriending my Suicidal Friend?", "content": "[removed]", "verdict": null, "score": 1.0, "created": 1632121461.0, "author_fullname": "yuh_get-it_i-guess", "url": "https://www.reddit.com/r/AmItheAsshole/comments/prpkp0/aita_for_unfriending_my_suicidal_friend/"}, {"title": "AITA am i the asshole for not inviting my in-laws to my birthday dinner?", "content": "Hey OP (15F) here, just wanted to let you know this story was told from the point of view of my mother, i'm not taking sides on this but i really need this stupid petty fight of theirs to end since its really tearing my brother up seeing his mum this distressed. So any advice would be greatly appreciated.\n\nIt was my (48F) Birthday a few days ago and i was celebrating with my husband (50M) and my two kids, the day started out great but that changed around 11AM that morning when my husband confronted me about dinner - some context, usually when someone in our family has a birthday both my parents and my husbands parents will come around that night for dinner, I had invited my parents but not my husbands parents for a few reasons, 1: we had just gotten out of a level 4 lock down where we are living and his parents would have to travel to come to the dinner which are PM is advising we don't do at the moment, 2: me and his parents have never really gotten along that well, we are civil with each other but they don't like me very much. 3: i just want a quiet evening with my parents my husband and children.\n\nSo my husband confronted me about not inviting his parents and i told him those reasons but he was still mad at me and just walked off without saying anything, my parents come around and while they're here hes acting fine with me but the moment they leave he's back to silence again. A day passes and he's still giving me the silent treatment so i ask him why he's still mad at me, and he say's hes not mad at me, obviously this upsets me and we start yelling, i'm yelling about how he's giving me the worst birthday ever and how i don't deserve his silent treatment, and he's yelling about how he's doing no such thing. He walks away mid argument and go to walk into my room just to turn around too see my kids standing there, the youngest (12M) crying for me, since me and his father don't fight like this.\n\nWe just ate dinner and i was met more silence from my husband and my kids trying to stop dinner from being so quiet and awkward. So reddit AITA for this fight? i don't really think it was such a big deal, as he hardly speaks to his parents anyways, - maybe a couple times a month at most - if it really was so big to him i don't know why he couldn't of just talked it out with me civilly.", "verdict": null, "score": 1.0, "created": 1632121462.0, "author_fullname": "psyhco_goat", "url": "https://www.reddit.com/r/AmItheAsshole/comments/prpkps/aita_am_i_the_asshole_for_not_inviting_my_inlaws/"}, {"title": "WIBTA if I kick my boyfriend out?", "content": "[removed]", "verdict": null, "score": 1.0, "created": 1632121569.0, "author_fullname": "Dangerous-Sun-9878", "url": "https://www.reddit.com/r/AmItheAsshole/comments/prplj4/wibta_if_i_kick_my_boyfriend_out/"}, {"title": "WIBTA for taking my for taking my sister to small claims court", "content": "So I'm considering taking my (M22) sister (F19) to court for damages since she destroyed my iPad pro by accidently stepping on it. We have talked about it and she said that she is not going to pay any more than 300 dollars for a repair. I have since taken it to the apple store to get see how much the repair would end up costing me and they quoted me 800 dollars and when bringing it up to my sister, who has been ignoring me and interrupts me at any mention of the subject, she yelled at me saying that there is no way that she's going to pay that much since she is saving up for a new car as she has crashed her most recent one. She has been looking for the cheapest repair places in our area and going as far as to say that she found a place over an hour away and told me that I'd have to drive there to see about doing the repair since she doesn't want to go. This severely affects me with my art career and she just doesn't seem to realize that.  So WIBTA?", "verdict": null, "score": 1.0, "created": 1632121676.0, "author_fullname": "PMMePicsOfDemTatas", "url": "https://www.reddit.com/r/AmItheAsshole/comments/prpmdl/wibta_for_taking_my_for_taking_my_sister_to_small/"}, {"title": "Sharing is caring? Script ownership", "content": "[removed]", "verdict": null, "score": 1.0, "created": 1632121701.0, "author_fullname": "stringpaperplane", "url": "https://www.reddit.com/r/AmItheAsshole/comments/prpmka/sharing_is_caring_script_ownership/"}, {"title": "AITA for falling asleep while talking on phone with a girl?", "content": "So I have been texting and talking to this girl for a few months. We have been on a couple of dates and couldn't meet more often because of Covid. Last night I fell asleep while on phone with her. She was telling me some story and I was listening and then all of sudden I wake up from the sound of phone disconnecting. I realized I fell asleep and then I messaged her and tried calling but she turned off her phone. In the morning after a few attempts and a long message she said she is angry because I fell asleep and started \"snoring\" while we were talking.\n\nNow I understand why she is angry and it is my fault for falling asleep and I have even apologized. However what is bugging me is how much angry she is and she wouldn't even say anything for a long time. Is falling asleep an asshole behavior? I try to be respectful but at the same time I don't want to be apologizing too much for something I consider a honest mistake. Or maybe it is a major issue for most people and I am just blind to it.\n\nWe both are 29 years old and I am a guy.", "verdict": "Not the A-hole", "score": 1.0, "created": 1632121771.0, "author_fullname": "texas_laramie", "url": "https://www.reddit.com/r/AmItheAsshole/comments/prpn4o/aita_for_falling_asleep_while_talking_on_phone/"}]